package com.example.onlinelibraryapplication.repositories

import com.example.onlinelibraryapplication.R

data class FieldModel(
    var image: Int,
    var heading: String,
    var description: String,
    var author: String,
    var rate: String,
    var pages: String,
    var language: String,
    var price: String,
    var aboutAuthor: String,
    var URLRead: String,
    var URLListen: String
)

////////////////////////////////////////Fear//////////////////////////////////////////////////////
val fear1 = FieldModel(
    R.drawable.fear1,
    "خارج السيطرة",
    "انقشع الضباب من عينيه وتراءى له المشهد كاملا مجسما، كان بطلا لنهايته التراجيدية. انطلقت رصاصتان من المسدس. حاول الإبتعاد قبل الأولان ولكن ولات حين مناص. اخترقت الرصاصتان صدره اختراقا، وسقط على الأرض قابضا على صدره المضرج بالدماء. استمر رنين الهاتف من مكان ما على الأرض، وانطلقت السيارة مسرعة عبر الطريق، ثم اختفت في لمح البصر.",
    "وسام سعيد",
    "4.3",
    "50",
    "العربية",
    "45",
    "كاتب صحفي وروائى , إصداراته في أدب الرعب التي بدأها منذ عامين بسلسلته الرباعية «مسارات الرعب» الصادرة عن دار (دون).",
    "https://drive.google.com/file/d/1JLKe84ifj32DAPMvVETK_ag6CqM1yo2Z/view?usp=share_link",
    "https://www.youtube.com/watch?v=tm4tUhkQDNg"
)
val fear2 = FieldModel(
    R.drawable.fear22,
    "في الجانب المظلم",
    "ثلاثة أشخاص عاشوا تجارب رهيبة بالغة الغرابة سيتحدثون عنها بالتفصيل بعد أن جمعتهم الظروف في ذلك البيت المشئوم .. إنها قصص وتجارب حدثت في الباب المجاور كما يقولون .. كناية عن وقوعها بمكان قريب منك .. في (الكويت) نفسها .. ستعيش مع هذه القصص أحداثا لا تصدق من الإثارة والتشويق والغموض ! .. وستشعر بكلمات أبطالها وهمساتهم وربما ستسمع أنفاسهم اللاهثة من هول الأحداث التي مروا بها.",
    "عبد الوهاب عبد الله",
    "4.3",
    "356",
    "العربية",
    "55",
    "عبد الوهاب عبد الله السيد علي الرفاعي (22 يناير 1973) روائي وكاتب وناشر ومُحاضر ومهندس كويتي يعتبر من أوائل الكتاب الكويتيين وربما الخليجيين الذين كتبوا في عالم ما وراء الطبيعة وأدب الخيال العلمي وأدب الرعب والأدب البوليسي، بدأ الكتابة في عام 1998 من خلال سلسلة من المقالات العلمية والثقافية في مجموعة من المجلات والصحف الكويتية، ثم نشر كتابه الأول عام 1999، كما قام بتأسيس دار النشر الكويتية Nova Plus عام 2011، ويُذكر أن بعض أعماله تم تحويلها إلى أفلام قصيرة موجودة في موقع Youtube وأفلام طويلة تم عرضها في دور السينما الكويتية مثل فيلم (شقة ستة) وفيلم (بيبي)، وقد قّدم أيضا أكثر من 65 دورة في فن كتابة الرواية والقصة القصيرة في معظم دول الخليج، وتنتشر أعماله حاليا في معظم الدول العربية على نطاق واسع .. في عام 2016 حصل على تكريم من الديوان الأميري في الكويت كأحد أكثر 100 شخصية كويتية",
    "https://drive.google.com/file/d/1RFvSfB-qg_b59HcDiTZv-NL8QnAbnlAV/view?usp=share_link",
    "https://www.youtube.com/watch?v=7A16IWKRBDE"
)
val fear3 = FieldModel(
    R.drawable.fear3,
    "قواعد الرعب العشرون",
    "هل مللت من تيمات أفلام وروايات الرعب المكررة؟\n" +
            "كل عائلة تنتقل إلي بيت جديد لابد أن يكون مسكون ويجب أن يتعرض أفرادها لأقسي أنواع العذاب\n" +
            "كل فيلم به دمية لابد أن تكون هي أيضا مسكونة وسفاحة\n" +
            "البوجي مان دائما يختفي في خزانات ملابس الأطفال يستعد للهجوم عليهم أثناء غفوتهم\n" +
            "و في قبو المنزل المشئوم يرقد مصاص دماء ما يترقب الفرصة السانحة حتي يهاجم ضحاياه ليلا..إلخ\n" +
            "لو كنت مثلي تشاركني السأم بسبب كل هذه الحيل المملة فأظن أنه قد حانت اللحظة لتسخر من مخاوفك ومن كل هذه الوحوش\n" +
            "قد حانت اللحظة لتتعلم هذه القواعد\n" +
            "قواعد الرعب العشرون",
    "عمرو صالح",
    "4",
    "356",
    "العربية",
    "40",
    "الكاتب عمرو صالح مدرس مساعد في قسم الغدد الصماء والسكر-كلية طب عين شمس\n" +
            "صدرت له روايتان\n" +
            "قواعد الرعب العشرون\n" +
            " هكذا قتل زارا\n" +
            "وصدرت له مجموعتان قصصيتان\n" +
            "حوار مع صديقي الزومبي\n" +
            "حكايات الرعب والفزع",
    "https://drive.google.com/file/d/1JLKe84ifj32DAPMvVETK_ag6CqM1yo2Z/view?usp=share_link",
    "none"
)
val fear4 = FieldModel(
    R.drawable.fear4,
    "ابتسم فأنت ميت",
    "انتفض الجميع فى أماكنهم مع صوت الطرقات خاصة \"سيد\" الذى صرخ: إيه ده؟!!! لم يكد صدى الطرقات يتلاشى حتى جاء من الممر المؤدى للحمام صوت رجل يصرخ، هنا هب \"صادق\" و\"أمجد\" واقفين متسعى الأعين ، أما \"سيد\" فكاد يتعثر ويسقط وهو يتراجع بفزع مردداً بعض الآيات القرآنية بصوت مسموع.",
    " حسن الجندي",
    "4.7",
    "356",
    "العربية",
    "65",
    "الكاتب حسن الجندي كاتب وروائى مصرى شاب، غيرت رواياته مفاهيم كثيرة لعقول الشباب.. اقترن اسمه بعالم الجن والعفاريت والمخطوطات القديمة والقتلة النفسيين وعالم الرعب. على شبكة الإنترنت تخطت نسبة مشاهدات قصصه حاجز المائة ألف قارئ (100 ألف)، حصل على شهرة ليست بالقليلة داخل مصر وخارجها من خلال ثلاثيته (مخطوطة بن إسحاق) والتي وضعت منذ مدة طويلة على المنتديات العربية وانتهت بطباعتها ونزولها المكتبات المصرية.",
    "https://drive.google.com/file/d/16CHe2Sw7uJnfVxSL0L5AU5zgJ7ObFs31/view?usp=share_link",
    "https://www.youtube.com/watch?v=86R3L-GGMKw"
)
val fear5 = FieldModel(
    R.drawable.fear5,
    "الجثة الخامسة - الجزء الأول",
    "عزيزى القارئ.. هناك جثة خامسة، وهناك جثث أخرى غيرها تنتظر دورها فى الرواية، وهناك عمال المشرحة المذعورين.. هناك لعنة غامضة تمرح خفية بين الجميع وهناك شر محدق، وكارثة أخشاها بشدة تنتظر أن تتحقق.. هناك طبيب نفسي عجوز يعرف الكثير جدا، وما يعرفه يثير الهلع في النفوس، فهل يحتفظ به لنفسه، أم يخبرهم ليبصيبهم بالجنون؟!..\n" +
            "وهناك كتاب اللعنات، وهو لمن لا يعرفه كارثة حقيقية بين دفتي كتاب.. وهناك راهب روماني عرف أكثر مما ينبغي’ فنال عقابه.. وفى النهاية هناك قارئ شرس ينتظر من هذه الرواية الكثير، وهناك الكاتب الذى وعد بالكثير في هذه الرواية، ويرجو أن ينجو برقبته من غضب القارئ.. إنها رحلة مختلفة.. فهل أنت مستعد لها ؟.. لو شئت أن تفعل فأنا في انتظارك.. وهيا بنا..",
    "حسين السيد",
    "4.5",
    "356",
    "العربية",
    "35",
    "ولد الكاتب والروائى حسين السيد بجمهورية مصر العربية حيث أنه نشأ وترعرع بالقاهرة الكبرى وتلقى تعليمه بمدارسها وأكمل تعليمه الجامعى بجامعة عين شمس كلية الصيدلة وتخرج منها وأصبح دكتورًا صيدلانيًا ، وعلى الرغم من نجاحه فى حياته المهنية وتخصصه المهم جدا والصعب فى آن واحد وأنه يتوجب عليه التركيز فيه وعدم الإخلال به لأنه متعلق بأرواح الكثيرين ، إلا أنه كان مجتهدًا بعمله ولم يقف عند هذا الحد بل أن طموحه أن يصبح كاتبًا عظيمًا ومشهورًا جعله ينمى قدراته الكتابية . ❰ له مجموعة من المؤلفات أبرزها ❞ الجثة الخامسة ❝ ❞ رواية قربان بشري ❝ ❞ رواية نجع الموتى ❝ الناشرين : ❞ دار نون للنشر والتوزيع ❝ ❞ دار إبداع للإعلام والنشر ❝ ❱",
    "https://drive.google.com/file/d/1rW-xUQB2nOXJ2s8QM6wVtBiG14oG5jvb/view?usp=share_link",
    "https://www.youtube.com/watch?v=qSc63GppdJY"
)
val fear6 = FieldModel(
    R.drawable.butcher,
    "الجزار",
    "صديقى العزيز أنت هنا داخل مباحث أمن الدوله ، وصدقنى لو فعلت ما أقوله لك بهدوء فسنكون أصدقاء فى المستقبل وسترى كل الحب والعطف منى ، وإذا اخترت الطريق الصعب وأردت أن تمارس دور البطل فدعنى أقول لك شيئا بسيطا اقترب برأسه للامام قليلا وابتسامته تزداد ونبرات صوته تخرج صافية وهو يقول كل الافلام التى شاهدتها وكل الاساطير التى سمعتها عن ما يحدث هنا لا يظهر سوى 1% من ما يمكننا فعله يا صديقى.",
    "حسن الجندي",
    "4.1",
    "356",
    "العربية",
    "25",
    "الكاتب حسن الجندي كاتب وروائى مصرى شاب، غيرت رواياته مفاهيم كثيرة لعقول الشباب.. اقترن اسمه بعالم الجن والعفاريت والمخطوطات القديمة والقتلة النفسيين وعالم الرعب. على شبكة الإنترنت تخطت نسبة مشاهدات قصصه حاجز المائة ألف قارئ (100 ألف)، حصل على شهرة ليست بالقليلة داخل مصر وخارجها من خلال ثلاثيته (مخطوطة بن إسحاق) والتي وضعت منذ مدة طويلة على المنتديات العربية وانتهت بطباعتها ونزولها المكتبات المصرية.",
    "https://drive.google.com/file/d/19CDwkyvYxeTNQwMqNbxoe-RTxHFIOOby/view?usp=share_link",
    "https://www.youtube.com/watch?v=AKRrTAOmdnw"
)
val fear7 = FieldModel(
    R.drawable.fear77,
    "المرتد",
    "تناول الشاكوش والمسمار ووضع المسمار على حرف ال (م) وضرب بالشاكوش على رأس المسمار قائلا\n" +
            "\"يا أيها الموكل بحرف الميم اسألك باللذى خلقك بأن تحضر مطلوبى هنا يا مغترف من بحور معادن جواهر الاسرار .. وينابيع ملكوت جبروت الانوار يا من شممت دخنتى وحضرت الى مقامى توكل بإحضار الخادم توكل بإحضار الخادم بما يخرج من طبع حرف الميم توكل فيما امرتك به بحق طهيتف شمالييت احضر مطلوبى داخل الدائرة .. احضر مطلوبى داخل الدائرة الوحا الوحا العجل العجل الساعة الساعة",
    "حسن الجندي",
    "4.8",
    "356",
    "العربية",
    "45",
    "الكاتب حسن الجندي كاتب وروائى مصرى شاب، غيرت رواياته مفاهيم كثيرة لعقول الشباب.. اقترن اسمه بعالم الجن والعفاريت والمخطوطات القديمة والقتلة النفسيين وعالم الرعب. على شبكة الإنترنت تخطت نسبة مشاهدات قصصه حاجز المائة ألف قارئ (100 ألف)، حصل على شهرة ليست بالقليلة داخل مصر وخارجها من خلال ثلاثيته (مخطوطة بن إسحاق) والتي وضعت منذ مدة طويلة على المنتديات العربية وانتهت بطباعتها ونزولها المكتبات المصرية.",
    "https://drive.google.com/file/d/1mS5xqkogAX2IiB7llkN4q2QD-aLP3fXK/view?usp=share_link",
    "https://www.youtube.com/watch?v=ieWH1cb7lvQ"
)
val fear8 = FieldModel(
    R.drawable.fear8,
    "قسم سليمان",
    "وماذا سيحدث إن اصطادك هو بدلًا من أن تصيده أنت ؟؟\n" +
            "فأنت لم تفعل شيئًا بالحياة سوى التمني ، نعم التمني فكل ما كنت تريده وتتمناه بالحياة الثراء السريع والقصر الكبير والأموال الكثيرة وربما عروس جميلة لن تضر فوق البيعة.ولكن كيف ستحقق كل هذا يا عزيزي وأنت لا تملك شيئًا بتلك الحياة الكبيرة حتى إنك لم تحصل على وظيفة جيدة بعد تخرجك من الجامعة وسنين الدراسة الطويلة المملة، والمصاريف الكثيرة التي أنفقتها أسرتك على الدروس الخصوصية والتعليم التي مازال يذلك بها والدك كلما رأى وجهك أمامه فلقد رفضت كل الوظائف التي أحضرها لك أصدقائه متحججًا بأنك لابد أن تعمل بشهادتك، فقل لي من في هذا البلد يعمل بشهادته ؟؟حتى إنك رفضت أن تسرح بعربية الترمس على الكورنيش وربما مازلت تأخذ مصروفك من والدتك قبل الخروج من المنزل بدون علم والدك، فلقد رفض كبرياؤك حتى بيع الذرة المشوية على الطريق كما تمردت على عربة الترمس من قبلها، يبدو أنك نمرود ولا يعجبك شيء ولا مهنة بالحياة.",
    "منى حارس",
    "4.3",
    "356",
    "العربية",
    "45",
    "طبيبة بيطرية وكاتبة روايات رعب وما وراء الطبيعة من الأعمال المنشورة ورقيا رواية \"لعنة الضريح- قرين الظلام- متجر العجائز- قسم سليمان- لعنة الارواح- جحيم الأشباح - نحن نعرف ما يخيفك \" flash fiction \" - ساديم - رسائل من الجحيم - المبروكة - وفي الأدب الساخر رواية عدلات وحرامي اللحاف",
    "https://drive.google.com/file/d/1HCLj-Smgyq43LG5PcOeA0bHB6c3aGNUD/view?usp=share_link",
    "none"
)
val fear9 = FieldModel(
    R.drawable.fear9,
    "عهود الدم",
    "دعنا معا نبدأ الحكاية ثانية\n" +
            "كان هناك أب وأجداد يؤمنون أن الأمر حقيقي, وكان هناك ابن يرفض أن يصدق..\n" +
            "وكانت هناك رؤى مفزعة, وأحداث تجمد الدم في العروق, و شر لا قبل لأحد به\n" +
            "..صديقي\n" +
            "هناك قصة لم تألفها كثيرا من قبل, وهناك ألغاز تأبى الكشف عن أسرارها, وهناك بيت قديم, وهناك دعوات غامضة تحمل في طياتها الفزع والخوف.\n" +
            "صديقي. وبعد هذا, هل يروقك الكتاب؟.\n" +
            "حسنا دعنا نفتحه معا لنرى ما يخفيه من أسرار وخفايا.",
    "حسين السيد",
    "4.1",
    "356",
    "العربية",
    "70",
    "حضر مع أمه من تركيا لمصر وعمره عامان وأقامت الأسرة عند خاله في مدينة طنطا، والذي كان شيخاً لأحد التكايا التي يتجمع فيها الدراويش، والذي استمع لهم الطفل حسين فبدأ إحساسه بالموسيقي والشعر، وأتم دراسته الابتدائية في طنطا، ثم جاء للقاهرة حيث كان والده تاجراً كبيراً، ودخل حسين مدرسة الفرير الفرنسية بالخرنفش وتفوق علي جميع زملائه في اللغة العربية، وحصل علي البكالوريا (شهادة اتمام التعليم قبل الجامعي) عام 1937 شاعر غنائي وممثل مصري. ولد في طنطا بمصر من أب مصري وأم تركية.",
    "https://drive.google.com/file/d/1Sl3zeqCcIkYseaGOldNp_mzxkHfaQVc0/view?usp=share_link",
    "https://www.youtube.com/watch?v=-POjqgbgVD0"
)
val fear10 = FieldModel(
    R.drawable.fear10,
    "سر الغرفة 207",
    "بالإضافة إلى قصص دفن الأحياء، على كل كاتب رعب أن يقدم قصة واحدة على الأقل عن غرف الفنادق المسكونة، لأن غرف الفنادق أماكن مخفية بطبعها، تخيل كم من الناس نام في الفراش قبلك؟ كم منهم كان مريضاً؟ كم منهم كان يفقد عقله؟ كم منهم كان يفكر في قراءة بضع آيات أخيرة من الكتاب المقدس الموضوع في درج الكومود بجوار الفراش قبل أن يشنق نفسه في خزانة الملابس بجوار التليفزيون؟\"بالفعل غرف الفنادق أماكن مرعبة، وأكثرها إرعاباً هي الغرفة 207.. في هذه الغرفة تحتشد أشنع مخاوفك التي داريتها حتى عن نفسك منذ كنت طفلاً.. في هذه الغرفة يتلاشى الحاجز بين الحقيقة والوهم.. بين المخاوف المشروعة والكابوس.. في هذه الغرفة يتلاشى الحاجز بين الماضي والمستقبل. وبين ذاتك والآخرين.. لا تتلصص ولا تختلس النظرات عبر ثقب المفتاح. فقط فلتدر مقبض الباب في هدوء وحذر.. ولتدخل الغرفة رقم 207..",
    "دكتور أحمد خالد توفيق",
    "4.9",
    "356",
    "العربية",
    "85",
    "المؤلف كتاب حكايات الغرفة 207 والمؤلف لـ 780 كتب أخرى.\n" +
            "أحمد خالد توفيق فراج (10 من يونيو 1962م - 15 من رجب 1439 هـ/ 2 من إبريل 2018م)، مؤلف وروائي وطبيب مصري. يعد أول كاتب عربي في مجال أدب الرعب والأشهر في مجال أدب الشباب والفانتازيا والخيال العلمي ولقب بالعراب.\n" +
            "\n" +
            "بدأت رحلته الأدبية مع كتابة سلسلة ما وراء الطبيعة، ورغم أن أدب الرعب لم يكن سائدًا في ذلك الوقت فإن السلسلة حققت نجاحًا كبيرًا واستقبالًا جيدًا من الجمهور، ما شجعه على استكمالها، وأصدر بعدها سلسلة فانتازيا عام 1995 وسلسلة سفاري عام 1996. في عام 2006 أصدر سلسلة WWW.",
    "https://drive.google.com/file/d/11wSG0ewEDynw2MgAC9T1GsyfRrC3h4sj/view?usp=share_link",
    "https://www.youtube.com/watch?v=jp2forw5zpU"
)


////////////////////////////////////////Policy//////////////////////////////////////////////////////
val pol1 = FieldModel(
    R.drawable.policy1,
    "تلخيص السياسة",
    " تشير المصادر العربية القديمة، فضلاً عن الحديثة منها، إلى أن ابن رشد قد وضع تلخيصاً لكتاب السياسة لأفلاطون، وتلخيصاً لكتاب الأخلاق النيقوماخية لأرسطو، ووضعه بين أيدي الدارسين لفلسفة هذا الفيلسوف الكبير والمهتمين بفلسفة القرون الوسطى العربية منها وغير العربية، والكتاب هو من الكتب المؤكدة نسبتها إلى ابن رشد، حيث أنه لا يوجد هناك من يشكك في هذه النسبة سواء من القدامى أو المحدثين، إلا أنه قام بينهم تنازع في تسمية هذا الكتاب: هل هو جوامع لسياسة أفلاطون، أم أنه تلخيص لسياسة أفلاطون؟ والرأي أن كتاب ابن رشد هذا هو إلى التلخيص أقرب، ويعتبر عم ابن رشد في هذا الكتاب من أبرز الأعمال الفلسفية حتى وإن كان النص لأفلاطون، لكنه نص أعاد ابن رشد بناءه بطريقة جردته من الشوائب الميتافيزيقية والحكايا الخرافية والأقاويل غير العلمية لتجعل منه نصا سياسيا محضا، نصا يعتبر بحق أعمق من الكتب الأخرى.",
    "بو الوليد محمد",
    "3.5",
    "356",
    "العربية",
    "135",
    "بو الوليد محمد بن أحمد بن محمد بن أحمد بن أحمد بن رشد (14 إبريل 1126م - 10 ديسمبر 1198م) (520 هـ- 595 هـ) ولد في قرطبة هو فيلسوف، وطبيب، وفقيه، وقاضي، وفلكي، وفيزيائي ,مسلم. نشأ في أسرة من أكثر الأسر وجاهة في الأندلس والتي عرفت بالمذهب المالكي، حفظ موطأ مالك، وديوان المتنبي.ودرس الفقه على المذهب المالكي والعقيدة على المذهب الأشعري. يعد ابن رشد من أهم فلاسفة الإسلام. دافع عن الفلسفة وصحح علماء وفلاسفة سابقين له كابن سينا والفارابي في فهم بعض نظريات أفلاطون وأرسطو. قدمه ابن طفيل لأبي يعقوب خليفة الموحدين فعينه طبيباً له ثم قاضياً في قرطبة. تولّى ابن رشد منصب القضاء في أشبيلية، وأقبل على تفسير آثار أرسطو، تلبية لرغبة الخليفة الموحدي أبي يعقوب يوسف، تعرض ابن رشد في آخر حياته لمحنة حيث اتهمه علماء الأندلس والمعارضين له بالكفر و الإلحاد ثم أبعده أبو يعقوب يوسف إلى مراكش وتوفي فيها.",
    "https://drive.google.com/file/d/1GOJfJLG26Vt_z9TswA9uq5uszVvYpI6-/view?usp=share_link",
    "none"
)
val pol2 = FieldModel(
    R.drawable.policy2,
    "تاريخ الفكر السياسي",
    "مما لا شك فيه أن التفكير يؤدي إلى انواع من الرضاء والإثارة، غير أننا لا نفكر من أجل مجرد الإحساس بمتعة الفكر ، بل من أجل فهم أعمق للحياة ، ومع أننا لا نفكر لأننا مضطرون لذلك، فإن التفكير يسفر عن اكتشافات مثيرة أحيانا، كما ان أغلب الأفكار السياسية ، إن لم تكن كلها ، تقوم على أساس مفهوم معين للطبيعة البشرية. وليس صحيحا انه من الممكن تعلم التفكير ، إذ أن العملية برمتها تعتمد على الجهد الذاتي للمرء، علاوة على ان الفكر عمل شخصي إلى أبعد حد ، كما أنه يتطلب التصرف بأسلوب عقلاني جاد وضبط النفس.",
    "جان توشار",
    "3.5",
    "356",
    "العربية",
    "250",
    "كاتب غير معروف سوى اسمه",
    "https://drive.google.com/file/d/1nR8V0nDa_kyQ95WnQV_MdFX9SdP6wYdm/view?usp=share_link",
    "none"
)
val pol3 = FieldModel(
    R.drawable.policy3,
    "ثروة الأمم",
    "يلقى الكتيب الضوء على بعض ما قدمه الفيلسوف الاقتصادي آدم سميث في كتابة الشهير \"ثروة الأمم\" آدم سميث هو أبو الاقتصاد الحديث ومؤسس الرأسمالية الليبرالية الحديثة وهو أول من تحدث عن حماية الحكومة لرؤوس الأموال والأسواق دون التحكم فيها ، نشر كتابه \"ثروة الأمم\" لأول مرة عام 1776م أحدث بعدها تغييرا هاما في تاريخ الاقتصاد السياسي.",
    "آدم سميث",
    "4.1",
    "356",
    "العربية",
    "350",
    "آدم سميث(5 يونيو 1723- 17 يوليو 1790) فيلسوف أخلاقي أسكتلندي ومن رواد الاقتصاد السياسي. اشتهر بكتابيه الكلاسيكيين: نظرية الشعور الأخلاقي (1759)[1]، والتحقيق في طبيعة وأسباب ثروة الأمم (1776)، والذي عرف فيما بعد بثروة الأمم، وهو رائعة آدم سميث، وأول عمل يتناول الاقتصاد الحديث. يعتبر سميث هو أب الاقتصاد الحديث، كما لايزال يعتبر من أكثر المفكرين الاقتصاديين تأثيراً في اقتصاديات اليوم. وفي عام 2009 كان اسم سميث من بين أسماء \"أعظم الأسكتلنديين\" على مدى كل العصور، وذلك في تصويت تم على قناة تلفيزيونية اسكتلندية. درس سميث الفلسفة الاجتماعية في جامعة غلاسكو وفي كلية باليول في جامعة أكسفورد، وبعد تخرجه ألقى سلسلة ناجحة من المحاضرات العامة في جامعة أدنبرة. ثم حصل على الأستاذية بغلاسكو في تدريس الفلسفة الأخلاقية، وخلال هذا الوقت كتب ونشر نظرية العواطف الأخلاقية. عمل سميث في حياته لاحقا كمدرس خصوصي، مما سمح له بالسفر في أنحاء أوروبا، حيث التقى ببعض كبار المفكرين في عصره. ثم عاد سميث بعد ذلك إلى بلاده، وقضى نحو عشر سنوات في العمل على كتابه ثروة الأمم، والذي نشر بعد ذلك في عام 1776. ثم مات سميث بعد ذلك في عام 1790 عن عمر يناهز 67 عاما.",
    "https://drive.google.com/file/d/1Cu5lvcM_pZmODNJW3rxda_tSHhQhtdcL/view?usp=share_link",
    "none"
)
val pol4 = FieldModel(
    R.drawable.policy4,
    " 1984 جورج أورويل",
    "لا تتصور أنك ستنقذ نفسك مهما كان استسلامك لنا مطلقاً، فما من امرئ انحرف مرة عن جادة الصواب ثمّ أبقينا على حياته، وحتى لو اخترنا أن نتركك تعيش إلى أنْ ينقضي أجلك فتموت ميتة طبيعية، فلن يمكنك أبداً أنْ تُفلت من قبضتنا وماحدث لك هنا سيعيش معك إلى أبد الدهر، فعليك أنْ تعي ذلك سلفاً، إننا سنسحقك إلى درجة لايمكنك بعدها أن تعود بحياتك إلى سيرتها الأولى، وستحدث لك أشياء لن يمكنك أن تبرأ من آثارها حتى لوعشت ألف عام، وأبداً لن تقدر ثانية على الشعور بما يشعر به الأحياء، إنّ كل شيء سيموت بداخلك ولن تعود قادراً على الحب أو الصداقة أو الاستمتااع بالحياة أو الضحك أو حب الاستطلاع أو الشجاعة أو الاستقامة، ستكون أجوف لأننا سنعصرك حتى تصبح خواء من كل شيء ثمّ نملؤك بذواتنا.",
    "ريك آرثر بلير",
    "4.9",
    "356",
    "العربية",
    "90",
    "ريك آرثر بلير الاسم الحقيقي لجورج أورويل، وهو الاسم المستعار له والذي اشتهر به هو صحافي وروائي بريطاني. عمله كان يشتهر بالوضوح والذكاء وخفة الدم والتحذير من غياب العدالة الاجتماعية ومعارضة الحكم الشمولي وإيمانه بالاشتراكية الديمقراطية. يعتبر القرن العشرين أفضل القرون التي أرّخت الثقافة الإنجليزية، كتب أورويل في النقد الأدبي والشعر الخيالي والصحافة الجدلية. أكثر شيء عرف به هو عمله الديستوبي رواية 1984 التي كتبها في عام 1949 وروايته المجازية مزرعة الحيوان عام 1945 والتين تم بيع نسخهم معا أكثر من أي كتاب آخر لأي من كتاب القرن الواحد والعشرون.كتابه تحية لكتالونيا في عام (1938) كان ضمن رصيد خبراته في الحرب الأهلية الإسبانية، والمشهود به على نطاق واسع على أنه مقاله الضخم في السياسية والأدب واللغة والثقافة. في عام 2008 وضعته صحيفة التايمز في المرتبة الثانية في قائمة \"أعظم 50 كاتب بريطاني منذ عام 1945\" استمرت تأثير أعمال أوريل على الثقافة السياسية السائدة ومصطلح أورويلية الذي يصف ممارسات الحكم الاستبدادي والشمولي والتي دخلت في الثقافة الشعبية مثل ألفاظ عديدة أخرى من ابتكاره مثل الأخ الأكبر، التفكير المزدوج، الحرب الباردة وجريمة الفكر وشرطة الفكر",
    "https://drive.google.com/file/d/1dWMwenmZpltCgyNjenAGgQW84I9UKTV8/view?usp=share_link",
    "none"
)
val pol5 = FieldModel(
    R.drawable.policy5,
    "طبائع الأستبداد ومصارع الأستعباد",
    "هذا بحث كتبه عبد الرحمن الكواكبي في موضوع الاستبداد مستعرضاً طبائعه وما ينطوي عليه من سلبيات تؤدي إلى خوف المستبد وإلى الاستيلاء الجبن على رغبته إلى جانب انعكاسات الاستبداد على جميع مناحي الحياة الإنسانية بما فيه الدين والعلم والمجد والمال والأخلاق والترقي والتربية والعمران ومن خلال التساؤلات يشرح من هم أعوان المستبد وهل يمكن أن يتحمل الإنسان ذلك الاستبداد وبالتالي كيف يكون الخلاص منه وها هو البديل عنه",
    " عبد الرحمن الكواكبي",
    "3.9",
    "356",
    "العربية",
    "140",
    "عاش عبد الرحمن الكواكبي خلال النصف الثاني من القرن التاسع عشر، وهي فترة عانت الأمم العربية فيها الكثير من الضعف والهوان، فهمَّ المستعمِر بها يغتصب أراضيها، ويستنزف مواردها، وقد شخص عبد الرحمن الكواكبي في كتابه «طبائع الاستبداد ومصارع الاستعباد» سبب هذا الداء الذي رآه يتمثل في الاستبداد السياسي، بأنواعه الكثيرة، ومنها استبداد الجهل على العلم، و استبداد النفس على العقل، فهو يقول: إن الله خلق الإنسان حرّا، قائده العقل، فكفر وأبى إلا أن يكون عبدًا قائده الجهل، و يرى إن المستبد فرد عاجز، لا حول له ولا قوة إلا بأعوانه أعداء العدل وأنصار الجور، وأن تراكم الثروات المفرطة، مولِّدٌ للاستبداد، ومضرٌ بأخلاق الأفراد، وأن الاستبداد أصل لكل فساد، فيجد أن الشورى الدستورية هي دواؤه.",
    "https://drive.google.com/file/d/1H947ykUIEeHx043OOHAjUTlh8pEGkPnd/view?usp=share_link",
    "none"
)
val pol6 = FieldModel(
    R.drawable.policy6,
    "ويبقى التاريخ مفتوحًا",
    "المهمة التي ارتآها هذا الكتاب صعبة وشاقة: أشخاص كثيرون عبروا التاريخ، وتركوا بصمات واضحة فيه، وغيَّروا كثيراً من أحداثه، فهل كانوا من يسيِّر دفة هذا التاريخ، أم أن هناك قوىً خفيةً تسيِّرهم جنباً إلى جنب مجتمعاتهم، أم أن الظروف هي التي أوجدتهم، وبرغم ذلك عرفوا كيف يتحكمون بمسارها. يسعى تركي الحمد بدايةً إلى إيجاد صيغة توافقية بين هذه الرؤى، وهو يسخر من نظرية \"نهاية التاريخ\"، معتبراً أنها مسألة نسبية، كما لا يأخذ بـ\"صراع الحضارات\"، مفضلاً أن يعتمد طريقاً ثالثاً بينهما. يسلّط هذا الكتاب الضوء على أحداث قرن مضى، كما يركز على مدى تأثيير وجود شخصية البطل في تغيير مجرى الأحداث. واختار لهذه الوظيفة \"غير العادية\" عشرين شخصية لعبت دوراً بارزاً في مسار أحداث بلدانها... والعالم. الشخصيات التي اختارها الحمد لا تنتمي إلى عالم واحد ولا إلى أيديولوجيا واحدة. غاندي، لينين، روزفلت، تشرشل، ستالين، ماو تسي تونغ، هتلر، تاتشر، ريغن، غورباتشوف، محمد علي جناح، لوثر كينغ، عبد العزيز آل سعود، عبد الناصر، تيتو، نهرو، هرتزل، بن غوريون، الخميني ومانديلا: أسماء تناولها هذا الكتاب في \"نظرته الوداعية\" لأحداث قرن مضى، وهي شخصيات كان التاريخ، بلا ريب، سيبدو مختلفاً كثيراً لو لم تكن موجودة.",
    "تركي حمد تركي",
    "3.2",
    "356",
    "العربية",
    "230",
    "تركي حمد تركي الحمد العقيلي ،والمولود في 10 مارس 1952 في مزار الكرك بالأردن لأسرة سعودية من جماعة العقيلات، هو كاتب وَ روائي وأستاذ أكاديمي سابقا .\n" +
            "تعتبر ثلاثية تركي الحمد أطياف الأزقة المهجورة'*'، والتي تتكون من ثلاث روايات، صدرت أولها عام 1995، أشهر ما كتبه الحمد. وقد أثارت هذه الثلاثية كثيرا من الجدل، نتيجة لتعرضها إلى موضوعات حساسة في المجتمع السعودي، لكن، وإن كانت تلك الثلاثة أولى أعمال الكاتب الروائية، فإن هذا العمل قد سبقته عدة كتب. ففي العام 1986 صدر للكاتب كتاب الحركات الثورية المقارنة، تلا ذلك كتاب دراسات أيديولوجية في الحالة العربية (1992)، وكتاب الثقافة العربية أمام تحديات التغيير (1993)، ثم كتاب عن الإنسان أتحدث (1995). وبعد الثلاثية، أصدر الكاتب كتاب الثقافة العربية في عصر العولمة، ثم عاد إلى الكتابة الروائية، مصدرا روايتين هما شرق الوادي ثم جروح الذاكرة.",
    "https://drive.google.com/file/d/1JuGnAvFF1MbE9uv8DkXWOKPzwRK08VpN/view?usp=share_link",
    "none"
)
val pol7 = FieldModel(
    R.drawable.policy7,
    "فقه الثورة ",
    "يتحدث فيه الكاتب عن الثورة وما بعد الثورة, وعمّا يجب أن يتحلّى به الثوّار من وعي ثوري يوصلهم للذي يريدونه من ثورتهم.",
    "يوسف زيدان",
    "4.6",
    "356",
    "العربية",
    "260",
    "مصري متخصص في التراث العربي المخطوط وعلومه. له عديد من المؤلفات والأبحاث العلمية في الفكر الإسلامي والتصوف وتاريخ الطب العربي. وله إسهام أدبي يتمثل في أعمال روائية منشورة، كما أن له مقالات دورية وغير دورية في عدد من الصحف المصرية والعربية. عمل مستشاراً لعدد من المنظمات مثل مكتبة الإسكندرية. ولد يوسف زيدان يوم 30 يونيو 1958 في مدينة سوهاج بصعيد مصر وانتقل إلى الإسكندرية مع جده وهو طفل صغير ودرس في مدارسها. ثم التحق بقسم الفلسفة في كلية الآداب في جامعة الإسكندرية وحصل على الليسانس عام 1980.و تم تعيينه قي جامعة الإسكندرية. حصل يوسف زيدان على ليسانس الفلسفة من كلية الآداب جامعة الإسكندرية عام 1980. ثم حصل على درجة الماجستير في الفلسفة الإسلامية برسالته عن \"الفكر الصوفى عند عبد الكريم الجيلي، دراسة وتحقيق لقصيدة النادرات العينية للجيلي مع شرح النابلسي\". ثم حصل على درجة الدكتوراه في الفلسفة الإسلامية برسالته عن \"الطريقة القادرية فكرًا ومنهجًا وسلوكًا، دراسة وتحقيق لديوان عبد القادر الجيلانى\" وذلك عام 1989 وقد حصل على درجة الأستاذية في الفلسفة وتاريخ العلوم عام 1999.",
    "https://drive.google.com/file/d/16U1H1A1vM8qj9q64zqg0ftf1ebkvXnI0/view?usp=share_link",
    "none"
)
val pol8 = FieldModel(
    R.drawable.policy8,
    "هل نستحق الديمقراطية",
    "هذه هي المجموعة الثانية من مقالات الكاتب علاء الأسواني، والتي نشرها على صفحات جرائد مصرية متنوعة حتى عام 2009. وفيها يبثنا الأسواني شجون الوطن ويشاركنا همومًا وشواغل تدور حول الإنسان المصري الذي يمر بواحدة من مراحله التاريخية الحرجة. يطرح علاء الأسواني على النقاش العام أسئلة عن قيمة الإنسان المصري الذي فقد كثيرًا من مكتسباته اقتصاديًّا وسياسيًّا واجتماعيًّا وثقافيًّا. سنقرأ في هذا الكتاب مقالات مثل: ظاهرة التدين البديل، في المسألة القبطية، هل نستحق الديمقراطية؟ تأملات في المهزلة، لماذا يكره الغربيون الإسلام، هل تصلح الديمقراطية لحكم المسلمين؟ كم يساوي الإنسان المصري؟ هواية إذلال المصريين.. وغيرها الكثير",
    " علاء الأسوانى",
    "4.5",
    "356",
    "العربية",
    "180",
    "ولد علاء الأسوانى في 26 مايو 1957، كانت أمه زينب من عائلة أرستوقراطية حيث كان عمها وزيراً للتعليم قبل ثورة يوليو. والده عباس الأسواني، جاء من أسوان إلى القاهرة عام 1950، حيث كان كاتباً، روائياً ومحامياً، وكان يكتب مقالات في روز اليوسف تحت عنوان أسوانيات، وحصل عام 1972 على جائزة الدولة التقديرية للرواية والأدب.\n" +
            "أتم دراسته الثانوية في \"مدرسة الليسيه الفرنسية\" في مصر. حصل على البكالوريوس من كلية طب الفم والأسنان جامعة القاهرة عام 1980 وحصل على شهادة الماجستير في طب الأسنان من جامعة إلينوي في شيكاغو بالولايات المتحدة الأمريكية. ما زال يباشر عمله في عيادته بحي جاردن سيتي، كما تعلم الأسواني الأدب الإسباني في مدريد. يتحدث الأسواني أربع لغات: العربية، الإنجليزية، الفرنسية والإسبانية.\n" +
            "علاء الأسواني هو أول مصري يحصل على جائزة برونو كرايسكي التي فاز بها المناضل الإفريقي نيلسون مانديلا وتلاه الناشط الفلسطيني الراحل فيصل الحسيني. و هو أيضاً أول مصري وعربي يحصل على جائزه الإنجاز من جامعة أمريكية (جامعه الينوي) لعام 2010 وهي أرفع جائزة تمنحها الجامعة لخريجيها، وهي تمنح لخريج الجامعة الذي يحقق إنجازا استثنائيا فريدا على المستوى الوطني أو العالمي. من ضمن ستمائة ألف خريج أتموا دراستهم في جامعة إلينوي لم يفز بالجائزة إلا عدد قليل من الخريجين وهو الفائز رقم 43 في تاريخ الجامعة.",
    "https://drive.google.com/file/d/1BYzu7DAQRIjxst-BfOFDPy2j6nghOjnT/view?usp=share_link",
    "none"
)
val pol9 = FieldModel(
    R.drawable.policy9,
    "أكتوبر 73 السلاح والسياسة",
    "يتناول الكاتب الكبير \"محمد حسنين هيكل\" فى كتابه \"أكتوبر 73\" اللحظات الحرجة سياسياً وعسكرياً من لحظة وفاة عبدالناصر وتولى السادات المهام الجسيمة للتحضير لمعركة الحسم ، ويتناول الكواليس السياسية الخفية لإحلال السلام بدون اللجوء للحرب. إن تدفق المعلومات ، أى المعرفة بالحقائق تضيف إلى حرية الرأى بعداً ثالثاً يجسم الصورة ، وهو أن يكون المتابع للحوار ، قارئاً أو سامعاً ، على علم بما يجرى من حوله من الحوار بحيث يكون بدوره قادراً على المشاركة ، موجوداً فى الساحة... نحن ننسى أحياناً أن أى وطن لابد له أن يتحاور مع نفسه - بل يتفاوض مع نفسهه - قبل أن يتحاور مع العالم ، أو يتفاوض معه!.",
    "محمد حسنين هيكل",
    "4.2",
    "356",
    "العربية",
    "210",
    "محمد حسنين هيكل (23 سبتمبر -17 فبراير 2016)، أبرز الصحفيين العرب والمصريين في القرن العشرين . وربما يكون من الصحفيين العرب القلائل الذين شهدوا وشاركوا في صياغة السياسة العربية، خصوصا في مصر. 1923 : ولد يوم الأحد 23 سبتمبر.\n" +
            "1942 : بداية اشتغال الأستاذ هيكل في الصحافة.\n" +
            "1951 : صدر له أول كتاب : إيران فوق بركان، بعد رحلة إلى إيران استغرقت شهرا كاملا.\n" +
            "1952 : استطاع ملازمة جمال عبد الناصر والحياة بالقرب منه ومتابعته على المسرح ووراء كواليسه بغير انقطاع، وسنوات حوار لم يتوقف معه في كل مكان وفي كل شيء.",
    "https://drive.google.com/file/d/17DMpdjbTXhTPGE5YwUjGHuiSfTJmTulq/view?usp=share_link",
    "none"
)
val pol10 = FieldModel(
    R.drawable.policy10,
    "كنت شيوعيًا",
    "مثلما حظي الشاعر بدر شاكر السياب بالشهرة والاهتمام، فقد تعرضت أعماله وآثاره للإهمال والتشويه، فأعماله الشعرية يعاد نشرها بطبعات مختلفة لكنها جميعها غير نقدية ومليئة بالأخطاء ولا يوجد متحف يحوي آثاره. يضم هذا الكتاب لأول مرة بين دفتيه اعترافات السياب التي نشرها عام 1959 في جريدة (الحرية) البغدادية، جاءت اعترافاته في (29) حلقة حملت عنواناً واحداً (كنت شيوعياً) ثم تلتها (11) حلقة تحمل كل واحدة عنواناً خاصاً بها.",
    "بدر شاكر السياب",
    "4.7",
    "256",
    "العربية",
    "390",
    "اتسم شعره في الفترة الأولى بالرومانسية وبدا تأثره بجيل علي محمود طه من خلال تشكيل القصيد العمودي وتنويع القافية ومنذ 1947 انساق وراء السياسة وبدا ذلك واضحا في ديوانه أعاصير الذي حافظ فيه السياب على الشكل العمودي وبدأ فيه اهتمامه بقضايا الانسانية وقد تواصل هذا النفس مع مزجه يثقافته الإنجليزية متأثرا بإليوت في أزهار وأساطير وظهرت محاولاته الأولى في الشعر الحر وقد ذهبت فئة من النقاد إلى أن قصيدته \"هل كان حبا\" هي أول نص في الشكل الجديد للشعر العربي ومازال الجدل قائما حتى الآن في خصوص الريادة بينه وبين نازك الملائكة.وفي أول الخمسينات كرس السياب كل شعره لهذا النمط الجديد واتخذ المطولات الشعرية وسيلة للكتابة فكانت \"الأسلحة والأطفال\" و\"المومس العمياء\" و\"حفار القبور\" وفيها تلتقي القضايا الاجتماعية بالشعر الذاتي. مع بداية الستينات نشر السياب ديوانه \"أنشودة المطر\" الذي انتزع به الاعتراف نهائيا للشعر الحر من القراء وصار هو الشكل الأكثر ملائمة لشعراء الأجيال الصاعدة وأخذ السيات موقع الريادة بفضل تدفقه الشعري وتمكنه من جميع الأغراض وكذلك للنفس الأسطوري الذي أدخله على الشعر العربي بإيقاظ أساطير بابل واليونان القديمة كما صنع رموزا خاصة بشعره مثل المطر، تموز، عشتار، جيكور قريته التي خلدها. وتخللت سنوات الشهرة صراعات السياب مع المرض ولكن لم تنقص مردوديته الشعرية وبدأت ملامح جديدة تظهر في شعره وتغيرت رموزه من تموز والمطر في \"أنشودة المطر\" إلى السراب والمراثي في مجموعته \"المعبد الغريق\" ولاحقا توغل السياب في ذكرياته الخاصة وصار شعره ملتصقا بسيرته الذاتية في \"منزل الأقنان\" و\"شناشيل ابنة الجلبي\" . سافر السياب في هذه الفترة الأخيرة من حياته كثيرا للتداوي وكذلك لحضور بعض المؤتمرات الأدبية وكتب في رحلاته هذه بوفرة ربما لاحساسه الدفين باقتراب النهاية. توفي عام 1964م بالمستشفى الأميري في الكويت، عن 38 عام ونقل جثمانه إلى البصرة و دفن في مقبرة الحسن البصري في الزبير.",
    "https://drive.google.com/file/d/1hsh3S2TY2iReuQ3gUlxLzEu2QBDgcwD_/view?usp=share_link",
    "none"
)

//////////////////////////////////////Philosophy////////////////////////////////////////////////////////
val phi1 = FieldModel(
    R.drawable.philosophy1,
    "فلسفة العلم",
    "كتاب فلسفة العلم تأليف فيليب فرانك يعتبر الكتاب نقطة وصل بين دراسات العلوم المختلفة ودراسات الإنسانيات. فقد تناول الكاتب مسحا لتاريخ العلم منذ أرسطو وحتى آينشتاين بهدق توضيح مدى مكانة الفلسفة من العملية العلمية كما يوضح مدى صلة النظريات الفلسفية والفزيائية قبل حداثة العصر التكنولوجيا التى أبعدت كلاهما عن الآخر. يهدف الكتاب إلى محاولة استعادة الفكر القديم فى الفلسفة حيث يحث على أن يهتم رجل العلم في عالم اليوم بأفكار العلوم أكثر من أن يكتفي بمجرد الحقائق.",
    "فيليب فرانك",
    "3.4",
    "356",
    "العربية",
    "175",
    "المؤلف كتاب فلسفة العلم والمؤلف لـ 2 كتب أخرى.\n" +
            "فيليب فرانك (بالألمانية: Philipp Frank ) (و. 1884 – 1966 م) هو رياضياتي، وفيلسوف، وفيزيائي، وتربوي ، وأستاذ جامعي من النمسا، وألمانيا، ولد في فيينا، كان عضوًا في الأكاديمية الأمريكية للفنون والعلوم، توفي في كامبريدج، ماساتشوستس، عن عمر يناهز 82 عاماً.\n",
    "https://drive.google.com/file/d/1eOOYIvl8f0WJc6wvQy83CNMs_k4t0mpo/view?usp=share_link",
    "https://www.youtube.com/watch?v=ECRX018LEBo"
)
val phi2 = FieldModel(
    R.drawable.philosophy2,
    "نفي اللاهوت",
    "لقد بدأ القرن الواحد والعشرون بصراع لا يعرف الرحمة، ويوجد على الجبهة الأولى \"الغرب اليهودي - المسيحي الليبرالي - بالمفهوم الإقتصادي للمصطلح، صاحب التجارة المتوحشة والإستهلاك الذي لا يعرف الخجل، والمنتج لبضائع مزيفة، والذي لا يعرف فضيلة، ذلك العالم العدمي حتى الامعاء الذي لا يعرف ديناً ولا قانوناً، القوي على الضعفاء والضعيف أمام الأقوياء، المحتال المتسم بالمكر والنفاق مع الكل، والمفتتن بالمال والربح والعابد الساجد للذهب، ضامن كل سلطان ومولد كل أشكال الهيمنة - على الأرواح والأجساد.",
    "ميشيل أونفري",
    "3.1",
    "356",
    "العربية",
    "155",
    "يعتبر ميشال أونفراي امتدادًا لفلاسفة ما بعد الحداثة في فرنسا وقد أسهم بصفة جديّة في الفلسفة الفرنسيّة المعاصرة، وهو معروف بغزارة مؤلّفاته التي تُعدُّ بالعشرات. لم يبدأ الكتابة إلا أواخر الثمانينيات، لتتوالى الإصدارت بمعدل كتاب في العام على الأقلّ، فاستحقّ لقب أكثر الفلاسفة غزارةً وظهوراً في الإعلام. كان يحلم بأن يكون سائق قطار فإذا به من أبرز مفكري الجيل الجديد في فرنسا ومن وجوه «اليسار المعادي لليبرالية». بنى خطابه على فلسفة المتعة، وأعاد قراءة المعلّمين الكبار. يرى أونفراي أنّ الفلسفة فنّ للوجود وأنّ غايتها الوصول إلى السّعادة القصوى عبر المتع الحسيّة والفكريّة.",
    "https://drive.google.com/file/d/1GhEmpl_fP_WqPOfnGWaEzzEsT3eBCNRI/view?usp=share_link",
    "none"
)
val phi3 = FieldModel(
    R.drawable.philosophy3,
    "أقدم لك أفلاطون ",
    "هذا الكتاب في سلسلة “اقدم لك” يستهدف تعريف القارئ غير المتخصص بمعنى الفلسفة. لكنه جاء في الواقع. عرضا لتاريخ الفلسفة الغربية باسرها منذ نشأتها في بلاد اليونان، في القرن السادس قبل الميلاد، عندما طرح فلاسفة مالطية ما يسميه المؤلفان “بالسؤال الكبير”: من اين جاء هذا العالم..؟",
    "ديف روبنسون",
    "4.5",
    "356",
    "العربية",
    "220",
    "ديف روبنسون\n" +
            "أقدم لك: روسو\n" +
            "أقدم لك: ديكارت\n" +
            "أقدم لك: أفلاطون",
    "https://drive.google.com/file/d/1VdXNibeUBtEPMV5mWqFzNgm4f_jTN7Vd/view?usp=share_link",
    "https://www.youtube.com/watch?v=KNfsKUzZJik"
)
val phi4 = FieldModel(
    R.drawable.philosophy4,
    "مبادىء أولية في الفلسفة",
    "كتاب مبادىء أولية في الفلسفة تأليف جورج بوليتزر، كثير ما يسأل البعض عن سبب دراسة الفلسفة؟ وكيف نستطيع دراسة الفلسفة بطريقة مبسطة؟ الفلسفة من العلوم التى تعرف بالتعقيد حيث لا يتمكن  الجميع من فهمها ببساطة..تلك الأسئلة التي تشغل ذهن المبتدئين في دراسة الفلسفة وطالما أعاقت الكثيرين عن التعرف علي أفكار قد تغير مسار حياتهم تماماً يجيبنا جورج بوليتزر المفكر الفلسفى والباحث المجرى الكبير يجيب عن تلك الأسئلة عبر كتاب صغير الحجم يجمع بين طياته البساطة في عرض المعلومات مع تأسيس رؤية نقدية مفكرة تشرح في طريقها من أجل فهم وتفسير العالم",
    "جورج بوليتزر",
    "3.0",
    "356",
    "العربية",
    "190",
    "المؤلف كتاب مبادىء أولية في الفلسفة والمؤلف لـ 3 كتب أخرى.\n" +
            "جورج بوليتزر (بالفرنسية: Georges Politzer ) (3 مايو 1903 - 23 مايو 1942) ولد جورج بوليتزر في نافيفارور ( هنغاريا ) عام 1903. وغادرها إلى باريس عام 1921 على اثر استيلاء الرجعية على السلطة التي كانت تلاحق والده. درس في السوربون ثم علم في ليسية دومولون وانتقل بعد نيله لقب استاذ الي ليسيه شربورغ واخيراً إلى ليسيه سان موز. اسس مع هنري لوفيفر واخرون مجلات نشر فيها دراسات في علم النفس والتحليل النفسي ونقداً للبرغسونية. كما اسس مركز التوثيق التابع للحزب الشيوعي الفرنسي واشرف عليه، واصبح محرراً في صحيفة الأومانيته وهي الصحيفة المركزية للحزب. وكذالك كان أحد مؤسسي (الجامعة العمالية) في باريس 1935 - 1936 وقد درس فيها طيلة فترة عملها وقبل اقفالها بأمر السلطات المتعاونة مع الهتلرية.",
    "https://drive.google.com/file/d/1YjbcLnxnByUz5Wnsg98PX0Kd9rmc4Z3s/view?usp=share_link",
    "https://www.youtube.com/watch?v=h_7qhn2yrqs"
)
val phi5 = FieldModel(
    R.drawable.philosophy5,
    "حكمة الغرب",
    "كتاب حكمة الغرب عرض تاريخي للفلسفة الغربية في إطارها الاجتماعي والسياسي للكاتب والمفكر بيرتراند راسل والمترجم الدكتور فؤاد زكريا. صدر الكتاب في جزئين عن سلسلة عالم المعرفة، الجزء الأول \\ الجزء الثاني.\n" +
            "يتحدث عن تاريخ الفلسفة الغربية منذ سقراط وحتى القرن العشرين ويمثل مضمونه نقطة الجذب الأولى في الاختيار. يوصف الكاتب بانه شيخ الفلاسفة في وقته",
    "برتراند راسل",
    "4.6",
    "356",
    "العربية",
    "85",
    "كان راسل ناشطاً بارزاً في مناهضة الحرب وأحد أنصار التجارة الحرة ومناهضة الإمبريالية. سجن بسبب نشاطه الداعي للسلام خلال الحرب العالمية الأولى، وخسر جراء ذلك منصبه كأستاذ في جامعة كامبردج. قام بحملات ضد أدولف هتلر وانتقد الشمولية الستالينية وهاجم تورط الولايات المتحدة في حرب فيتنام، حيث عمل على تشكيل المحكمة دولية (رسل-سارتر) مع الفيلسوف الفرنسي جان بول سارتر، لمحاكمة الولايات المتحدة على جرائمها في فيتنام، كما كان من أنصار نزع الأسلحة النووية، فوقع مع ألبرت أينشتاين بيانًا ضدها عرضه للسجن في عام 1961.[25]",
    "https://drive.google.com/file/d/1WpXqd5RFa3CelJXYhmoNBmDZvOKQjCvu/view?usp=share_link",
    "https://www.youtube.com/watch?v=LDsrrTphc5o&list=PLqJjcAwk7Ek2okOwsZNn6KZUfaM8OSEGN"
)
val phi6 = FieldModel(
    R.drawable.philosophy6,
    "أجمل قصة في تاريخ الفلسفة ",
    "أجمل قصّة في تاريخ الفلسفة يكتبها الفيلسوف الفرنسي \"لوك فيري\" بالتعاون مع كلود كبلياي، ولكن قبل أن يقص تاريخها - وهو تاريخ الإكتشاف الباهر من قبل الإنسانية لإمكاناتها وللمعنى الذي يمكن أن تضيفه على حياتنا.\n" +
            "\n" +
            "يطرح المؤلف العديد من الأسئلة بإنتظار الإجابة عليها: ما الفلسفة؟ ماذا تنتظر منها؟ وأي \"خدمة\" تقدمها؟ ألا تزال في حاجة إليها؟ وإن كان الجواب للإيجاب، فبماذا يمكن أن تساعدنا في عصر تبدو فيه المنزلة الإنسانية خاضعة للإنتشار المتواصل للإبتكارات التكنولوجية والإستراتيجيات الإقتصادية أو ما يسميه \"هيدجر\" بــ \"عالم الثقافة\"، وكلها مهيأة للإكثار من الوسائل دونما الإهتمام بالغايات.",
    "لوك فيري",
    "4.3",
    "356",
    "العربية",
    "120",
    "لمؤلف كتاب أجمل قصة في تاريخ الفلسفة ـ لوك فيري والمؤلف لـ 8 كتب أخرى.\n" +
            "لوك فيري فيلسوف فرنسي ولد سنة 1952. شغل منصب وزير التربية والتعليم في فرنسا في عهد رئيس الوزراء جون بيير رافاران ما بين 2002 و2004. هو واحد من الفلاسفة الجدد، الذين أحدثوا تحولا عميقا في الأوساط الفلسفية السائدة، برموزها المعروفة أمثال جاك دريدا وجاك لاكان وجيل دولوز وميشال فوكو...، لاعتقادهم أنّ الفلسفة ضلت الطريق بتوغلها في مباحث فكرية ومعرفية عويصة ومعقدة لا يفهمها إلا خاصّة الخاصّة. لقي هذا التيار الجديد نجاحا غير مسبوق لانتهاجه خطابا مبسَطا في تحليل القضايا الراهنة التي تشغل إنسان هذا العصر",
    "https://drive.google.com/file/d/1RzJrDSKUx20VroyChZMByb8E2JMZrAHr/view?usp=share_link",
    "https://www.youtube.com/watch?v=ROOcrpykKeU"
)
val phi7 = FieldModel(
    R.drawable.philosophy7,
    "الوجودية",
    "الوجودية هي المدرسة الفلسفية التي تتخذ من الإنسان موضوعا لها، ليس فقط من خلال التفكير وإنما من خلال الفعل والشعورأي أنها ترتبط بالإنسان كفرد حي. ترتبط الوجودية بصورة أساسية ببعض الفلاسفة الأوروبيين من القرنين التاسع عشر والعشرين، الذين تشاركوا في الاعتقاد ببداية هذا التفكير الفلسفي، رغم اختلافهم في العديد من الآراء الأساسية.",
    "جان-بول شارل ايمارد سارتر ",
    "4.2",
    "356",
    "العربية",
    "300",
    "(21 يونيو 1905 باريس - 15 أبريل 1980 باريس) هو فيلسوف وروائي وكاتب مسرحي كاتب سيناريو وناقد أدبي وناشط سياسي فرنسي. بدأ حياته العملية استاذاً. درس الفلسفة في ألمانيا خلال الحرب العالمية الثانية. حين احتلت ألمانيا النازية فرنسا، انخرط سارتر في صفوف المقاومة الفرنسية السرية",
    "https://drive.google.com/file/d/1go7KeBND7sBLAw310odstT31EsuQ3GqP/view?usp=share_link",
    "https://www.youtube.com/watch?v=9sF8ZHOq0Fc"
)

val phi8 = FieldModel(
    R.drawable.philosophy8,
    "عالم صوفي",
    "تعود صوفيا ذات يوم من مدرستها لتجد في صندوق البريد سؤالين يقولان: من أنت؟ ومن أين جاء العالم؟\n" +
            "تلك هي بداية المغامرة التي ستخوضها صوفيا في عالم الفلسفة مع أستاذ غامض لا يريد أن يفصح عن هويته. ولن يكون غموض هذا الأستاذ إلا لغزاً من ألغاز أخرى كثيرة ستقتحم عالم صوفيا. فلماذا تتلقى صوفيا باستمرار بطاقات بريدية موجهة إلى بنت أخرى اسمها هيلد؟ ومن هي هيلد هذه؟ بل ومن هي صوفيا ذاتها؟ تحاول صوفيا حل تلك الألغاز مستعينة بمعرفتها الوليدة بالفلسفة. لكن الحقيقة التي ستنتهي إلى اكتشافها أغرب من كل ما كان بوسعها تخيله.",
    "جوستاين غاردر",
    "4.8",
    "356",
    "العربية",
    "165",
    "جوستاين غاردر (بالنرويجية البوكمول: Jostein Gaarder ) هو كاتب نرويجي ولد في الثامن من شهر أغسطس سنة 1952، ويعمل أستاذاً في الفلسفة وتاريخ الفكر وهو يمارس الأدب والتعليم معاً. اشتهر بكتابته للأطفال بمنظور القصة داخل القصة.",
    "https://drive.google.com/file/d/1BgTIv4urbSbBsByTppB-S187-7Nx7jb3/view?usp=share_link",
    "none"
)
val phi9 = FieldModel(
    R.drawable.philosophy9,
    "نزهة فلسفية في غاية الأدب",
    "العلاقة بين الفلسفة والأدب علاقة وثقى تشهدها في التضمينات الفلسفية في الكثير من المنتجات الأدبية لبعض أعاظم الكُتّاب، ونعرف أنّ بعض الكتّاب كانوا أنفسهم فلاسفة محترفين، والأمثلة في ذلك كثيرة؛ غير أن طبيعة العلاقة وحدودها بين الأدب والفلسفة ظلّت حقلاً إشكالياً منذ العصر الإغريقي وحتى يومنا هذا",
    "إيريس مردوخ",
    "3.7",
    "356",
    "العربية",
    "120",
    "تعتبر الكاتبة \"إيريس مردوخ\" من أهم الكتاب البريطانيين في القرن العشرين.\n" +
            "وهي من الكتاب الذين اتصفوا بغزارة الإنتاج، إذ أصدرت ست وعشرين رواية وأربعة كتب عن الفلسفة وخمس مسرحيات وديوان قصائد ومجموعة من المقالات القيمة، وذلك قبل إصابتها بمرض الزهايمر في منتصف التسعينات. كما حازت على العديد من الجوائز الأدبية، أهمها جائزة بوكر وهي عن روايتها «البحر .. لبحر» وذلك في عام 1978",
    "https://drive.google.com/file/d/1MsaEJF8vFlDEYNz0lLpi7vroy7ktIKBW/view?usp=share_link",
    "none"
)
val phi10 = FieldModel(
    R.drawable.philosophy10,
    "حي بن يقظان ",
    "ذكر سلفنا الصالح — رضي الله عنهم — أن جزيرة من جزائر الهند التي تحت خط الاستواء، وهي الجزيرة التي يتولَّد بها الإنسان من غري أم ولا أب وبها شجر يثمر نساء، وهي التي ذكر املسعودي أنها جزيرة الوقواق؛ لأن تلك الجزيرة أعدل بقاع الأرض هواءً، وأتممها لشروق النور الأعلى عليها استعدادا، وإن كان ذلك خلاف ما يراه جمهور الفلاسفة وكبار الأطباء؛ فإنهم يرون أن أعدل ما في املعمورة الإقليم الرابع. فإن كانوا قالوا ذلك لأنه صح عندهم أنه ليس على خط الاستواء عمارة ملانع من املوانع الأرضية، فلقولهم إن الإقليم الرابع أعدل بقاع الأرض وجه، وإن كانوا إنما أرادوا بذلك أن ما على خط الاستواء شديد الحرارة، كالذي يصرح به أكثرهم فهو خطأ يقوم البرهان على خلافه.",
    "يوسف محمد أحمد زيدان",
    "4.8",
    "356",
    "العربية",
    "85",
    "يوسف محمد أحمد زيدان أستاذ جامعي كاتب وفيلسوف مصري، ومتخصص في التراث العربي المخطوط وعلومه، له عدة مؤلفات وأبحاث علمية في الفكر الإسلامي والتصوف وتاريخ الطب العربي، وله إسهام أدبي في أعمال روائية منشورة، وله مقالات دورية وغير دورية في عدد من الصحف العربية. عمل مديراً لمركز المخطوطات بالإسكندرية في مكتبة الإسكندرية.",
    "https://drive.google.com/file/d/1WShm9jkSXDOnhW87uyQr1K5EPISxnA1q/view?usp=share_link",
    "https://www.youtube.com/watch?v=Bs3SiJ882Os"
)

//////////////////////////////////////Crime////////////////////////////////////////////////////////
val cri1 = FieldModel(
    R.drawable.cr1,
    "الرمز المفقود",
    "العاصمة واشنطن: تتمّ دعوة أستاذ علم الرموز في جامعة هارفرد، «روبرت لانغدون»، في اللحظة الأخيرة لإلقاء محاضرة مسائيّة في مبنى الكابيتول. ولكن، وبعد لحظات من وصوله، يتمّ اكتشاف شيء مثير للاضطراب في وسط قاعة «الروتوندا»، شيءٌ تمّ تشفيره على نحو مروّع بخمسة رموز غامضة. عرف «لانغدون» أنّها دعوة قديمة تقود مستلمها إلى حكمة باطنية سريّة ضائعة. وحين يتعرّض مُرشد «لانغدون» الموقّر، «بيتر سولومون»، المحسن والماسوني البارز، إلى الخطف، يدرك «لانغدون» أنّ أمله الوحيد في إنقاذ حياة صديقه هو قبول تلك الدعوة الغامضة، أيًا يكن المكان الذي تقود إليه. سرعان ما تجرف الأحداث «لانغدون» خلف واجهةِ أهمّ مدينة تاريخية في أميركا، عبر الحجرات والهياكل والأنفاق السريّة الموجودة فيها. وكلّ ما هو مألوف يتحوّل إلى عالم غامض وسرّي لماضٍ مخبّأ ببراعة، بدا فيه أنّ الأسرار الماسونية والاكتشافات غير المسبوقة تقوده إلى حقيقة واحدة لا تصدّق.",
    "دان براون",
    "4.5",
    "356",
    "العربية",
    "75",
    "دان براون (Dan Brown) (مواليد 22 يونيو 1964 في ايكسيتير، نيوهامشير، الولايات المتحدة الأمريكية). مؤلف أمريكي لقصص الخيال والإثارة الممزوجة بطابع علمي وفلسفي حديث بأسلوب مشوق مكّنه من تحقيق أفضل المبيعات. حققت رواياته رواجاً كبيراً بين الأجيال الشابة في أمريكا وأوروبا، أشهر رواياته رواية شيفرة دا فينشي The Da Vinci Code التي نشرت عام 2003، وتم تصويرها كفيلم سينمائي من بطولة توم هانكس.",
    "https://drive.google.com/file/d/1XUaYrJPnuATZW0CwJwZ1ljrvOSh42ueV/view?usp=share_link",
    "https://www.youtube.com/watch?v=yyBc8w1EFl8"
)
val cri2 = FieldModel(
    R.drawable.cr3,
    "جثة في الفندق",
    "قبل بضعة أيام من الميلاد، يتم العثور على غودلاو غور، وهو حارس فندق في ريكافيك يؤدي أحياناً دور سانتا، متنكراً في زي بابا نويل؛ مطعوناً حتى الموت في غرفته الصغيرة البائسة في الفندق الذي يعمل فيه، وفي وضع شائن، وسرعان ما يتبين أن لدى الموظفين والنزلاء شيئاً يخفونه، ولكن أكثر الأسرار غموضاً دفن مع الضحية... وبينما يحاول التحري إرليندور العثور على إجابات، ويفتش عن دلائل يكتشف أن المظهر الهادئ للفندق يخفي وراءه الكثير من الغموض",
    "ارنالدور اندريداسون",
    "4.6",
    "356",
    "العربية",
    "90",
    "ارنالدور اندريداسون , ولد عام 1961 في مدينة ريكيافيك , وهو ابن الكاتب أندريو أندريداسون, تخرج من جامعة آيسلندا عام 1996 حيث حاز على درجة في التاريخ. وعمل صحفياً في صحيفة مورجونيو بعد ذلك. وأخيراً عمل ككاتب حر قبل أن يصبح ناقد أفلام في ذات الصحيفة التي عمل فيها صحفياً. كتبه نشرت في أكثر من 26 دولة وترجمت إلى أكثر من 20 لغة",
    "https://drive.google.com/file/d/1LkuRweRBpWhsJx5uf4dffYNyf8fMfigv/view?usp=share_link",
    "https://www.youtube.com/watch?v=OmktrQhGl3E"
)
val cri3 = FieldModel(
    R.drawable.cr2,
    "أبجدية القتلى",
    "فتدور أحداثها حول قاتل مجنون يسلك طريقه للوصول إلى ضحاياه بناءً على الترتيب الأبجدى للحروف الإنجليزية ، ففى البداية بدأ بحرف (A) فقتل السيدة آشر فى مدينة آندوفر ، ثم تلاها بحرف (B) فشنق بيتى برنارد على شاطئ بيكسهيل ، أما بالنسبة لحرف (C) فقد كان ضحيته السيد كارمايكل كلارك من تشرستون ، ولكى يضع توقيعه الشخصى على كل جريمة كان يترك بجانب الجثة دليل سكة حديد مفتوحاً على اسم المكان الذى وقعت فيه الجريمة .. فإلى أأى مدى سيصل فى جرائمه فى الحروف الأبجدية؟ كان يبدو أنه لن يتمكن أحد من القبض عليه ، ولكنه ارتكب خطأ ، وهو الخطأ الذى يرتكبه كل المجرمين ، عندما تحدى بدافع غروره الخالص قدرة السيد \"بوارو\" على إحباط خططه.",
    "أجاثا كريستي",
    "4.7",
    "356",
    "العربية",
    "120",
    "تُعتبر أجاثا كريستي أعظم مؤلفة في التاريخ من حيث انتشار كتبها وعدد ما بيع منها من نسخ، وهي -بلا جدال- أشهر مَن كتب قصص الجريمة في القرن العشرين وفي سائر العصور. وقد تُرجمت رواياتها إلى معظم اللغات الحية، وقارب ما طُبع منها بليونَيْ (ألفَيْ مليون) نسخة!\n" +
            "وُلدت أجاثا كريستي في بلدة توركي بجنوب إنكلترا عام 1890 وتوفيت عام 1976 وعمرها نحو خمسة و ثمانين عاماً.\n" +
            "لم تذهب أجاثا قطّ إلى المدرسة، بل تلقّت تعليمها في البيت على يد أمها التي دفعتها إلى الكتابة وشجعتها عليها في وقت مبكر من حياتها.",
    "https://drive.google.com/file/d/1L38SSWVVppF2ABES_fL9r3Cc7mNpc-K0/view?usp=share_link",
    "https://www.youtube.com/watch?v=KYyts7fKpcM&list=PLe-Jtr2GbGmGSF5PFEdhbaO3iR0WhS3Ft"
)

val cri4 = FieldModel(
    R.drawable.cr4,
    "واختفى كل شيء",
    "عشرة غرباء وقعوا في شرك الذهاب الى احد القصور الواقعه في جزيره على ساحل ديفون وبينما كانو يتناولون وجبة العشاء وجه صوت مجهول اتهاماً لكل منهم باخفاء سر يدينهم وفي نهاية الليلة كان احدهم قد وفته المنيه . .تسعه. .لم يظهر لهم الشخص الذي استضافهم وبينما كان الطقس متقلباً ومتغيراً فقد اصبح المكان مخئفاً ومهجوراً . .ثمانيه. .من خلال تكرار ترديدهم لانشودة الاطفال ادركوا جميعا ان القانل لييس فقط احدهم ولكنه ايضاً يستعد لتكرار جريمته. ",
    "أجاثا كريستي",
    "4.6",
    "356",
    "العربية",
    "110",
    "تُعتبر أجاثا كريستي أعظم مؤلفة في التاريخ من حيث انتشار كتبها وعدد ما بيع منها من نسخ، وهي -بلا جدال- أشهر مَن كتب قصص الجريمة في القرن العشرين وفي سائر العصور. وقد تُرجمت رواياتها إلى معظم اللغات الحية، وقارب ما طُبع منها بليونَيْ (ألفَيْ مليون) نسخة!\n" +
            "وُلدت أجاثا كريستي في بلدة توركي بجنوب إنكلترا عام 1890 وتوفيت عام 1976 وعمرها نحو خمسة و ثمانين عاماً.\n" +
            "لم تذهب أجاثا قطّ إلى المدرسة، بل تلقّت تعليمها في البيت على يد أمها التي دفعتها إلى الكتابة وشجعتها عليها في وقت مبكر من حياتها.",
    "https://drive.google.com/file/d/1MRgJS-fCbeRlh0RxyChz01Nf5G5HqYBo/view?usp=share_link",
    "https://www.youtube.com/watch?v=qMD6kqLcRGQ"
)
val cri5 = FieldModel(
    R.drawable.cr5,
    "اللوح الأزرق",
    "لم تصدّق مانويلا عينيها. كمشت أصابعها على رسالة المفتش العامّ وحولتها إلى كرة ضغطت عليها بقبضتها. هكذا إذن وعلى العكس من توقعاتها يأمرونها بمواصلة المهمة. لم تقنعهم المعلومات التي مدّتهم بها بضرورة التوقف عن مطاردة الرجال بل يبدو أن هذه المعلومات أدّت إلى نتائج عكسية. وها هي الرسالة تؤكد لها أن توركيمادا إزداد إصراراً على الذهاب في الاتجاه نفسه. دونا فيغيرو. انتفضت وهي تتذكر الرجل ذا وجه العقاب الذي نسيته تماماً أثناء استغراقها في قراءة الرسالة. دونما فيغيرو",
    "جيلبرت سينويه",
    "4.4",
    "356",
    "العربية",
    "50",
    "أديب وروائي فرنسي ولد بالقاهرة سنة 1947. غادر سينويه القاهرة عندما كان في عمر التاسعة عشر إلى فرنسا لدراسة الموسيقى في معهد الدراسات الموسيقية في باريس. وأصبح عازف جيتار ماهر ولاحقاً بدأ بتعليم الجيتار وابتدأ بالكتابة. في عام 1987 وفي عمر الأربعين أصدر روايته الأولى \" المخطوط القرمزي. وقد نالت جائزة jean de' heures كأفضل رواية تاريخية. وفي عام 1989 اصدر رواية\" ابن سينا والطريق إلى أصفهان.",
    "https://drive.google.com/file/d/1jLiXGbxkmNaoW3ik47DLVD3PGVw5q4fm/view?usp=share_link",
    "https://www.youtube.com/watch?v=9ZKi90gREyI"
)
val cri6 = FieldModel(
    R.drawable.cr6,
    "الجريمة والعقاب ",
    "موضوع الجريمة وقضية الخير والشر التي ترتبط بالجريمة، فهو يصور ما يعتمل في نفس المجرم وهو يقدم على جريمته، ويصور مشاعره وردود أفعاله، كما يرصد المحرك الأول والأساس للجريمة حيث يصور شخصاً متمرداً على الأخلاق. يحاول الخروج عليها بكل ما أوتي من قوة، إذ تدفعه قوة غريبة إلى المغامرة حتى ابعد الحدود لقد اكتشف بطل الرواية راسكولينوف أن الإنسان المتفوق لذا شرع بارتكاب جريمته ليبرهن تفوقه، لكن العقاب الذي تلقاه هذا الرجل كان قاسياً إذ اتهم بالجنون وانفصل عن بقية البشر وقام بينه وبين من يعرف حاجز رهيب دفعه إلى التفكير بالانتحار.\n" +
            "تتطرق الرواية لمشكلة حيوية معاصرة ألا وهي الجريمة وعلاقتها بالمشاكل الاجتماعية والأخلاقية للواقع، وهي المشكلة التي اجتذبت اهتمام دستويفسكي في الفترة التي قضاها هو نفسه في أحد المعتقلات حيث اعتقل بتهمة سياسية، وعاش بين المسجونين وتعرف على حياتهم وظروفهم.",
    "دوستويفسكي",
    "4.9",
    "356",
    "العربية",
    "90",
    "فيودور ميخايلوفيتش دوستويفسكي هو روائي وصحفي وفيلسوف روسي. وهو واحد من أشهر الكُتاب والمؤلفين حول العالم. رواياته تحوي فهماً عميقاً للنفس البشرية كما تقدم تحليلاً ثاقباً للحالة السياسية والاجتماعية والروحية لروسيا في القرن التاسع عشر، وتتعامل مع مجموعة متنوعة من المواضيع الفلسفية والدينية.",
    "https://drive.google.com/file/d/1bv85bhspSf_pYer4XgLtElw101e7BoYP/view?usp=share_link",
    "https://www.youtube.com/watch?v=vexiSy_-948"
)
val cri7 = FieldModel(
    R.drawable.cr7,
    "جريمة قتل في صف انتظار",
    "في إحدى الأمسيات وقف رجلٌ يُدعى «ألبرت سوريل» في صفٍّ طويلٍ أمام أحد مسارح لندن؛ من أجل حجزِ تذكرةٍ لمشاهَدة عرض مسرحي حقَّق نجاحًا باهرًا. كان التزاحُم شديدًا، وفجأةً سقط الرجل وسطَ الصف، فظنَّ المحيطون به أنه في حالةِ إغماء، لكنَّ أحدهم لاحَظ أنه كان مطعونًا بخنجر؛ وعلى الفور فتحَت شرطةُ سكوتلانديارد تحقيقًا لمعرفة مُلابَسات مقتل الرجل والدوافع وراء قتله، لا سيما أنه لم يَلحظ أحدٌ من المحيطين به تسلُّلَ القاتل ليرتكبَ جريمته. تولَّى المفتش «جرانت» حلَّ هذا اللغز، متتبِّعًا خيوطَ الجريمة، خيطًا وراء الآخَر؛ من أجل التوصُّل إلى الجاني. تُرى مَن هو؟ ولماذا أقدمَ على ارتكاب تلك الجريمة؟ هذا ما ستعرفه من خلال قراءة هذه الرواية المثيرة.",
    "جوزفين تاي",
    "4.3",
    "356",
    "العربية",
    "65",
    "جوزفين تاي: أحد اسمين أدبيين استخدمتهما الكاتبة الاسكتلندية الشهيرة «إليزابيث ماكنتوش» في كتابة رواياتها ومسرحياتها. وُلِدَت في الخامس والعشرين من يوليو عام ١٨٩٦، وتُوفِّيت في الثالث عشر من فبراير عام ١٩٥٢. كان شغف ماكنتوش الأكبر هو كتابة مسرحية تنال قبولًا في الأوساط الأدبية والجماهيرية. كتبت مسرحيتها الأولى «ريتشارد بوردو» في عام ١٩٣٢، باسمها الأدبي الآخر، «جوردون دافيوت»، وحقَّقت المسرحية نجاحًا ساحقًا على مسارح «ويست إند» في لندن. بعد ذلك توالت أعمالها الأدبية، ما بين مسرحيات وروايات تاريخية وبوليسية. وكان آخر ما نُشِر لها في حياتها من أعمال رواية «ابنة الزمن»، التي اختارتها «رابطة كُتَّاب الجريمة» البريطانية، في عام ١٩٩٠، أعظم رواية جريمة على مرِّ العصور.",
    "https://drive.google.com/file/d/1TUgPC0bvjYfFcjOxFPr2D_11QN4l0ekt/view?usp=share_link",
    "none"
)
val cri8 = FieldModel(
    R.drawable.cr8,
    "أختي قاتلة متسلسة",
    "“أيولا” فتاة جذابة وقع في غرامها كل الرجال . كلما ارتبطت بأحدهم ، ينتهي به الأمر بأن تطعنه بسكين وتتصل بأختها الممرضة “كوريدي” كي تنقذها وتساعدها في التخلص من الجثة وإخفاء آثار الجريمة. ولأن “كوريدي” تعاني وسواسًا قهريًا، يظهر ذلك في دقتها في تنظيفمسرح جرائم أختها وإخفاء بقع الدم والبصمات وكل شيء.\n" +
            "“کوريدي” معجبة بزميلها الوسيم الدكتور “تيد”، وتسعى دائمًا لتلفت انتباهه لها بكل الطرق، لكنها تفاجأ بأختها ذات يوم في المستشفىتنصب شباكها للإيقاع بـ “تيد” الذي سرعان ما وقع في غرامها . من ثم، تعیش “کوريدي” صراعا داخليًا بين إخفاء حقيقة أختها التيلطالما كانت تحميها وتخاف عليها وبين الغيرة القاتلة التي لربما تدفعها للإبلاغ عنها.",
    "أويينكان بريثويت",
    "3.9",
    "356",
    "العربية",
    "85",
    "تجاوزت الكاتبة سكونية السرد، فصنعت فجوات متعمدة في غير موضع من النسيج، ليملأها القارئ الذي يجد نفسه مشاركاً في فعل السرد، لا سيما حين لفت إحدى حوادث القتل بالغموض، وتضارب الروايات. ",
    "https://drive.google.com/file/d/1lBiQ1gWauqpho1iTlPGUUonPMzMQYVqv/view?usp=share_link",
    "https://www.youtube.com/watch?v=8NMNXSosjY0"
)
val cri9 = FieldModel(
    R.drawable.cr9,
    "جريمة في القرية",
    "جميع سكان هذه القرية على استعداد لتناول وجبة الطعام وقوفاً أمام النوافذ حتى يتأكدوا أن شيئاً من الأحداث لم يفتهم، فهم في حشرية دائمة وهم متشوقون لحدوث أمر مثير، عملية سطو... أو جريمة قتل مثلاً. والسيدة بروثيو من وجهة نظر كاهن القرية هي امرأة شديدة اليأس، لا تصغي لأي وازع إلا إذا أثيرت عواطفها وهي الآن على علاقة غرامية حميمة بالرسام لورنس ريدنغ الذي أحبته بجنون وحدة ويأس، فيما هي امرأة متزوجة بالكولونيل بروثيو الرجل الغني البخيل والعجوز، الذي لم يحظى بحياته بشعبية قطّ. فالجميع يتمنون له الموت حتى ابنته وكاهن القرية.... ولسوء الحظ أنه قد وجد مقتولاً في مكتب الكاهن الذي لطالما عبّر عن مشاعره الحاقدة على هذا الكولونيل. ولكن هل يمكن له وهو رجل الدين أن يرتكب معصية ويساهم أو ينفذ عملية قتل؟ ومن هو القاتل الحقيقي لهذه الجريمة النكراء؟ وما هو الدور الذي ستلعبه الآنسة ماربل في هذه القضية وهي العجوز العانس التي تهوى حلّ الألغاز ومراقبة الناس وتحليل نفسيتهم؟",
    "أجاثا كريستي",
    "4.8",
    "356",
    "العربية",
    "150",
    "تُعتبر أجاثا كريستي أعظم مؤلفة في التاريخ من حيث انتشار كتبها وعدد ما بيع منها من نسخ، وهي -بلا جدال- أشهر مَن كتب قصص الجريمة في القرن العشرين وفي سائر العصور. وقد تُرجمت رواياتها إلى معظم اللغات الحية، وقارب ما طُبع منها بليونَيْ (ألفَيْ مليون) نسخة!\n" +
            "وُلدت أجاثا كريستي في بلدة توركي بجنوب إنكلترا عام 1890 وتوفيت عام 1976 وعمرها نحو خمسة و ثمانين عاماً.\n" +
            "لم تذهب أجاثا قطّ إلى المدرسة، بل تلقّت تعليمها في البيت على يد أمها التي دفعتها إلى الكتابة وشجعتها عليها في وقت مبكر من حياتها.",
    "https://drive.google.com/file/d/1RIxCwxihUZluRjK1V-AKJVl8Mfh0PKk3/view?usp=share_link",
    "https://www.youtube.com/watch?v=ATq7jEb1WNc"
)
val cri10 = FieldModel(
    R.drawable.cr10,
    "جريمة في قطار الشرق السريع",
    "بطلها السيد هيركيول بوارو المحقق البلجيكي الشهير الذي نقابله مرة أخرى بعد رواية مقتل اللورد إدجر حيث عمل على حل القضية بحنكته. وهنا هل سيعود مجدداً ليحل لغز جريمة قتل المواطن الأمريكي \" صامويل راتشيت \" وهل سيستطيع معرفة ماضي القتيل؟ وما هي علاقة المسافرين الذين ينتمون إلى جنسيات وطبقات اجتماعية مختلفة بالقتيل؟ هذا ما سنعرفه عند قراءتنا لهذه الرواية ",
    "أجاثا كريستي",
    "4.5",
    "356",
    "العربية",
    "170",
    "تُعتبر أجاثا كريستي أعظم مؤلفة في التاريخ من حيث انتشار كتبها وعدد ما بيع منها من نسخ، وهي -بلا جدال- أشهر مَن كتب قصص الجريمة في القرن العشرين وفي سائر العصور. وقد تُرجمت رواياتها إلى معظم اللغات الحية، وقارب ما طُبع منها بليونَيْ (ألفَيْ مليون) نسخة!\n" +
            "وُلدت أجاثا كريستي في بلدة توركي بجنوب إنكلترا عام 1890 وتوفيت عام 1976 وعمرها نحو خمسة و ثمانين عاماً.\n" +
            "لم تذهب أجاثا قطّ إلى المدرسة، بل تلقّت تعليمها في البيت على يد أمها التي دفعتها إلى الكتابة وشجعتها عليها في وقت مبكر من حياتها.",
    "https://drive.google.com/file/d/1aDkFrP7Ks1wGXtxklJoLn3GgkOAonK3H/view?usp=share_link",
    "https://www.youtube.com/watch?v=NxDcwCLS8j4"
)

/////////////////////////////////////Religion/////////////////////////////////////////////////////////
val r1 = FieldModel(
    R.drawable.book1,
    "الرحيق المختوم",
    "هُوَ كِتاب يَتَكَلّم عَنِ السّيرَةِ النّبَوِيّة الشّريفة ( سِيرَةِ الرّسول مُحمّد صلى الله عليهِ وسلّم)، وهو مِن تأليفِ الشّيخ صَفِي الرّحمن المباركفوري، وَقَد قَدّمه الشّيخ فِي مُؤتَمَر عُقِدَ فِي الباكِستان عام 1396 هـ، وَحازَ على المَرتِبَةِ الأولى مِن بَينِ 170 بحثاً.",
    " الكاتب صَفِي الرّحمن المباركفوري",
    "4.8",
    "556",
    "العربية",
    "210",
    "هُوَ عالِم مِن أحَد عُلماءِ الحَدِيث فِي الهند، وَقَد تَمَيّز بِعلمِهِ الغَزير، وبالتّواضُع، وَقَد عاشَ ما بَين 4 يونيو 1943م حتّى 1 ديسمبر 2006م، وَقَد شاركَ فِي الكَثيرِ مِن النّدواتِ فِي مُختَلَف دول العالَم؛ كالهند، والولايات المتحدة، والمملكة العربيّة السعوديّة، وَقَد عَمِلَ فِي الجامعة الإسلاميّة في المدينة المنورة لُمدّة 10 سنوات، وألّف العَديدِ مِنَ الكُتُب بالّلغَتينِ العَربيّة والأردية، وأشهَر الكُتُب الّتِي ألّفها هِيَ ",
    "https://drive.google.com/file/d/1dX33NOIIlv-jIwMzq8HP--WoDbEOn6i9/view?usp=drivesdk",
    "https://youtu.be/kAjTyugG_gM"

)
val r2 = FieldModel(
    R.drawable.b,
    "مرويات الوثائق المكتوبة",
    "حيث اشتمل هذا البحث على ثلاث وسبعين وأربعمائة رواية,سبع وعشرون منها في خاتمه صلى الله عليه وسلم الذي كان يختم به كتبه، وسبع عشرة في العهد المكي، وثلاث وثلاثون في المجتمع المدني، ومائة وأربع عشرة في أمرائه وعماله على الصدقات، وتسع عشرة تتعلق بمتفرقات في المجتمع الإسلامي، وست وثمانون في إقطاعاته وإقراره صلى الله عليه وسلم وتأمينه لبعض القبائل والأشخاص، وسبعون في دولة فارس ومناطق نفوذها، واثنتان وستون في دولة الروم ومناطق نفوذها، وتسع وأربعون في القبائل العربية اللقح، وست عشرة في اليهود والنصارى.",
    "محمد بن عبد الله غبان الصبحي",
    "4.9",
    "396",
    "العربية",
    "190",
    "عضو هيئة التدريس بالجامعة الإسلامية، تخرج في كلية الدعوة وأصول الدين بالجامعة الإسلامية، عام 1405هـ، ثم حصل على الماجستير عام 1411هـ؛ برسالة عنوانها: «فتنة مقتل عثمان بن عفان رضي الله عنه»، ثم الدكتوراه عام 1418هـ؛ برسالة عنوانها: «مرويات الوثائق المكتوبة من النبي - صلى الله عليه وسلم وإليه«",
    "https://drive.google.com/file/d/1e0MwkTz-d-wnkwtBJkiqmmvbKLfjZZb8/view?usp=drivesdk",
    "none"
)
val r3 = FieldModel(
    R.drawable.c,
    "المبعث والمغازي",
    "يذكر المغازي التي غزاها رسول الله ويذكر تفاصيل جغرافية عن موقع الغزو.",
    "أبو القاسم الأصبهاني",
    "4.5",
    "306",
    "العربية",
    "100",
    "ولد بأصفهان في رجب 343هـ / نوفمبر 954م - توفي 502 هـ / 1108 م) هو الحسين بن محمد بن المفضل، أبو القاسم الأصفهاني (أو الأصبهاني) المعروف بالراغب، أديب وعالم، وأحد علماء مسلمين في القرن الحادي عشر في التفسير السائد للقرآن باللغة العربية. أصله من أصفهان، وعاش ببغداد ولا يُعرف الكثير عن حياته.",
    "https://drive.google.com/file/d/1dz5E7_FHH0s7Yre_Gd80DcdlnXdE0sYA/view?usp=drivesdk",
    "none"
)
val r4 = FieldModel(
    R.drawable.d,
    "المدخل إلي كتاب الشفا",
    "تاريخ مفصل عن الكتاب وعناية الأمة المحمدية به ضمن نطاق علوم التاريخ وغيرها.",
    "محمد عبد الحي بن عبد الكبير الكتاني",
    "4.2",
    "311",
    "العربية",
    "270",
    "محدِّث ومسنِد ومؤرِّخ مغربي وأخ وتلميذ الفقيه والشاعر أبو الفيض الكتاني\n" +
            "وسافر للحجِّ المرة الأولى سنة 1323 هـ وانقطع للتدريس في القرويين، وسعَى في تطويره، ودرَّس في الأزهر ، ودرَّس الحديث في الحرمين كما درَّس في الأقْصَى وفي الجامع الأُموي. بعد أن حصلت النكبة لفَرْع أسرته الكتانية، حيث اختلف المولى عبد الحفيظ مع أخيه الأكبر أبو الفيض الكتاني، أسفرتْ عن سجْنه ومقتل أخيه. بعد تولِّي السلطان يوسف للعرش سنة 1330 هـ عادتِ المياه لمجاريها، فأعيدت الزوايا الكتانية، ومكتبة عبد الحي التي صودرت منه، فرحل للجزائر وتونس سنة 1339 هـ، وانتُخب عضوًا في مجمع اللغة العربية بدمشق. وحجَّ المرة الثانية والأخيرة سنة 1351 هـ، وسافَر إلى أوروبا، وزار شكيب أرسلان، كما زار روما، ودرَّس في السوربون.\n",
    "https://drive.google.com/file/d/1dZ3g0dDzbck2lqW3y30D4A7UXBCNTJLR/view?usp=drivesdk",
    "none"
)
val r5 = FieldModel(
    R.drawable.e,
    "الشمائل المحمدية",
    "حيث ذكر الترمذي صفات النبي الخلقية والخُلقية وبين الشمائل التي تحلى بها.",
    " أبو عيسى محمد الترمذي",
    "4.8",
    "326",
    "العربية",
    "110",
    "\n" +
            "أبو عيسى التِّرْمذِي (209 هـ - 279 هـ) / (824م - 892م). هو محمد بن عيسى بن سَوْرة بن موسى بن الضحاك، السلمي الترمذي، أبو عيسى. مصنّف كتاب الجامع المعروف بسنن الترمذي، حافظ للحديث، ولد في مدينة ترمذ، ثم ارتحل لطلب الحديث فذهب إلى خراسان، والعراق، والحجاز، ولم يرحل إلى مصر والشام، وحدّث عن جمع كبير من المحدثين، وتفقه في الحديث بالبخاري،وأصبح ضريرًا في كِبره بعد رحلته وكتابته العلم، وتوفي في 13 رجب 279 هـ في بلدة ترمذ\n.",
    "https://drive.google.com/file/d/1eGzEbogX_h6949gVU8QPKw60bBTuD9el/view?usp=drivesdk",
    "https://youtu.be/lfmWf-dLY5I"
)
val r6 = FieldModel(
    R.drawable.f,
    "دلائل النبوة",
    "جمع المؤلف هذا الكتاب في معجزات النبي ودلائل نبوته  وبيان أصله و مولده الخ.",
    " أبي بكر أحمد بن الحسين البيهقي",
    "4.7",
    "356",
    "العربية",
    "170",
    "\n" +
            "أحمد بن الحسين بن علي بن موسى الخراساني البيهقي المشهور بـالبيهقي، ولد في بيهق (384 - 458 هـ).الإمام المحدث المتقن صاحب التصانيف الجليلة والآثار المنيرة تتلمذ على جهابذة عصره وعلماء وقته وشهد له العلماء بالتقدم وبعد حياة حافلة بالعلم والتعليم والتنصيف أصاب البيهقيَّ المرضُ في رحلته العلمية الأخيرة إلى نيسابور، فتُوفِّي عام: 458هـ، وله من العمر أربع وسبعون سنة، رحمه الله رحمة واسعة\n.",
    "https://drive.google.com/file/d/1dfc-hQ-oHXe-kKNJgxMpbaWHC4GKsTIT/view?usp=drivesdk",
    "https://youtu.be/ji1BKBL_7ZM"
)
val r7 = FieldModel(
    R.drawable.g,
    "ألفية السيرة النبوية",
    "منظومة شعرية ف السيرة النبوية ألفها المحدث الحافظ عبد الرحيم العراقي ف أواخر حياته.",
    "عبد الرحيم العراقي",
    "4.4",
    "356",
    "العربية",
    "170",
    "\n" +
            "الحافظ زين الدين أبو الفضل عبد الرحيم العراقي الشافعي شيخ الحديث، (1325م/725 هـ (مصر) - 1403م/806 هـ) ومن أعماله ألفية السيرة النبوية وألفية العراقي والتقييد والإيضاح لما أطلق وأغلق من مقدمة ابن الصلاح وطرح التثريب في شرح التقريب \n",
    "https://drive.google.com/file/d/1e1-0timY5Qu3mJgALTY5LCYvMKCAV6PI/view?usp=drivesdk",
    "https://youtu.be/z9t065Vx9Eg"
)
val r8 = FieldModel(
    R.drawable.h,
    "الدٌرر ف اختصار المغازي والسير",
    "يتناول فيه سيرة النبي محمد من ولادته حتى وفاته، وأيضًا يتناول أخباره وحروبه.",
    "أبو عمر يوسف بن عبد الله النمري",
    "4.5",
    "356",
    "العربية",
    "170",
    "\n" +
            "أبو عمر يوسف بن عبد الله النمري المعروف بابن عبد البر (368 هـ - 463 هـ) إمام وفقيه مالكي ومحدث ومؤرخ أندلسي، له العديد من التصانيف والكتب من أشهرها الاستيعاب في معرفة الأصحاب ، وهو في تراجم أصحاب النبي محمد صلى الله عليه وسلم ومن أعماله البارزة الاستيعاب في معرفة الأصحاب ،والاستذكار الجامع لمذاهب فقهاء الأمصار وعلماء الأقطار،والتمهيد لما في الموطأ من المعاني والأسانيد ، وجامع بيان العلم وفضله ، والكافي في فقه أهل المدينة ، و وتجريد التمهيد في الموطأ من المعاني والأسانيد\n.",
    "https://drive.google.com/file/d/1deJQKDqUUz3rQPL_IwFjIoLmdXgqwdCP/view?usp=drivesdk",
    "https://youtu.be/Rto0dwdy1Tw"
)
val r9 = FieldModel(
    R.drawable.i,
    "زاد المعاد",
    "سيرة الرسول في غزواته وحياته وبيّن هديه في معيشته وعباداته ومعاملته لأصحابه.",
    "ابن قيم الجوزية",
    "4.6",
    "316",
    "العربية",
    "170",
    "أَبُو عَبْدِ الله شَمْسُ الدَِينِ مُحَمَّدٌ بْنُ أَبِي بَكرٍ بْنُ أَيُّوبَ بْنُ سَعْدٍ بْنُ حُرَيْزٍ الزُّرْعِيُّ الدِّمَشْقِيُّ الحَنْبَلِيُّ (691هـ - 751هـ/1292م - 1350م) المعروف باسم «اِبْنِ قَيّمِ الجَوْزِيَّةِ» أو «اِبْنِ القَيّمِ». هُوَ فقيه ومحدّث ومفسَر وعالم مسلم مجتهد وواحد من أبرز أئمّة المذهب الحنبلي في النصف الأول من القرن الثامن الهجري. نشأ ابن القيم حنبليّ المذهب؛ فقد كان والده «أبو بكر بن أيوب الزرعي» قيّماً على «المدرسة الجوزية الحنبلية»،وعندما شبَّ واتّصل بشيخه ابن تيميّة حصل تحوّل بحياته العلمية، فأصبح لا يلتزم في آرائه وفتاويه بما جاء في المذهب الحنبلي إلا عن اقتناع وموافقة الدليل من الكتاب والسنة ثم على آراء الصحابة وآثار السلف، ولهذا يعتبره العلماء أحد المجتهدين\n",
    "https://drive.google.com/file/d/1eZ9f0il8uRBzsiSFinlGm0BabHTy7m2J/view?usp=drivesdk",
    "https://youtu.be/iJMg5xf8UzY"
)
val r10 = FieldModel(
    R.drawable.j,
    "الرصف لما روي عن النبي",
    "يدخل من الفعل والوصف ويليه شرح الغريب في نطاق تخصص السيرة النبوية المطهرة.", "أجاثا كريستي",
    "4.5",
    "356",
    "العربية",
    "170",
    "تُعتبر أجاثا كريستي أعظم مؤلفة في التاريخ من حيث انتشار كتبها وعدد ما بيع منها من نسخ، وهي -بلا جدال- أشهر مَن كتب قصص الجريمة في القرن العشرين وفي سائر العصور. وقد تُرجمت رواياتها إلى معظم اللغات الحية، وقارب ما طُبع منها بليونَيْ (ألفَيْ مليون) نسخة!\n" +
            "وُلدت أجاثا كريستي في بلدة توركي بجنوب إنكلترا عام 1890 وتوفيت عام 1976 وعمرها نحو خمسة و ثمانين عاماً.\n" +
            "لم تذهب أجاثا قطّ إلى المدرسة، بل تلقّت تعليمها في البيت على يد أمها التي دفعتها إلى الكتابة وشجعتها عليها في وقت مبكر من حياتها.",
    "https://drive.google.com/file/d/1aDkFrP7Ks1wGXtxklJoLn3GgkOAonK3H/view?usp=share_link",
    "https://www.youtube.com/watch?v=NxDcwCLS8j4"
)
val r11 = FieldModel(
    R.drawable.k,
    "إمتاع الأسماع",
    "يبحث في سيرة الرسول وحياته وخصائصه ويتعرض لشمائل رسول الله وحسن عهده.",
    "علي المقري",
    "4.5",
    "356",
    "العربية",
    "170",
    "\n" +
            "علي المقري كاتب وشاعر يمني. يعمل في الصحافة الثقافية منذ 1985. صدرت له عن دار الساقي رواية «طعم أسود... رائحة سوداء» التي رشّحت ضمن القائمة الطويلة لجائزة بوكر العربية 2008-2009.\n" +
            "مؤلفاته: نافذة للجسد، مجموعة شعرية، القاهرة 1987. ترميمات، مجموعة شعرية،الطبعة الأولى: الهيئة اليمنية العامة للكتاب ( وزارة الثقافة – صنعاء. 1999، الطبعة الثانية:وزارة الثقافة، صنعاء 2004.\n",
    "https://drive.google.com/file/d/1exoMgKxdYcpUjEA724jFpIIBXeYtUWJy/view?usp=drivesdk",
    "none"
)
val r12 = FieldModel(
    R.drawable.l,
    "سيرة النبي المختار",
    "تحدّث في سيرة الرسول مُستمداً مادته العلمية من القرآن الكريم والتفاسير الموثقة.",
    " صفي الرحمن المباركفوري",
    "4.9",
    "456",
    "العربية",
    "170",
    "\n" +
            "هو صفي الرحمن بن عبد الله بن محمد أكبر بن محمد علي بن عبد المؤمن بن فقير الله المباركفوري الأعظمي. أحد علماء الحديث في الهند. تميز بعلمه الغزير وتواضعه الجم، وقد شارك في ندوات ومحاضرات في مختلف أرجاء الهند وفي الولايات المتحدة والمملكة العربية السعودية وكثير من الدول الأخرى. عمل بالجامعة الإسلامية بالمدينة المنورة لمدة عشر سنوات ابتداءً من عام 1988. عمل على تأليف العديد من الكتب القيمة باللغتين العربية والآردية وأشهرها الرحيق المختوم\n",
    "https://drive.google.com/file/d/1f9TeMZzyGntVJlTSi_ETaqPENZ_mTIvf/view?usp=drivesdk",
    "https://youtu.be/1oyZSxmIbeY"

)

//////////////////////////////////////History////////////////////////////////////////////////////////
val h1 = FieldModel(
    R.drawable.h4,
    "العالم من 1450 م حتي 1700 م",
    "هذا الكتاب يحكي قصة عالم واحد مترابط الأحداث تتبدل ملامحه مع إيقاع المستجدات وحركات التغيير والابتكارات والغزوات والانتصارات، يسردها لنا ويلز بأسلوب رائع، وثروة معرفية، وتفاصيل دقيقة تبعث نبض الحياة في أحداث تلك الفترة الزمنية. كما يعيد المؤرخ البارز جون إ. ويلز جونيور في كتابه هذا، استعراض واحدة من أكثر الفترات الزمنية صخباً واضطراباً في تاريخ العالم (بدءاً بـ1450م حتى 1700م)، وكان متأثراً حينئذ بمفاهيم العولمة الحديثة، فنرى ويلز يقتفي أسباب تلك التغيرات المتداخلة التي أسهمت في رسم عالم كولومبوس، ومارتن لوثر، والإمبراطور المغولي بابور، ولوك، ولويس الرابع عشر، والإمبراطور كانغزي، وعبر منهج متعدد المحاور نشهد الوقائع التاريخية في سرد متناغم ذي إيقاع متسلسلً.",
    " الكاتب جون ويلز",
    "3.8",
    "456",
    "العربية",
    "180",
    "مخرج ومنتج وكاتب أمريكي من مواليد 28 مايو 1956 في الإسكندرية، فيرجينيا، لعائلة تحمل أصول إنجليزية، اسكتلندية، إيرلندية، سويدية ونرويجية. تخرج ويلز من مدرسة كارنيجي ميلون للدراما عام 1979. من أعماله (The Company Men) و(ER) و(The West Wing) و(August: Osage County). فاز بـ 6 جوائز إيمي. ",
    "https://drive.google.com/file/d/1fAGabP1H01yv6W9bIF0Vkw10bjuQlHD1/view?usp=drivesdk",
    "none"

)
val h2 = FieldModel(
    R.drawable.h3,
    "ما أخفاه العلمانيون من تاريخ مصر الحديث",
    "إن هذا الكتاب هو عبارة عن بحث في تاريخ مصر في فترة القرن الثامن عشر والتاسع عشر، ومحاولة لتوضيح تطور فكر المصريين في ذلك الوقت، ومحاولة لإظهار ما طُمس من حقائق تاريخية قام المؤرخون العلمانيون بإخفائها أو تشويهها؛ حتى تتناسب مع توجهاتهم وأفكارهم، وأنَّ لها جذورًا تاريخية فتكون لهم حجة لنشرها في مصر المعاصرة. فمن خلال 6 فصول يقوم الكاتب بتوضيح تلك الأمور المخفية وحقيقتها وإعطاء أدلة على عملية التشويه والتغيير التي حدثت من هؤلاء المؤرخين، من خلال أقلام من عايشوا تلك الفترات، مع إظهار حقائق الشخصيات التاريخية التي اعتبرت علمانية - على الرغم من توجهاتها الإسلامية – كـ (رفاعة الطهطاوي ) و (أحمد عرابي ) و (مصطفى كامل )، وكذلك الأحداث التاريخية التي تم تشويهها وتغييرها لتصبح ثورات قومية ووطنية وليست حركات وطنية كثورتي القاهرة الأولى والثانية والحركة العرابية وغيرهم.ً.",
    " الكاتب معتز زاهر",
    "4.0",
    "426",
    "العربية",
    "160",
    "باحث في الشؤون الإسلامية، صدر له كتابان \"حزب النور: من المسجد إلى البرلمان\" و\"ما أخفاه العلمانيون من تاريخ مصر الحديث\" ",
    "https://drive.google.com/file/d/1fB8yeO1redC51lcYwzs-OcmCtEl2yaFc/view?usp=drivesdk",
    "https://youtu.be/aDN7i2MjPrU"

)
val h3 = FieldModel(
    R.drawable.h1,
    "محمود محمد خلف",
    "إذا كانت بعض الحواضر التي شيدها الانسان في ظروف معينة من التاريخ البشري تحيط بنشأتها وتطورها هالة من الأساطير والغموض فندينة وجدة من بين المدن التي تكتنفها أوسع هالة من الاحتمالات والتخمينات سواء من حيث اسمها أو من حيث بدايتها ونموها العمراني..",
    " الكاتب د. إسماعيلي مولاي عبد الحميد العلوي",
    "3.3",
    "416",
    "العربية",
    "150",
    "ولد بمدينة سلا يوم 11 مارس 1940. متحدثاً كان أبي محتسبا بمدينة سلا، وأمي مليكة الخطيب، حفيدة الصدر الأعظم محمد الكباص. ترعرعت بالمنزل العائلي الذي كان منزلا عائليا بالمعنى الواسع في الواقع، وعلى نحو تقليدي، حيث كنا نتواجد في منزل واسع الأرجاء نسبيا، وتقطنه ثلاث عائلات وثلاثة أجيال أيضا. فقد كانت جدتي من أبي تسكن مع عمتي، في دار متصلة بالمنزل. كما كانت عائلة عمي محمد العلوي هنالك، علاوة على عائلتنا، عائلة عبد الحميد العلوي، لكنها كانت عائلة بالمفهوم الضيق والحداثي، وبالتالي فقد كنت منذ البداية في وسط مليء بالناس، منهم الخدم وأفراد العائلة والأعمام والعمات. وكل واحد منهم ساهم في تكوين شخصيتي. وعندما وصلت إلى سن الرابعة أو الرابعة والنصف، إذ لم أعد أتذكر ذلك على وجه التحديد، في أكتوبر 1944 أو 1945، التحقت بالمدرسة الفرنسية. ",
    "https://drive.google.com/file/d/1fDawZ7H1gY8pLpPDScKf32_bpiwasaD_/view?usp=drivesdk",
    "none"

)
val h4 = FieldModel(
    R.drawable.h2,
    "تاريخ الرومانيين",
    "يتناول هذا الكتاب التاريخ الإنسانيَّ للدولةِ الرومانية، وقد أخرجه الكاتب إيمانًا منه بالدور التثقيفيِّ والتهذيبيِّ الذي تلعبه دراسة التاريخ في إثراء حياة الشعوب؛ حيث يقف القارئ من خلال تجوُّله في أروقة التاريخ على أسباب ارتقاء الأمم. وقد نجح الكاتب في استشراف الملامح التاريخيَّة للدولة الرومانيَّة، فتحدَّث عن تاريخ مدينة روما وأشهر الملوك الذين اعتلوا عرشها، كما تناول السجايا والطبائع التي وُسِموا بها، والحروب التي خاضوها، وآراء المؤرِّخين فيهم، ثمَّ تحدَّث عن الأسباب التي أدَّت إلى إلغاء الملكية وإقامة الجمهورية، وما صاحب ذلك التحوُّل من أوهامٍ وخرافاتٍ نسجتها مُخيلة أهل روما، كما تحدَّث عن العادات والتقاليد التي أُثِرَت عن الشعب الروماني، ومدى هيمنة التأثير الإغريقي على معتقداتهم الدينية، وتحدَّث كذلك عن الحروب والمعارك التي شهدتها روما، مُنهيًا وثيقته التاريخية بذِكر زوال مُلْك قرطاجة,",
    "الكاتب محمد فريد باشا",
    "4.4",
    "356",
    "العربية",
    "200",
    "هو محامٍ ومؤرخ معروف، يعد أحد كبار الزعماء الوطنيين المصريين أوائل القرن العشرين، تولى رئاسة الحزب الوطني عقب وفاة الزعيم مصطفى كامل، وأنفق ثروته في سبيل النضال الوطني والكفاح ضد الاحتلال .. ولد محمد فريد عام ١٨٦٨م لأسرة ذات أصول تركية، وتعلَّم في مدرستي الألسن والحقوق، وفور تخرجه عمل في نيابة الاستئناف، ثم احترف مهنة المحاماة. كانت له ميول فكرية وثقافية، تجسدت في كتابته للعديد من المؤلفات ككتاب «من مصر إلى مصر»، وكتاب «رحلة إلى بلاد الأندلس ومراكش والجزائر»، وكتاب «تاريخ الرومانيين» وغيرها من الكتب، إضافة إلى ذلك أنشأ فريد مع كل من أحمد حافظ عوض ومحمود أبي نصر مجلة علمية سميت ﺑ «الموسوعة» ",
    "https://drive.google.com/file/d/1fH6T1xesQaluOY3uuLnd03c6S2voXDq8/view?usp=drivesdk",
    "https://youtu.be/GFBtaYDZw4E"

)
val h5 = FieldModel(
    R.drawable.h5,
    "تاريخ مصر الى الفتح العثماني ",
    "كتاب \" تحفة الناظرين فيمن ولى مصر من الملوك والسلاطين \" رُتب هذا الكتاب على ثلاثة أبواب .الباب الأول : في خلافة الخلفاء الأربعة ومن ولى بعدهم وهو الحسن بن على ، وفى دولة بنى أمية والدولة العباسية ، ومن ولى مصر من نواب الحلفاء والدولتين المذكورتين ومن دخل فى ذلك بالتغلب من ابن طولون والإخشيدية .الباب الثانى : فى دولة الفواطم والدولة الايوبية والدولة التركية المعروفين بالمماليك البحرية ودولة الجراكسة .الباب الثالث : فى دولة آل عثمان وفيمن تصرف فى مصر من نوابهم وإيراد أخبارهم ومدة مقامهم بالديار المصرية وأحكامهم .",
    " الكاتب عمر الأسكندري",
    "2.8",
    "480",
    "العربية",
    "210",
    "عبد الله بن حجازي بن إبراهيم الشرقاوي (1150 هـ - 1227 هـ)، أحد مشايخ الأزهر الشريف في القرن الثالث عشر الهجري.\n" +
            " تعلم في الأزهر الشريف وتولى مشيخته عام 1208 هـ. كانت له مواقف شجاعة أثناء ثورة أهل بلبيس في يوليو 1795، وخلال الحملة الفرنسية على مصر. نصب كل من الشيخ عبد الله الشرقاوي والقاضي وعمر مكرم محمد علي واليا على مصر عام 1805 ميلاديا.\n",
    "https://drive.google.com/file/d/1fQMeR93nkkxTNbbj0tq6ym-mtKbxLKjl/view?usp=drivesdk",
    "none"

)
val h6 = FieldModel(
    R.drawable.h6,
    "مقدمة في تاريخ الحضارات القديمة",
    "يؤرخ \"طه باقر\" فى كتاب \"مقدمة فى تاريخ الحضارات القديمة\" لحضارة بلاد الرافدين القديمة، وقد تم تقسيم هذا الكتاب إلى جزئين نظراً لكثرة المعلومات المتوفرة عن هذه الحضارة وأهميتها، وهذا هو الجزء الأول منهما والذى يشتمل على تأريخ العراق القديم منذ أبعد عصور ما قبل التاريخ إلى نهاية العصر الساساني أي بداية الفتح العربي الإسلامي، موجزاً فيه عهود هذا التأريخ المتطاول في القدم، وخلاصة الأحداث السياسية والحضارية والسلالات والدول التي حكمت فيها وما صاحب ذلك من تغييرات إقتصادية وإجتماعية وفنية، وبإيجاز الخصائص الحضارية والثقافية لكل دوره منن أدواره التأريخية",
    " الكاتب طه باقر",
    "3.4",
    "256",
    "العربية",
    "130",
    "طه باقر (1912 - 28 فبراير/شباط 1984) كان عالمَ آثارٍ عراقيًا ومؤلفًا ومسماريًا ولغويًا ومؤرخًا وأمينًا سابقًا لمتحف العراق الوطني. يعتبر باقر من أبرز علماء الآثار في العراق. من بين الأعمال التي يتذكرها، ترجمته من الأكادية إلى العربية لملحمة جلجامش، وفك رموز الألواح الرياضية البابلية، واكتشاف قانون إشنونا، وحفرياته عن المواقع البابلية والسومرية القديمة. بما في ذلك مدينة شادوبوم السومرية القديمة في بغداد. كان باقر يتقن اللغات العراقية التاريخية الأربع (العربية والآرامية والأكدية والسومرية)، وكذلك الإنجليزية والفرنسية والألمانية. ",
    "https://drive.google.com/file/d/1fT1mtJFLigsu7ec7EuqdDkLmkHoLmtwI/view?usp=drivesdk",
    "none"

)
val h7 = FieldModel(
    R.drawable.h7,
    "حضارة العرب",
    "الكتاب عبارة عن دراسة لعملية استعمار بريطانيا لمصر، ويتناول مصر في الثلث الأخير من القرن التاسع عشر، لكنه يناقش ايضا أحداث فترات أسبق في ذلك القرن، ومن أجزاء أخرى من العالم العربي. ولا يشير إلى الاستعمار كمجرد واقع استعماري أوروبي، بل إلى تطور مناهج جديدة للسلطة السياسية، وبيين الكتاب أن هذه المناهج الاستعمارية هى جوهر كل سلطة سياسية حديثة، والكتاب تحليل لطبيعة هذا النوع الجديد من السلطة.",
    " الكاتب غوستاف لوبون",
    "4.7",
    "396",
    "العربية",
    "110",
    "هو عالم سياسي بريطاني و دارس العالم العربي. وهو أستاذ دراسات الشرق الأوسط في جامعة كلومبيا. وأستاذ سابق للعلوم السياسية في جامعة نيويورك. حصل ميتشل على الماجستير من جامعة كمبردج عام 1977 وعلى الدكتوراه من جامعة برنستون عام 1984. هو متزوج من أستاذ علم الأجناس ودراسات المرأة والنوع في جامعة كلومبيا ليلى أبو لغد.. ",
    "https://drive.google.com/file/d/1fZ6bJQdO9UNCpXgGgyGZcBZTpxP6f66W/view?usp=drivesdk",
    "https://youtu.be/YocPwfXJnfc"

)
val h8 = FieldModel(
    R.drawable.h8,
    "بلاد ما وراء النهر",
    "يعتبر كتاب بلاد ما وراء النهر من المراجع الهامة والقيمة لدى المهتمين بدراسة الشخصيات والعلماء؛ حيث يندرج كتاب بلاد ما وراء النهر ضمن نطاق كتب الشخصيات والأعلام والعلماء والفروع وثيقة الصلة ولاسيما التراجم وعلوم التاريخ والفكر الاجتماعي. حيث ينقسم الكتاب إلى قسمين رئيسين سبقهما الكاتب بتمهيد ألقى فيه الضوء على العرض الجغرافي لبلاد ما وراء النهر متحدثًا عن الأحوال السياسية لهذه البلاد قبيل الفتح الإسلامي، وكذلك الفتح الإسلامي لخراسان، وكيف أصبحت قاعدة تنطلق منها الفتوحات الإسلامية لفتح بلاد ما وراء النهر",
    " الكاتب الدكتور محمود محمد خلف",
    "3.8",
    "226",
    "العربية",
    "190",
    "\n" +
            "أديب مصري، دافع عن العربية في مواجهة التغريب. اطلع على كتب التراث وحقق العديد منها. أقام منهجه الخاص في الشعر وسماه منهج التذوق. خاض الكثير من المعارك الأدبية حول أصالة الثقافة العربية، ومصادر الشعر الجاهلي. وحصل علي جائزة الملك فيصل العالمية في اللغة العربية والأدب\n",
    "https://drive.google.com/file/d/1fZUyXAvGHSTvi7oZ3-bhPQlOG1G1WrFy/view?usp=drivesdk",
    "https://youtu.be/pB0pY7EhzQc"

)
val h9 = FieldModel(
    R.drawable.h9,
    "الرمز والأسطورة في مصر القديمة",
    "كتاب الرمز والأسطورة فى مصر القديمة تأليف رندل كلارك المفكر والباحث الكبير يقدم مرجع كبير ودراسة وافية يعرضها من خلال دراسة بحثية ويسردها عبر عدة مقالات مقسمة إلى عدد من الفصول داخل الكتاب، يتناول مناقشة ديانة من أشهر الديانات القديمة فى مصر الفرعونية. يقع الكتاب في ثمانية فصول، حاول خلالها الكاتب تقديم ترجمة موضوعية لنصوص الأساطير وربطها بالطقوس الدينية التي مارسها المصري القديم، غير متقيد بحرفية النص بل مبحرا في بحار رمزية النص؛ لذلك فهو يشير صراحة في مقدمة الكتاب إلى ذلك معللا بقوله: “إن أحد أهم ما يميز الديانة المصرية القديمة اعتمادها وبشكل أساسي على الرمزية، والتي سيطرت على جميع  طقوس وشعائر الديانة المصرية القديمة.",
    "الكاتب رندل كلارك",
    "4.2",
    "380",
    "العربية",
    "95",
    "رندل كلارك، أحد الكتاب الكلاسيكيين، الذين اغرموا بدراسة الديانة المصرية القديمة، محاولا فك طلاسم رموزها من خلال ترجمة ودراسة النصوص الأصلية للأساطير المصرية القديمة، ويعد كتاب الرمز والأسطورة من أهم مؤلفات كلارك، صدر لأول مرة عام 1959، وترجمه أحمد صليحة في  السبعينيات وطبع لصالح الهيئة العامة للكتاب",
    "https://drive.google.com/file/d/1fgs1tnyO46Uvoo4aW5p4qy9eJlc6dImg/view?usp=drivesdk",
    "https://youtu.be/GNmg4ZS4NfA"
)
val h10 = FieldModel(
    R.drawable.h10,
    "حضارة العرب",
    "يؤرخ لنا هذا الكتاب مجد العرب التَالِدِ الذي يضرب بجذوره في عمق أزمانٍ كان فيها العرب فرسان الحضارة الذين أضاءوا العالم بأمجادهم. ويوضح لنا هذا الكتاب الأقسام التي انقسم إليها العرب، والأمجاد التي حققوها عبر العصور المختلفة، والمبلغ الذي وصلوا إليه في مختلف العلوم والآداب، والفنون، وسياساتهم الحربية، والأدوات التي كانوا يستعينون بها في إدارة رحى الحرب، والنقود التي كانوا يستخدمونها عَبْرَ العصور المختلفة. وقد ذكر الكاتب طَرَفًا من أخلاق العرب وعاداتهم ومكانة المرأة عندهم؛ لِمَا لها من دلالة على رقيِّهم وتقدمهم، وقد برع الكاتب في الكشف عن أوجه هذه الحضارة، فذكر تفوقهم في الزراعة والصناعة والتجارة. ويمكننا أن نصف هذا الكتاب بأنه جاء كاشفًا عن مكنون الحضارة العربية، جامعًا لعلومها، وفنونها، وآدابها.",
    " الكاتب غوستاف لوبون",
    "3.2",
    "356",
    "العربية",
    "100",
    "غوستاف لوبون (7 مايو 1841 - 13 ديسمبر 1931) هو طبيب ومؤرخ فرنسي، عمل في أوروبا وآسيا وشمال أفريقيا، كتب في علم الآثار وعلم الانثروبولوجيا، وعني بالحضارة الشرقية. من أشهر آثاره: حضارة العرب وحضارات الهند و\"باريس 1884\" و\"الحضارة المصرية\" و\"حضارة العرب في الأندلس\" و\"سر تقدم الأمم\" و\"روح الاجتماع\" الذي كان انجازه الأول. هو أحد أشهر فلاسفة الغرب وأحد الذين امتدحوا الأمة العربية والحضارة الإسلامية. لم يسر غوستاف لوبون على نهج معظم مؤرخي أوروبا، حيث اعتقد بوجود فضلٍ للحضارة الإسلامية على العالم الغربي.\n" +
            "قام غوستاف لوبون برحلاتٍ عدة ومباحثات اجتماعية خلال حياته في العالم الإسلامي، اعتقد بموجبها أن المسلمين هم من مَدَّنوا أوروبا، وقد عبَّر عن آرائه بالمسلمين وحضارتهم في كتاباته. ألف عام 1884 كتاب حضارة العرب الذي سلك فيه طريقاً نادراً، إذ جمع فيه عناصر عديدة ممَّا أثر…\n ",
    "https://drive.google.com/file/d/1fmxEXEw-GrekOBY2HweWzttRMfd4bngv/view?usp=drivesdk",
    "https://youtu.be/gQClJpUXGD8"
)

///////////////////////////////////////Imagination///////////////////////////////////////////////////////
val imagination1 = FieldModel(
    R.drawable.ima10,
    "هالو",
    "تقِدم هذه الرواية مزيجًا من الواقع الافتراضي والذكاء الاصطناعي والفلسفة الروحانية؛ حيث يرسم المؤلِِّف خريطةً لتطوُّرِ حاسوبٍ ذكي بفضل اكتسابه الوعيَ الذاتي، فينقلنا إلى عالَم نشهد فيه رؤًى مستقبليةً شديدةَ الإثارة تتمخَّض عنها التكنولوجيا الحاسوبيةُ والهندسة  الحيوية، عبر حَبكْة روائية مُتقَنة تتخللَّها من آنٍ لآخر ومضاتٌ فلسفية .",
    "توم مادوكس",
    "4.1",
    "200",
    "العربية",
    "40",
    "كاتبُ خيالٍ علم ِّيٍ أمريكي، معروف لدَوره في بدايات حركة «السايبر بانك». نشُرَت أولى رواياته «هالو» في  عام ١٩٩١ بواسطة دار نشْر تور بوكس",
    "https://drive.google.com/file/d/1b56X9RWfcvf6-9eeLaVr_8CgAdH77dGk/view?usp=sharing",
    "none"
)
val imagination2 = FieldModel(
    R.drawable.ima1,
    "مهندسو الخيا ل",
    "وفجأةً تبَرُق في أذهاننا فكرةٌ ربما كانت غريبة، ربما كانت شاذةَّ؛ هل يكتفي الفضاء بأن يُرسِل إلى الأرض تلك الصخورَ المشتعلة التي تأتينا من حينٍ لآخر؟ أم أن هناك شيئاً في أحشاء تلك الصخور جاء يومًا إلى الكوكب الأزرق الزاهي، فغيَّر من شأنه وقلبَ بيئته رأسً ا   على عَقِب، وكان سبباً لوجودي ووجودك في مكانَينا الحاليَّين؛ أنا أكتب، وأنت تقرأ؟».",
    "ياسر أبو الحسب",
    "2.5",
    "130",
    "العربية",
    "80",
    " \"أديبٌ مصري، وُلد في محافظة الفيوم عام ١٩٨٩م. تخصَّص في كتابةِ أدب الخيال العلمي، فتولَّى رئاسةَ تحرير مجلة  \n" +
            "«علم وخيال» المهتمة بالعلوم والخيال العلمي منذ صدور أول أعدادها عام ٢٠١٢. من مُؤلَّفاته: «مهندسو الخيال»، و «قبلة أينشتاين،»  و«ماكينات الخيال»، فضلًً عن العديد من القصص المنشورة. \",\n",
    "https://drive.google.com/file/d/1b0yiIcYD7ev-KFdBOcD1yfp2H43FKKK-/view?usp=sharing",
    "https://youtu.be/w-9s1K1D01k"
)
val imagination3 = FieldModel(
    R.drawable.ima3,
    "كورو الرائع",
    "تجَمعُ عَلًقةُ صَداقةٍ بينَ جون نيكولاس، الرَّجلِ العَقلًن ِّيِ الذي لا يؤُمنُ بالخُرافاتِ ويُفسرُها جميعاً بتفسيراتٍ منطقيةَّ؛ وبيَنَ سكوت جوردان، رجلِ الأعمالِ الثرَّ ِّيِ الشديدِ الإيمانِ بالخُرافاتِ بالرَّغمِ مِن نجَاحِه الباهرِ في مجالِ الأعمال. يُق ِّرِرُ جون نيكولاس إثباتَ احتيالِ المُشعوِذينَ والدجَّالينَ الذين اتخَّذوُا من منزلِ صدِيقِه سكوت جوردان مَلًذاً لهم، لكِنَّ ما جَرى بعد ذلك يَفوُقُ الخيال! تأخذُنا القصَّة، عبْرَ حِيلَِ المُشعوِذين والدجَّالينَ ،إلى عالَمٍ غَريبٍ تدُقُّ فيه الأجراسُ بلً أيادٍ بشريَّة، وتمتدُّ الأذرُعُ الشَّبحيَّةُ من وراءِ ستائرِ المجهول، وتلَتقَي  الأشكالُ المُعتمِةُ التي تنَتمِي إلى ك ِّلِ عصُورِ التاريخِ وَجهًا لوَجه. ترَى مَا السِرُّ وراءَ كلِ ما يحَدثُ؟",
    "إدوارد بيدج ميتشل",
    "4.2",
    "18",
    "العربية",
    "45",
    "  \"كاتبُ قصصٍ ومحرِرٌ أمريكي، وُلِد في عام ١٨٥٢، ويعَُد من الشخصيات الرئيسية في تطوُّر أدب الخيال العلمي.  \n" +
            "وُصِف لاحقاً بأنه «العملًق المفقود في أدب الخيال العلمي الأمريكي»؛ إذ كتب الكثيرَ من قصص الخيال العلمي في الفترة الممتدة من  سبعينيات القرن التاسع عشر إلى تسعينياته، وجميعها تقريباً نشُِرت في صحيفة «ذا صن» اليومية في نيويورك، دونَ الكشف عن هوُيته\",\n",
    "https://drive.google.com/file/d/1bOox_5GtmcgR_AxGOQjtwk_hJ1FoVrwh/view?usp=sharing",
    "none"
)
val imagination4 = FieldModel(
    R.drawable.ima9,
    "قصة الايام القادمة",
    "    \"قصةُ حبٍ بينَ فتاةٍ تبَلغُ مِنَ العمُرِ ثمانيةَ عشرَ عامًا، وشا ِّبٍ لا يَكبرُها بكثير. يُق ِّرِرُ والِدُ الفتاة، السيدُ« مورس»، الاستعانةَ بمُنِوِمٍ مِغناطيسيٍ لعلًجِ ابنتِه من داءِ الهوى. كانت الابنةُ هي الوريثةُ الوحيدةُ لثرَوةِ أ ِّمِها الراحِلة، وكانَ والدُها يَنوْي تزويجَها لأحدِ أصدقائِه بدلاً من ذاكَ الشا ِّبِ الذي يَنتمي إلى طبقةٍ اجتماعيةٍ متدنِِّيةٍ ويعملُ في وظيفةٍ مُتواضِعة، لكنَّ الشابَّ يَنجحُ في الظَّفَرِ بحبيبتهِ ليَفِرَّا معاً  \n" +
            "ويعَيشَا في العالَمِ السُّفل ِّيِ لمدينةِ لندن. يوُاجِهُ العاشِقانِ عالمًَا جديدًا مَجْهولاً قاسياً، يتسَِّمُ بالطبقيةِ الشديدة. فهَل يَنجَحانِ في الاستمرارِ معاً  في هذا العالَمِ في ظِ ِّلِ فَقرِهما الشديدِ وانعدامِ خِبرَتهِما في الحياة، أمْ أنَّ قسوةَ الحياةِ ستفُ ِّرِقهُما في نهايةِ المَطاف؟ \",\n ",
    "هربرت جورج ويلز",
    "3.4",
    "88",
    "العربية",
    "100",
    "أديبٌ ومُفكِِّرٌ إنجليزي، يعَُدُّ الأبَ الرُّوحيَّ لأدَبِ الخيالِ العلمي. كان ويلز غزيرَ الإنتاجِ في العديدِ من صُنوفِ الأدب، ومِن بَينهِا ال ِّرِوا يَة، والقِصةُ القصيرة، والأعمالُ التاريخية والسياسية والاجتماعية؛ لكنْ ذاعَ صِيتهُُ ولا نَزالُ نَتذكَّرُهُ حتى اليوَمِ مِن خِلًلِ رِواياتِ الخيالِ العلم ِّيِ التي كَتبهَا، وأهمُّها «آلة الزمن». ",
    "https://drive.google.com/file/d/1b6p31wk_9tprjr6vpNVf6lWATjJinrpJ/view?usp=sharing",
    "none"
)
val imagination5 = FieldModel(
    R.drawable.ima8,
    "صانع المعجزات",
    "    \"لم يكنُِ السيدُ فوثرينجاي يؤُمِنُ بوجودِ قدراتٍ خارِقة، بل في واقعِ الأمرِ كانَ يشُكِِّكُ في حدوثِ المُعجِزاتِ إلى أنْ جاءَتْه أولُ إشارةٍ تلِمِحُ بقدراتهِِ الاستثنائية. أمسيةٌ في حانةِ جعلتَِ السيدَ فوثرينجاي يكتشفُ أنَّ قوةَ الإرادةِ قد تغُيِّرُ المَسارَ المعتادَ لقوانينِ الطبيعةِ  لتحَدثَُ  \n" +
            "المُعجِزات! ولَمْ تقَتصِرِ المُعجِزاتُ على الحِيلَِ الصغيرةِ والمحدودة، كتحريكِ الأكوابِ وقِطَعِ الأثاثِ من أماكِنهِا، بل وصلَ تْ إلى مُعجِزاتٍ كُبرَى كادَتْ تفُنِي الحياةَ نفسَها على كوكبِ الأرض! هل كانتَِ المُعجِزاتُ قدراتٍ استثنائيةً فعلًً تجَلبُ الخيرَ على صاحِبهِا، أم تنُذِرُ بالش ِّرِ  على البشريةِ جَمْعاء؟! وكيفَ أنقَذَ صانعُ المُعجِزاتِ الأرضَ من مَصيرِها المشئوم؟!\",\n!",
    "هربرت جورج ويلز",
    "3.5",
    "88",
    "العربية",
    "90",
    "أديبٌ ومُفكِّرٌ إنجليزي، يعَدُّ الأبَ الرُّوحيَّ لأدَبِ الخيالِ العلمي. كان ويلز غزيرَ الإنتاجِ في العديدِ من صُنوفِ الأدب، ومِن بَينهِا ال ِّرِوا يَة، والقِصةُ القصيرة، والأعمالُ التاريخية والسياسية والاجتماعية؛ لكنْ ذاعَ صِيتهُُ ولا نَزالُ نَتذكَّرُهُ حتى اليوَمِ مِن خِلًلِ رِواياتِ الخيالِ العلم ِّيِ التي كَتبهَا، وأهمُّها «آلة الزمن». ",
    "https://drive.google.com/file/d/1bdmSV8Up3qm9bOZ-TBJZYjCL9zwidZY5/view?usp=sharing",
    "none"
)
val imagination6 = FieldModel(
    R.drawable.ima7,
    "دوارة الرياح الطائرة",
    "طالما شكلََّ الشيطانُ هاجِساً للإنسان؛ حتى إنه كثيرًا ما جُ ِّسِد كشخصيةٍ محوريةٍ في الكثير من الأعمالِ الأدبيَّة على م ِّرِ العصور. وفي هذه القِصَّة، التي تدَورُ أحداثهُا في بلدةِ نيو آجين، على ساحلِ مين في الولاياتِ المُتحَّدةِ الأمريكية، يتنكَّرُ الشيطانُ في هيئةِ رجلٍ خَيِِّرٍ ليهُدِيَ أهلَ المرفأِ« دوَّارةَ رياحٍ» ذهبيةً ليُت ِّوِجُوا بها كنيستهَم الجديدة. إلا أنهم يُدرِكونَ لاحقاً أنها لم تكن إلا إحدى حِيلَِ الشيطان، حين تطيرُ «دوَّارةُ الرياحِ» بكنيستهِم من مكانهِا أعلى التل، الذي ادَّعى الشيطانُ مِلكْيَّتهَ لِأراضيه، إلى أسفلَ في المستنقعِ الذي لا يليقُ بجلًلِ  الصَّرْحِ المُقدَّس. ترَُى كيف ستنتهي هذه المعركةُ بين أهلِ البلدةِ والشيطان؟  ",
    "إدوارد بيدج ميتشل",
    "2.4",
    "18",
    "العربية",
    "90",
    "كاتبُ قصصٍ ومح ِّرِرٌ أمريكي، وُلِد في عام ١٨٥٢، ويعَُد من الشخصيات الرئيسية في تطوُّر أدب الخيال العلمي.  ",
    "https://drive.google.com/file/d/1bXj_GRYa6S0bswAjSRiMlm7scd9-VrPg/view?usp=sharing",
    "none"
)
val imagination7 = FieldModel(
    R.drawable.ima5,
    "حربنا مع إمارة موناكو",
    "كانَ كلُّ شيءٍ على ما يُرامُ في إمارةِ «موناكو» حتى خَطا شَخصٌ يُدْعى «تايتسِ» أولَ خطوةٍ له فيها لتنقلِبَ الأحوالُ رأساً على عَقِب.  فما حكايةُ «تايتسِ»؟ وما علًقتهُ بالقُنصُلِ الأمريكي؟ وكيفَ قاَدَ «تايتسِ» الرعايا الأمريكيِِّين في «موناكو» إلى الحَرب؟ وما الذي ستئَوُلُ إليه تلك الحَرب؟ اقرأِ التفاصيلَ لتعَرفَ قصةَ أقصرِ حَربٍ في التاريخ، وكيفَ يمُكنُ لأحداثٍ بسيطةٍ أن تقودَ شَعباً إلى نِزاعٍ سياس ِّي ٍ  كادَ يحُ ِّوِلُ المدينةَ إلى ساحةٍ داميةٍ بينَ ليلةٍ وضُحاها ",
    "إدوارد بيدج ميتشل",
    "2.4",
    "26",
    "العربية",
    "150",
    "كاتبُ قصصٍ ومحرِرٌ أمريكي، وُلِد في عام ١٨٥٢، ويعَُد من الشخصيات الرئيسية في تطوُّر أدب الخيال العلمي.  ",
    "https://drive.google.com/file/d/1bFG_B1vUf_68odsh3HJs_JaVn630J02S/view?usp=sharing",
    "none"
)
val imagination8 = FieldModel(
    R.drawable.ima6,
    "القمع",
    "يَرغبُ  راوت، الفناَّن، في التعرُّفِ على التأثِيراتِ الفنيةِ للضَّوءِ والظِِّ ِّلِ في البيئةِ ال ِّصِناعيَّة، ويخُطِِّطُ للذَّهابِ إلى مَصنعِ الحديد معَ هوروكس، مديرِ المَصنع، كَيْ يُريَهُ إياَّها. وفي بيتِ هوروكس، قبلَ الذَّهابِ، يَدوُرُ حديثٌ هامِسٌ بينَ راوت وزوجةِ هوروكس، وفجأةً يَنفتحُِ البابُ ليَظهرَ هوروكس على عَتبتِه.ترَُى، عَمَّ كاناَ يَتحدَّثان؟ وهل سمِعَ هوروكس ما كانا يقولانِه؟ وماذا لو أنَّه سَمِع؟ وهل يغُيِّرُ ذلك مِنَ الأمرِ شَيئاً إذْ يَذهبانِ معًا في تلك اللَّيلةِ لرُؤيةِ المَصنع؟ ما الذي سيحَدثُ في تلك الأجْواءِ التي تمُورُ فيها الأفْرانُ بالحديدِ الذي يَتدفَّقُ  مُنصهِرًا تحتَ ضوءِ القمََر؟ اقرَأِ القِصَّةَ لتعَرفَ الأحَداثَ المُثِيرة ",
    "هربرت جورج ويلز",
    "2.5",
    "20",
    "العربية",
    "80",
    "ديبٌ ومُفكِِّرٌ إنجليزي، يعَُدُّ الأبَ الرُّوحيَّ لأدَبِ الخيالِ العلمي. كان ويلز غزيرَ الإنتاجِ في العديدِ من صُنوفِ  الأدب، ومِن بَينهِا ال ِّرِوايَة، والقِصةُ القصيرة، والأعمالُ التاريخية والسياسية والاجتماعية؛ لكنْ ذاعَ صِيتهُُ ولا نَزالُ نَتذكَّرُهُ حتى اليوَمِ مِن  خِلًلِ رِواياتِ الخيالِ العلم ِّيِ التي كَتبهَا، وأهمُّها «آلة الزمن»..  ",
    "https://drive.google.com/file/d/1bXiJDFCT-asI4hrLU4Yu-_HiJk1lLUPB/view?usp=sharing",
    "none"
)

val imagination9 = FieldModel(
    R.drawable.ima4,
    "العالم الطريف",
    "لا عجب إن هؤلاء القوم المساكين، مجانين خبيثين تعساء، فإن دنياهم لم تسمح لهم أن يكونوا PDF رواية العالم الطريف ألدوس هكسلي أصحاء العقول فاضلين سعداء. ذلك أنهم كانوا يعانون وجود الأمهات والمحبين، والمحرمات التي لم يألفوا اقترافها، ووسائل الإغراء ووخزات الضمير عند الوحدة، والأمراض والآم العزلة التي لا تنتهي ،والشكوك والفقر. وإذا كان احساسهم بذلك شديداً يزداد في حالات  العزلة الفردية التي لا رجاء فيها، فكيف  يستقرون ؟",
    "ألدوس هكسلي ",
    "2.8",
    "212",
    "العربية",
    "70",
    "هو كاتب إنجليزي اشتهر بكتابة الروايات والقصص القصيرة وسيناريوهات الأفلًم. قضى حياته منذ 1937 في مدينة لوس أنجلوس. رواية العالم الطريف تعد من أفضل أعماله وأشهرها",
    "https://drive.google.com/file/d/1bFlKF7nQ4qV8Mj7p2ho1U55LkKckNUUU/view?usp=sharing",
    "none"
)
val imagination10 = FieldModel(
    R.drawable.ima2,
    "الطاعون القرمزي",
    "بعد أن تصل الحضارة إلى أوج ازدهارها، يعمُّ الطاعون أرجاء العالم؛ فيُرى المصابون وقد اصطبغت وجوههم باللون القرمزي، ثم يموتون بعد ذلك في غضون ساعة أو أقل. على الرغم مما حقَّقته البشرية من إنجازات، فقد وقفت مكتوفة الأيدي أمام هذا الوباء ولم تستطع له دفعاً. تلًشى كل ما عرفه البشر من مظاهر الحياة التي ألِفوها وحسبوا أنها من المُسلمَّات، وكاد الطاعون القرمزي يُفني البشرية جمعاء، لكن القدَر كتب النجاة لعدد قليل منهم. أمَّا الحضارة، فقد انهارت تمامًا، وارتدَّ هؤلاء الناجون إلى حياة الهمجية البدائية التي عاشها أسلًفهم من آلاف السنين",
    "جاك لندن",
    "2.7",
    "82",
    "العربية",
    "80",
    "مؤلف وصحفي وناشط اجتماعي أمريكي، وُلد في ١٢ يناير عام ١٨٧٦م. كان «جاك» من أوائل مؤلِِّفي الأعمال الخيالية الذين حققوا شهُرة عالمية وثروة طائلة من كتاباتهم. عُرف عنه أنه كان مدافعاً شرساً عن الاشتراكية وتكوين النقابات وحقوق العمُال،   وكتب العديد من الأعمال القوية التي تناولت هذه الموضوعات",
    "https://drive.google.com/file/d/1bDBrkhjJQpFHlKoSiiBtgEITXuPfLVem/view?usp=sharing",
    "none"
)

/////////////////////////////////////////////Literature/////////////////////////////////////////////////
val Literature1 = FieldModel(
    R.drawable.lit1,
    "مشكل مصطلحى الحديث والمعاصر في الادب العربي",
    "إن مشكل تعريف المصطلح الأدبي مشكل قديم متجدد ، وهو ليس خاصاً بالأدب العربي وحده بل بكل الآداب العالمية ، فهي مشكلة تواجه الأدب أينما كان ، ولعل ذلك يرجع إلى أن عملية الخلق الفني عملية معقدة وغير متناهية في تطورها ، ففي كل مرة يتم اكتشاف أشكال ، ومصطلحات ، وتقنيات جديدة للأدب ، ومنذ أقدم العصور لا يكاد النقاد يتواطئون على تعريف مصطلحات مشهورة كمصطلح (الأدب) أو (الشعر) أو في العصر الحديث (كالرواية) أو(الصورة الفنية). ",
    "محمد عبد الله سليمان",
    "4.4",
    "79",
    "العربية",
    "50",
    "كاديمي وناقد من السودان ولد بمدينة المسعودية 1964 حاصل على بكالوريوس اللغة العربية وآدابها 1988 ودرجة الماجستير 2005 والدكتوراه 2008 والأستاذية 2018 عمل في جامعة القرآن الكريم",
    "https://drive.google.com/file/d/1dVigWivPfnHqqxORwka0ECq7tWtuJ9Pw/view?usp=sharing",
    "none"
)

val Literature2 = FieldModel(
    R.drawable.lit2,
    "فلاسفة الحكم في العصر",
    "لفكر الإنسانى سلسلة مترابطة، وما صيغ في القرن العشرين أو شاع خلاله، ما كان ليصاغ لولا ما تقدمه من حلقات الحكم القديم والفلاسفة الأولين بدءًا من أفلاطون وهيرودوت وأرسطو وشيشرون.. وما توالى من بعدهم حتى أطللنا على العصر الحديث. تفلسف حكماء اليونان في مسألة الحكم كما تفلسفوا في سائر المسائل التي عرضت لعقل الإنسان في الزمن القديم، وقد صارت لهم قُبَيْل فلسفة الحكم ملاحظات واقعية دونها هيرودوت قبل مولد أفلاطون يتحدث فيها عن «المساواة»، وربما لو امتد به الأجل لأضاف دليلاً جديدًا على فضيلة الحرية، وهى ارتقاء الفكر ونبوغ الفلاسفة الذين يلقون أنوارهم على المسألة بحذافيرها ويتناولون قواعد الحكم وحقوق المحكومين على وجوهها. ",
    "عباس محمود العقاد ",
    "2.3",
    "88",
    "العربية",
    "70",
    "صدر عام 1950 عن دار المعارف ضمن سلسلة «اقرأ» في 152 صفحة. يقدم العقاد مجموعة من الآراء السياسية لفلاسفة مهمين من القرن العشرين طارحًا رؤيتهم في نظرية الحُكم والعقد المُنظم للعلاقة بين الأفراد والحاكم",
    "https://drive.google.com/file/d/1dXNHsCm-MMijU-_rVpD1IGxiKTHuOe7N/view?usp=sharing",
    "none"
)
val Literature3 = FieldModel(
    R.drawable.lit3,
    "تاريخ الادب العربي الجزء الاول",
    "كتاب تاريخ الأدب العربي هو كتاب متخصص في توثيق وكتابة تاريخ الآداب على مدى عدة عصور، وهو من تأليف شوقي ضيف ويقع في عشرة مجلدات أو أجزاء، ويعدّ هذا الكتاب من الكتب الكبيرة حيث يبلغ عدد صفحاته خمسة آلاف ومئة واثنين وثمانين صفحة تحدث فيها عن كافة عصور الأدب العربي، ومن الجدير بالذكر أنّ الكتاب في طبعته الأولى نُشر عن دار المعارف مصر 1960م.",
    "شوقي ضيف",
    "3.5",
    "340",
    "العربية",
    "150",
    " \"لدكتور شوقي ضيف لتأريخ الأدب العربي، وقد قسّم السلسلة حسب التقسيم السياسي، فابتدأه بالعصر الجاهلي وانتهي بالعصر الحديث، وكان كتاب \"تاريخ الأدب العربي في العصر الجاهلي\" أوّل هذه السلسلة، وكان الهدف من هذه السلسلة التأريخ للأدب في الدرجة الأولى لا دراسته. \",",
    "https://drive.google.com/file/d/1eLVDdJMRDeG8fQJKEt1PEc958pxnves4/view?usp=sharing",
    "none"
)
val Literature4 = FieldModel(
    R.drawable.lit4,
    "تاريخ الادب العربي الجزء التانى",
    " العصر الإسلامي تحدث في هذا الجزء حول عدة موضوعات، ومن ضمنها الآتي: عصر صدر الإسلام والقيم الروحية والعقلية والاجتماعية والإنسانية التي أصبحت سائدة فيه وتؤثر على الأدب. تحدث عن القرآن والحديث وعن نزول القرآن وحفظه وقراءاته، وعن تفسيره في العهد الأول، وعن أثر القرآن في اللغة والأدب وعن الحديث النبوي الشريف. الشعر وكثرته، والشعراء المخضرمون، والشعر في عصر الرسول صلى الله عليه وسلم. الشعر في عصر الخلفاء الراشدين، وشعر الفتوح، وتأثر الشعر بالإسلام. ",
    "شوقي ضيف ",
    "3.2",
    "300",
    "العربية",
    "100",
    "\"الكتاب جزءٌ من سلسلة ألفها الدكتور شوقي ضيف لتأريخ الأدب العربي، وقد قسّم السلسلة حسب التقسيم السياسي، فابتدأه بالعصر الجاهلي وانتهي بالعصر الحديث، وكان كتاب \"تاريخ الأدب العربي في العصر الجاهلي\" أوّل هذه السلسلة، وكان الهدف من هذه السلسلة التأريخ للأدب في الدرجة الأولى لا دراسته.\",",
    "https://drive.google.com/file/d/1eShlkx3qU4ToAcESAXlNs8SSb7wi9sMn/view?usp=sharing",
    "none"
)
val Literature5 = FieldModel(
    R.drawable.lit4,
    "تاريخ الادب الاندلسي",
    "    \"وهذا الكتاب هو الثاني في \"تاريخ الأدب الأندلسي\" وهو يضم بحثاً في الظاهرة الأدبية في عصر أمراء الطوائف ودولة المرابطين، والهدف منها رسم الصورة التي بلغها الأدب الأندلسي في تطوره، أثناء عصر ملوك الطوائف ودولة المرابطين، فبعد مقدمات تنعكس ظلالها على الحياة الأدبية، درس البحث تطور الأدب في ناحيتين الشكل والموضوع. \",",
    "إحسان عباس ناقد ",
    "3.1",
    "244",
    "العربية",
    "150",
    "إحسان عباس ناقد ومحقق وأديب وشاعر، ولد في فلسطين في قرية عين غزال في حيفا سنة 1920م. انهى فيها المرحلة الابتدائية ثم حصل على الاعدادية في صفد، ونال منحة إلى الكلية العربية في القدس، ثم عمل في التدريس سنوات، التحق بعدها بجامعة القاهرة عام 1948م حيث نال البكالوريوس في الادب العربي فالماجستير ثم الدكتوراة. كان غزير الإنتاج تأليفا وتحقيقا وترجمة من لغة إلى لغة ",
    "https://drive.google.com/file/d/1eStoIAl1yYBxNnWq7eJyeTaKBfKYLIqC/view?usp=sharing",
    "none"
)
val Literature6 = FieldModel(
    R.drawable.lit5,
    " الصراع بين القديم والجديد في الادب العربي",
    "يدخل كتاب الصراع بين القديم والجديد في الأدب العربي المعاصر ج 1 – د. محمد الكتاني في دائرة اهتمام الباحثين في مجال اللغة العربية بشكل خاص والباحثين في التخصصات قريبة الصلة بوجه عام حيث يقع كتاب الصراع بين القديم والجديد في الأدب العربي المعاصر ج 1 – د. محمد الكتاني في نطاق تخصص علوم اللغة العربية ووثيق الصلة بالتخصصات الأخرى مثل البلاغة اللغوية والأدب العربي والشعر والنثر وغيرها من الموضوعات اللغوية التي تهم الدارس في هذا المجال. ",
    " محمد الكتابى ",
    "2.5",
    "544",
    "العربية",
    "140",
    "\"نماذج من أعمال محمد الكتابى \n" +
            "❰ له مجموعة من المؤلفات أبرزها ❞ الصراع بين القديم والجديد فى الادب العربي الحديث ❝ الناشرين : ❞ دار الثقافة ❝ ❱ \",\n",
    "https://drive.google.com/file/d/1dVPtUIoRqXpWnw7LZD1U2HQt7ndUEvqg/view?usp=sharing",
    "none"
)
val Literature7 = FieldModel(
    R.drawable.lit6,
    "الادب العربي الحديث ",
    "طلق الأدب الحديث رائداً للفكر والمجتمع والحراك الثقافي، يحمله أدباء من أمثال الشدياق ، وطه حسين، وعباس محمود العقاد ، والمازني، وغيرهم الكثير. وتصدر الانطلاقة كبار الشعراء مثل البارودي، وأحمد شوقي، والزهاوي، وخليل مطران خليل، وعبد الرحمن شكري ومحمد العثيمين، ومحمد الخليفة، ويوسف العظم، وجمعٌ من شعراء المهجر كإيليا أبو ماضي, والشاعر القروي، ومنهم شعراء الشام مثل عمر أبو ريشة، وشعراء المغرب كعلال الفاسي، والمعداوي, والشابي. وكذلك تكونت الاتجاهات الشعرية المتنافسة وتلاحقت وتولدت حركات أدبية لها تكويناتها وآثارها، وقد سهلت السبل لهذه الحركة أسس البنية الثقافية: كحركة إحياء التراث، وحركة الترجمة، وحركة الطباعة، وتكونت الصحافة. ",
    "مسعد بن عيد العطوي ",
    "2.4",
    "149",
    "العربية",
    "170",
    "\"❰ له مجموعة من المؤلفات أبرزها ❞ الادب العربي الحديث ❝ ❞ تجليات فكرية ❝ ❞ المقطعات الشعرية في الجاهلية وصدر الإسلام ❝ الناشرين : ❞ مكتبة التوبة ❝ ❱ \n" +
            "مسعد بن عيد العطوي، أستاذ جامعي، من مواليد مدينة تبوك عام 1370هـ، عُين عضواً في مجلس الشورى عام 1422هـ، ويعد أحد أبرز أدباء المملكة العربية السعودية المعاصرين. صدر له مجموعة من المؤلفات التي تعنى بتاريخ منطقة تبوك من أبرزها: كتاب (تبوك المعاصرة والآثار حولها)، وكتاب (تبوك قديمًا وحديثًا)، كما صدرت له العديد من الإصدارات في النقد الأدبي. \",\n ",
    "https://drive.google.com/file/d/1dTJDyY8wNTdLbm_qKtnjKXfEJ074Zb4R/view?usp=sharing",
    "none"
)

val Literature8 = FieldModel(
    R.drawable.lit7,
    "الادب الانجليزي المعاصر",
    "يدخل كتاب الأدب الإنجليزي المعاصر دراسات وقضايا في دائرة اهتمام المتخصصين في علوم اللغة العربية وآدابها تحديدًا والباحثين في الموضوعات ذات الصلة بوجه عام؛ حيث يقع كتاب الأدب الإنجليزي المعاصر دراسات وقضايا ضمن نطاق تخصص علوم اللغة ووثيق الصلة بالفروع الأخرى مثل الشعر، والقواعد النحوية، والصرف، والأدب، والبلاغة، والآداب العربية ",
    "عادل سلامة",
    "4.2",
    "260",
    "العربية",
    "80",
    "(ولد في نابلس عام 1966، توفي في ألمانيا في 23 يناير 2019) عام هو ملحن وعازف عود فلسطيني هاجر إلى أوروبا عام 1990، أقام حفلات في أكثر من خمسين دولة، وله سبعة الألبومات. ",
    "https://drive.google.com/file/d/1e94yw56q0mudEyEexz9pJIB0mtk-Fio1/view?usp=sharing",
    "none"
)
val Literature9 = FieldModel(
    R.drawable.lit10,
    "تاريخ الأدب العربي",
    "يدخل كتاب أحاديث في الأدب في دائرة اهتمام المتخصصين في علوم اللغة العربية وآدابها تحديدًا والباحثين في الموضوعات ذات الصلة بوجه عام؛ حيث يقع كتاب أحاديث في الأدب ضمن نطاق تخصص علوم اللغة ووثيق الصلة بالفروع الأخرى مثل الشعر، والقواعد النحوية، والصرف، والأدب، والبلاغة، والآداب العربية.  ",
    "عبد الحليم النجار ",
    "2.9",
    "132",
    "العربية",
    "80",
    "ديب تونسي متميز؛ تؤرقه الكثير من القضايا العربية، وتؤلمه المعارك الفكرية الغير موضوعية والتي قد تتحول إلى التجريح وإلى الجوانب الشخصية. هو أديب من بنزرت مدينة الجلاء، واستشهد شقيقه المرحوم (محمد الحبيب الذوادي) في معركة بنزرت عام 1961م حرقاً بـ (النبالم) وكان الشهيد مربيا قديرا وله اهتمامات بالقصة القصيرة، وكتب عن بطولاته الأديب التونسي حمودة الشريف قصة للأطفال تحمل عنوان: (المعلم الشهيد)؛ صدرت في طبعات متعددة في كل من تونس والجزائر في أواخر الستينات. ",
    "https://drive.google.com/file/d/1eDHOWUcX8Kyjy1kWubN_IjVz1XSaLeSv/view?usp=sharing",
    "none"
)
val Literature10 = FieldModel(
    R.drawable.lit9,
    "الادب الأنجليزي",
    "يدخل كتاب أحاديث في الأدب في دائرة اهتمام المتخصصين في علوم اللغة العربية وآدابها تحديدًا والباحثين في الموضوعات ذات الصلة بوجه عام؛ حيث يقع كتاب أحاديث في الأدب ضمن نطاق تخصص علوم اللغة ووثيق الصلة بالفروع الأخرى مثل الشعر، والقواعد النحوية، والصرف، والأدب، والبلاغة، والآداب العربية.  ",
    "يول دوتان ",
    "2.9",
    "192",
    "العربية",
    "80",
    "ديب تونسي متميز؛ تؤرقه الكثير من القضايا العربية، وتؤلمه المعارك الفكرية الغير موضوعية والتي قد تتحول إلى التجريح وإلى الجوانب الشخصية. هو أديب من بنزرت مدينة الجلاء، واستشهد شقيقه المرحوم (محمد الحبيب الذوادي) في معركة بنزرت عام 1961م حرقاً بـ (النبالم) وكان الشهيد مربيا قديرا وله اهتمامات بالقصة القصيرة، وكتب عن بطولاته الأديب التونسي حمودة الشريف قصة للأطفال تحمل عنوان: (المعلم الشهيد)؛ صدرت في طبعات متعددة في كل من تونس والجزائر في أواخر الستينات. ",
    "https://drive.google.com/file/d/1eDHOWUcX8Kyjy1kWubN_IjVz1XSaLeSv/view?usp=sharing",
    "none"
)

//////////////////////////////////////////self Development////////////////////////////////////////////////////
val self_dev1 = FieldModel(
    R.drawable.ph2,
    " كيف تمسك بزمام القوة ",
    "في هذا الكتاب محاولة لاختزال ثلاثة آلاف عام من التاريخ الإنساني بقصص منتقاة عن كيفية اكتساب المرء للقوة، أو تفهمه لها من مختلف جوانبها أو حماية نفسه من عسفها وتسلطها أو الحفاظ عليها وممارستها بحكمة وتعقل، أو تحييدها لاتقاء شرّها. وتطل هذه القصص على التجربة الإنسانية من أزمنة وأمكنة مختلفة تمتد من اليابان إلى بيرو، ومن بداية تدوين التاريخ إلى أيامنا هذه. وفيها دروس سلبية أو إيجابية يجمع بينها عنصر التشويق من جهة وتطبيقات في الحياة العملية على أرض الواقع من جهة أخرى، سواء أحبها المرء أو كرهها. ذلك أنها تصوير لما حدث، وليس لما كان ينبغي أن يحدث. ووصف للبشر كما هم بالفعل وليس كما يتمنى المرء أن يكونوا عليه. يعرض المؤلف موضوعه بنص جريء وأنيق، مطبوع بالأسود والأحمر، ومُفْعم وطافح بخرافات وعبارات ذات نحت فريد، وإخفاقات لرموز تاريخية كبيرة مثل: الداهية الكبرى، الملكة إليزابيت الأولى وغيرها من الذين مارسوا القوة ببراعة أو وقعوا فريسة لها. إن القواعد التي حددها المؤلف تعلم الحاجة إلى التدبر والحصافة والحكمة والحذر، وفضيلة الحركة الخفية، وقوة الإغواء يتطلب منك الانضباط والدراية. إن جميع هذه القواعد (القوانين)، توفر فهماً عميقاً لاستراتيجيات يتبعها الآخرون، وتوفر لك طرائق كي تتجنبها أو تتعايش معها، سواء أكنت في عملك، أم تنظر في علاقاتك مع الآخرين، أو كنت تسير على الطريق، أو تستمع إلى نشرة أخبار المساء، إنك ستجد تطبيقاً لهذه القواعد. وسواء أكنت تنزع إلى العدوان أم إلى الدفاع فإنك ستجد في هذا الكتاب فوائد جُلى وقراءة ممتعة. ",
    "روبرت غرين",
    "4.3",
    "60",
    "العربية",
    "55",
    "ولد روبرت غرين في 14 أيار (مايو) 1959، وهو كاتب ومتحدث أمريكي اشتهر بكتبه حول النفوذ والاستراتيجيات وإغراء. ألّف خمسة كتب من أكثر الكتب مبيعاً وهي 48 قانونا للسلطة، فن الإغراء، 33 استراتيجية للحرب، القانون الخمسون (مع 50 سنت) والإتقان. ",
    "https://drive.google.com/file/d/1rJbCdceXCNZjpAv--q7Y0wIKq3ODqluh/view?usp=share_link ",
    "https://youtu.be/ryVx3dWl4o8 "
)
val self_dev2 = FieldModel(
    R.drawable.ph9,
    " أهم 50 كتاب في علم النفس ",
    "يمثل هذا الكتاب مدخلًا هامًا لكل من يرغب في الدخول لعلم النفس، حيث يقدم لنا المؤلف خمسين كتابًا هم الأهم والأبرز في هذا المجال، ويطوف بنا في رحلة ماتعة تتضمن مئات الأفكار التي حوتها هذه الكتب، وأبرز العلماء في هذا المجال، كما أن هذه الكتب منها القديم ومنها المعاصر، بالتالي فهي تطلعنا على تاريخ ومراحل هذا العلم، بتسلسلها التاريخي. وبالتالي فالقارئ يحصل على وجبة دسمة يطلع فيها على أبرز أفكار علماء النفس مثل ألفريد أدلر، وألبرت أليس، وميلتون إريكسون، وفيكتور فرانكل، وفرويد، وهاري هارلو، وكارين هورناي، ويطلع على أبرز مؤلفاتهم ونظرياتهم، وغير ذلك من المحاور الهامة.",
    "إيمون باتلر",
    "4.7",
    "90",
    "العربية",
    "50",
    "مدير معهد آدم سميث، وحاصل على درجات جامعية في علم الاقتصاد والفلسفة وعلم النفس من جامعة سانت أندروز. درَّس الفلسفة في كلية هيلزديل كوليدج، بميشيجان، قبل أن يعود إلى المملكة المتحدة للمساعدة في إنشاء معهد آدم سميث في أواخر السبعينيات من القرن الماضي. ألف كتبًا عن اقتصاديين أمثال ميلتون فريدمان، إضافة إلى كتب تمهيدية عن فون ميزس وآدم سميث لمعهد الشئون الاقتصادية. له إسهامات كثيرة في الإعلام المقروء والمرئي والمسموع، وجذبت كتبه الأخيرة الرائجة مثل «أفضل كتاب عن السوق» قدرًا كبيرًا من الاهتمام. ",
    " https://drive.google.com/file/d/1lQx2mtNu4SxBKtpGcYM8QPsIFFPmXsqy/view?usp=share_link  ",
    " https://youtu.be/CmPChzianvI"
)
val self_dev3 = FieldModel(
    R.drawable.ph5,
    " أول 20 ساعة ",
    "    \"في هذا الكتاب الصغير الملهم يجادل المؤلف \"جوش \" في أنك تستطيع أن تصبح جيدا بما يكفي في أي شيء لدرجة أنك تستمتع به في 20 ساعة فقط بمعنى آخر كل ما يقف بينك وبين العزف على الأوكليلي هو الوقت الذي كنت ستقضيه أمام التليفزيون في الاسبوعين القادمين فاذا كان بوسع جوش وهو أب ومبادر أعمال مشغول أن يفسح لنفسه ما يكفي من الوقت فان بقيتنا يستطيع أن يفعل ذلك أيضاً. \", ",
    " جوش كاوفمان ",
    "4",
    "100",
    "العربية",
    "80",
    "هو مؤلف الكتب الأكثر مبيعًا عن الأعمال وريادة الأعمال واكتساب المهارات والإنتاجية والإبداع وعلم النفس التطبيقي والحكمة العملية. تركز أبحاث جوش على الأعمال ، وريادة الأعمال ، واكتساب المهارات ، والإنتاجية ، والإبداع ، وعلم النفس التطبيقي ، والحكمة العملية. ساعد نهجه الفريد والمتعدد التخصصات في إتقان الأعمال واكتساب المهارات السريعة ملايين القراء حول العالم على تعلم المفاهيم والمهارات الأساسية بشروطهم الخاصة. ظهر Josh باعتباره المؤلف الأول الأكثر مبيعًا في Business & Money ، حسب ترتيب Amazon.com ، وقد بيعت كتبه أكثر من نصف مليون نسخة حول العالم. ظهرت أبحاث جوش من قبل نيويورك تايمز ، وبي بي سي ، وصحيفة وول ستريت جورنال ، ذي أتلانتيك ، فورتشن ، فوربس ، تايم ، بيزنس ويك ، وايرد ، فاست كومباني ، فاينانشال تايمز ، HarvardBusiness.org ، المنتدى الاقتصادي العالمي ، Inside Higher Ed و Lifehacker و MarketWatch و The Independent و Bloomberg TV و PBS Next Avenue و CCTV و CNN's Sanjay Gupta MD. كان جوش متحدثًا متميزًا في مهرجان أسبن للأفكار ، وجامعة ستانفورد ، وقمة الهيمنة العالمية ، وبيونير نيشن ، وميكروكونف ، وباكون بيز ، وجوجل ، وآي بي إم. تم اختيار JoshKaufman.net كأحد \"أفضل 100 موقع لأصحاب المشاريع\" من قبل Forbes في عام 2013. \",",
    "https://drive.google.com/file/d/1FEp7hb2RXL1keS8BX0wFzjLNXSAot-Vo/view?usp=share_link ",
    ",https://youtu.be/-p9ocwd684E"
)

val self_dev4 = FieldModel(
    R.drawable.ph3,
    " اكستاسي ",
    "جرّب أن ترى الحياة من خلال عيونِ شخصٍ محاط بالظلام منذ البداية. فكل يومٌ في كتاب يدور حول المراحل الّتي نمر بها مرّة واحدة على الأقل في حياتنا. إنّها سلسلة الّتي يعبّر عنها الكاتب من خلال الرسوم التوضيحيّة و الفنّية. إنّها للأشخاص الّذين يحبّون السماح لمخيّلتهم أن تنطلق لأبعد الحدود. اكستاسي سوف يُلهِم الناس الّذين عادةً لا يقرؤون الكتب، للبدء بالقراءة.",
    "عبدالهادي العمشان",
    "4.9",
    "50",
    "العربية",
    "70",
    "نشا الكاتب في السعودية وابتعد عن عائلة بحلول العاشرة من عمره  ، وكان لديه شغف للكاتبة  وكان يكتب معظم افكاره ك رسائل الكترونية , وكان الكاتب عبد الهادي العمشان  منبهر جدا باللون الاسود وهو الذي اخذه كليا الي عالم جديد  . ",
    " https://drive.google.com/file/d/1Dz2nnC-GtSpjHO8mqvbpTr9hPq3vaeaJ/view?usp=share_link ",
    " none "
)
val self_dev5 = FieldModel(
    R.drawable.ph8,
    " الرجال من المريخ والنساء من الزهرة ",
    "الرجال من المريخ والنساء من الزهرة كتاب من تأليف الطبيب النفسي الأمريكي جون غراي صدر في مايو 1992 وفيه يتناول المشاكل التي قد تحدث بين الرجل والمرأة نتيجة الاختلافات بينهم. وترجم إلى عدد كبير من اللغات، وبيعت منه ملايين النسخ. يتكون الكتاب من 13 فصلًا كتبت بأسلوب بسيط ومناسب لكافة أنواع القراء. ",
    "جون غراي",
    "4.9",
    "210",
    "العربية",
    "90",
    "جون جراي (بالإنجليزية: John Gray)‏ كاتب ومؤلف أمريكي، ولد في ولاية تكساس الأمريكية سنة 1951م، ويعيش في ولاية كاليفورنيا. ألف سنة 1992م كتابا اشتهر عالميا وطبع منه ملايين النسخ، هو كتاب «الرجال من المريخ، النساء من الزهرة» والذي يعتبر دليلا لفهم الجنس الآخر. تزوج السيدة بوني جراي وأنجب منها بناته الثلاثة: شانون، وجولي، ولورين. ",
    "https://drive.google.com/file/d/1Kj_u5DB_h5OrakEvA1V2vSvZ-zQhKwti/view?usp=share_link ",
    " https://youtu.be/CBk_dfN9e2A"
)
val self_dev6 = FieldModel(
    R.drawable.ph1,
    " العادات السبع للناس الأكثر فعالية ",
    "    \"نشر لأول مرة في عام 1989، وهو كتاب عن الاعتماد على الذات لستيفن كوفي. وقد بيعت أكثر من 15 مليون نسخة ترجمت ل38 لغة منذ أول ما نشر، وتم الاحتفال بالطبعة الخامسة عشر في الذكرى السنوية عام 2004. الكتاب يتعرض لسبع مبادئ، إذا طبقت كعادات فإنها من المفترض أن تساعد الشخص على أن يكون أكثر فعالية.كوفي يؤكد أنه يمكن تحقيق ذلك عن طريق مواءمة النفس إلى ما يسميه \"بالبوصلة الداخلية باتجاه الشمال\" على أساس المبادئ الأساسية للأخلاقيات والطابع حيث أنه يعتقد أنها عالمية وغير محدودة زمنيا. \",\n" +
            "    \"ستيفن كوفي\",\n",
    "ستيفن كوفي",
    "4.7",
    "90",
    "العربية",
    "50",
    "    \"هو كاتب ومؤلف أمريكى ولد فى ولاية يوتاه الأمريكية. ستيفن أب لـ 9 أبناء كما انه جد لـ 49 حفيداً وهو متزوج من امراءة تدعى ( ساندرا ) وكان يعيش فى مدينه بروفو \n" +
            "حصل ستيفن كوفى على جائزة الابوة من منظمه المبادرة الوطنيه للابوة عام 2003 كما حصل على بكالوريوس فى علوم ادارة الاعمال من جامعه يوتاة , كما حصل على شهادة الماجيستير فى ادارة الاعمال من جامعه هارفارد وحصل على الدكتوراة فى التعليم الد ينى من جامعه بيرجهام يانج . وكان مدير مؤسسه فرانكلين كوفى \",   ",
    " https://drive.google.com/file/d/1Ousnk5otm3rw28bftnBeaEkoZwGNMSLT/view?usp=share_link",
    " https://youtu.be/7dl7c9c0xvA "
)
val self_dev7 = FieldModel(
    R.drawable.ph4,
    " فكروازدد ثراء ",
    "    \"كتاب في مجال التوجيه نحو تحقيق الإنجازات الشخصية والاستقلالية المالية وقد كتب في عام 1937 من قبل نابليون هيل وبيعت الخمسة آلاف نسخة الأولى كلها وتم طبع عشرة آلاف نسخة أخرى من الكتاب ونفذت أيضاً من الأسواق في غضون ستة أسابيع فقط.\n" +
            "يقوم كتاب فكر تصبح غنيا بالأساس على كتاب آخر من هذا النوع، وهو قانون النجاح، حيث يٌلخص فيه نابليون تجربة 20 سنة من معاشرة ومحاكاة العديد من الأشخاص المختلفين، فمنهم الأغنياء ومنهم الفقراء، ويحاول معرفة طريقة تفكيرهم وفهمها وما إلى ذلك\",\n",
    "نابليون هيل ",
    "4",
    "100",
    "العربية",
    "80",
    " نابليون هيل ‏ كاتب أمريكي اشتهر بكتبه التي تهتم بالتنمية البشرية ويعرف خصوصاً بكتابه «فكر تصبح غنياً» الذي أصبح عند إصداره من أكثر الكتب مبيعاً وشعبية في أمريكا. وقد ولد في 26 أكتوبر 1883 في باوند، فيرجينيا، الولايات المتحدة وتوفي في 8 نوفمبر 1970 بكارولاينا الجنوبية ",
    "https://drive.google.com/file/d/1RtGbO6s4WAH0t4tAmO5yTFEjPKU8C1EM/view?usp=share_link",
    " https://youtu.be/AhUu1dC8JkE "
)
val self_dev8 = FieldModel(
    R.drawable.ph7,
    " قوة الثقة بالنفس ",
    "ل    \"لابد للإنسان أن يكون في تحرك وتطور مستمرين، وأن يساعد نفسه على اتخاذ القرارات، ولا يقول لم يعد هناك وقت، أو يقول لقد كبرت على أن أحدث تغييراً بحياتي.\n" +
            "ومن أهم جوانب الشخصية التي هي في أمس الحاجة إلى الوقوف معها لاستدراك ما بها من قصور أو خلل الجزء المتعلق بالثقة... ذلك لأن الإنسان إذا افتقد الثقة في نفسه فإنه لن يستطيع أن يحقق أي إنجاز، وسيكون وجوده في الحياة بلا قيمة تذكر... فحول المفهوم الذاتي، والمثل الأعلى، والصورة الذاتية، والتقدير الذاتي، والإنجازات الذاتية وغيرها مما هو وثيق الصلة بالثقة تدور صفحات هذا الكتاب.\",\n",
    " إبراهيم الفقي,",
    "3.9",
    "40",
    "العربية",
    "60",
    "    \" خبير التنمية البشرية والبرمجة اللغوية العصبية ورئيس مجلس إدارة المعهد الكندي للبرمجة اللغوية ومؤسس ورئيس مجلس إدارة مجموعة شركات إبراهيم الفقي العالمية، وهو حاصل على درجة الدكتوراه في علم الميتافيزيقا من جامعة ميتافيزيقا بلوس انجلوس بالولايات المتحدة الامريكية , ومؤلف علم ديناميكية التكيف العصبي وعلم قوة الطاقة البشرية، ويحمل الفقي الجنسية المصرية ويقيم في القاهرة وكندا. \",",
    " https://drive.google.com/file/d/1CMPgHQnMyVvbsL8kaciDuYnFBCzRLqV5/view?usp=share_link ",
    " https://youtu.be/zzibrNKEwMw "
)
val self_dev9 = FieldModel(
    R.drawable.ph6,
    " كيف تؤثر في الاخرين وتكسب الأصدقاء ",
    " \"هذا الكتاب هو الأول ولا يزال الأفضل من نوعه. فقد بيعت من هذا العمل الرائد الذي قدمه \"ديل كارنيجى\"، والذي يعد أشهر الكتب التحفيزية، ملايين النسخ، كما ترجم لكل اللغات المكتوبة المعروفة تقريبا، كما ساعد عددا لا حصر له من الأشخاص على النجاح في كل من حياتهم المهنية والخاصة. إن المبادئ الأساسية الواردة في هذا الكتاب والتي كتبت لأول مرة باعتبارها مذكرة عمل تطبيقية في مجال العلاقات الإنسانية برهنت على فاعليتها.\",",
    "ديل كارنيجي",
    "3",
    "90",
    "العربية",
    "60",
    "  ولد الكاتب ديل كارنيجي 1888 - 1955 م في مدينة ماريفال من ولاية ميزوري وسط الولايات المتحدة الإمريكية لعائلة فقيرة، وقد التحق في شبابه بكلية وارنسبرج للمعلمين، ثم عمل كمندوب مبيعات لدى شركة آرمو، ثم انتقل لتعليم رجال الأعمال فن الخطابة، وألف العديد من الكتب في مجال التنمية البشرية وتطوير الذات، وقد تميزت كتب ديل كارنيجي بأسلوب مبسّط مع أمثلة توضيحية واقعية. ",
    "https://drive.google.com/file/d/1z6tuQRhKiFxHXGCehcx_6p6gXCFABN-H/view?usp=share_link",
    " https://youtu.be/pUexc4xV_mw"
)
val self_dev10 = FieldModel(
    R.drawable.ph10,
    " مدير الدقيقة الواحدة ",
    " متى كانت آخر مرة اكتشف أحدهم أنك فعلت شيئاً صحيحاً؟ متى كانت آخر مرة شعرت فيها أنك مسيطر تماماً على منزلك؟ أو عملك؟ أو عائلتك؟ أو حياتك؟ هذا هو الكتاب الذي علم الملايين أسرار سهلة: تبسط حياتك تجعلك تعمل الكثير في وقت قليل تقلل التوتر وتساعدك على الحصول على راحة البال. يمكنك أن تغير حياتك بصورة دراماتيكية مع كتاب (مدير الدقيقة الواحدة). إنه سريع، سهل، ومفيد.",
    " سبنسر جونسون ",
    "4.1",
    "40",
    "العربية",
    "43",
    " يعد أحد أنجح المؤلفين التنمويين الممتعين في العالم حاليًا. وكتبه تصدرت الكثير من قوائم الأفضل مبيعًا على جريدة نيويورك تايمز الأمريكية. كتابه ( من حرك قطعة الخبز الخاصة بي؟ ) يعد أحد أكثر الكتب مبيعًا ونجاحًا على الإطلاق، ويوجد له الآن أكثر من 30 مليون نسخة لكتبه المختلفة المترجمة إلى ما يقرب من 25 لغة حتى الآن. تخرج من جامعة جنوب كاليفورنيا ي تخصص علم النفس عام 1961",
    " https://drive.google.com/file/d/1JssUjFuHMjh3S_pYBHhFrFzjSI3gLvcj/view?usp=share_link",
    " https://youtu.be/wA9QUHG3f8Y"
)
//////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////novels////////////////////////////////////////////////////
val novel1 = FieldModel(
    R.drawable.nov3,
    "الهالة المقدسة",
    "تعتبر رواية الهالة المقدسة للأستاذة حنان لاشين رحلة إلى كوكب البلاغة، كوكب نسجته الكاتبة من أحبال أفكارها وخيالاتها. تأوي إليه في لحظات ضعفك واحتياجك للعون. لا تتعجب إذا فاجئك شعور الخوف والقلق، فهذا طبيعي جدًا عندما تواجه مشاكلك متأخرًا، ولكن تذكر: أن تأتي متأخرًا خيرًا من ألا تأتي.\",",
    " حنان لاسين",
    "4.2",
    "50",
    "العربية",
    "45",
    "تعتبر هذه الرواية للكاتبة العريقة حنان لاشين إستكمال لرحلتها في ربط عقل القارئ الكريم بقلبه، عن طريق خلق رابط معنوي فريد بينه وبين شخصيات الرواية. حتى يشعر الكاتب أنه منغمس إنغماس شديد في أحداثها ولا يمكنه الخروج منها وفي نفس الوقت لا يشعر بالملل مطلقًا..",
    "https://drive.google.com/file/d/15-cxR8qMV3o0DJwlYugTeT4bswNi0WEv/view?usp=drivesdk",
    "https://youtu.be/D6RVeNLqMfQ"
)

val novel2 = FieldModel(
    R.drawable.nov8,
    " امانوس",
    "تدور أحداث رواية أمانوس حول عائلة تسكن في محافظة الفيوم في مصر، تُسمى هذه العائلة بعائلة أبادول، ويحكي كل فرد من أفراد هذه العائلة قصته الخاصة به، وكيف عاش محاربًا شجاعًا حتى ينصر الحق، وينتصر على الشر، وقد روى كل واحد قصته، حتى يتعلم أفراد العائلة الصغار من مغامراته، وتجاربهم، وتجارب من قبلهم.[١] اختار حمزة كتاب أوري، وبعدها فتح ممرس أمانوس، أما خالد كانت مهمته أصعب، وهي إعادة حمزة، واسترداد كلمات الكتاب، وتدور كل هذه الأحداث التي نسجتها الكاتبة من خيالها حول هذه العائلة، لتضم الرواية العديد من القصص القصيرة، التي تروي قصص الأفراد بأسلوب سهل وسلس للغاية..\",",
    " حنان لاسين",
    "4.1",
    "55",
    "العربية",
    "50",
    "تعتبر هذه الرواية للكاتبة العريقة حنان لاشين إستكمال لرحلتها في ربط عقل القارئ الكريم بقلبه، عن طريق خلق رابط معنوي فريد بينه وبين شخصيات الرواية. حتى يشعر الكاتب أنه منغمس إنغماس شديد في أحداثها ولا يمكنه الخروج منها وفي نفس الوقت لا يشعر بالملل مطلقًا..",
    " https://drive.google.com/file/d/14t3BrPWzv3CVj0dX3VYG9WyWsl5mBeLA/view?usp=drivesdk",
    " https://youtu.be/2O3brPFzJ8o"
)
val novel3 = FieldModel(
    R.drawable.nov5,
    " كويكول",
    " تعتبر رواية كويكول للأستاذة حنان لاشين رحلة إلى كوكب البلاغة، كوكب نسجته الكاتبة من أحبال أفكارها وخيالاتها. تأوي إليه في لحظات ضعفك واحتياجك للعون. لا تتعجب إذا فاجئك شعور الخوف والقلق، فهذا طبيعي جدًا عندما تواجه مشاكلك متأخرًا، ولكن تذكر: أن تأتي متأخرًا خيرًا من ألا تأتي...",
    " حنان لاسين",
    "4.1",
    "55",
    "العربية",
    "50",
    " عضور هيئة إتحاد كتّاب مصر، ولها العديد من المؤلفات: مقالات وكتب في مجالات مختلفة ومتنوعة. منها السياسي ومنها الإجتماعي. كان جزء من شهرة حنان لاشين هو مجرد كونها إمرأة، فالنساء يفرحن ويُنجحن ويساعدن أي إمرأة ويقدموا لها الدعم الكافي للبقاء والإستمرار",
    " https://drive.google.com/file/d/14t3BrPWzv3CVj0dX3VYG9WyWsl5mBeLA/view?usp=drivesdk",
    " https://youtu.be/v4w7D7rNjqU"
)
val novel4 = FieldModel(
    R.drawable.nov2,
    " طريق جهنم",
    " تتقسم رواية طريق جهنم بينَ بطلَين، البطل الطّاغية الّذي يتكلّم بلسانه وهو القذافي، و البطل السّجين الّذي يروي مشاهداته خلال ثلاثين عامًا قضاها في التعذيب الّتي لا يُمكن أنْ يتخيّلها بشريّ، ويقول الكاتب في كلمة الغلاف الخلفي: الأمل ليس وَهمًا كما يعتقد اليائس، الأمل حالة؛ انظر حولكَ وستجدُ كلّ شيْءٍ يحتفي بالأمل، كلّ شيْءٍ يتحوّل إليه، كلّ شيءٍ يُريد أن يكونه.. ",
    " ايمن العتوم ",
    "3.9",
    "50",
    "العربية",
    "55",
    "\n" +
            "أتم أيمن دراسته الثانوية في إمارة عجمان التابعة لدولة الإمارات العربية المتحدة، ثم عاد للأردن بعد ذلك ليبدأ بدراسة تخصص الهندسة المدنية في جامعة العلوم والتكنولوجيا، ومن هناك حصل العتوم على درجة البكالوريوس في الهندسة المدنية وذلك عام 1997 \",\n",
    " https://drive.google.com/file/d/15-gdIcU-aRKrk1itblt8cpKG2ymKZQzF/view?usp=drivesdk ",
    " https://youtu.be/rdrli3SVdUA "
)
val novel5 = FieldModel(
    R.drawable.nov9,
    " السكريه",
    "يبدأ هذا الجزء بداية حزينة كالنهاية التي انتهى بها سابقه. إذ يتّضح أن الفترة الفاصلة بين نهاية رواية قصر الشوق وبداية هذه شهدت وفاة ابني عائشة (محمد وعثمان) وزوجها متأثرين بمرض حمى التيفوئيد، وتتبدل إذ ذلك حال عائشة، التي كانت آية في الحسن والجمال، فتغدو امرأة يائسة تُدخِّن وتشرب القهوة طوال اليوم، ولم تبق لها سوى ابنتها نعيمة ذات الستة عشر عاماً. وفي هذا الجزء يتبدل الأبطال، حيث يتبوأ أطفال الجزء الماضي مكان الصدارة في هذا الجزء كشبان نضجوا وأصبحت لكل منهم أهواؤه ومشاربه.\",\n" +
            "    \"  نجيب محفوظ \",\n",
    "  نجيب محفوظ ",
    "3.8",
    "60",
    "العربية",
    "100",
    "هي رواية من تأليف الكاتب المصري نجيب محفوظ، وهي الجزء الثالث من ثلاثية نجيب محفوظ التي حصل على إثرها على جائزة نوبل في الأدب عام 1988م. السكرية هو اسم حي في القاهرة، وهو الحي الذي تدور فيه معظم أحداث الرواية، وتبدأ أحداث هذا الجزء بعد نهاية أحداث الجزء السابق بثمانية أعوام كاملة أي في عام 1934، وتنتهي في عام 1943 \",",
    " https://drive.google.com/file/d/14fXgBuuGTpMefHz-1AvpCr1FPyRCzsV0/view?usp=drivesdk ",
    " https://youtu.be/ETOLPs8ulAI "
)
val novel6 = FieldModel(
    R.drawable.nov7,
    " ماسة وشيطان",
    "أنا ماسة لا أدري في الواقع من اختار لي هذا الاسم من الطبيعي أن يسمي الطفل والداه لكن اللقيط من يسميه؟!! نعم... وجدتني رحمة مجرد قطعة لحم حمراء كما يقولون، ملقاة جوار مسجد في حارتنا الصغيرة فاعتبرتني هدية القدر لها بعدما فرّ زوجها هاربًا بابنها الوحيد مع زوجته الثانية إلى بلد عربي.\",.",
    "   نرمين نحمد الله",
    "3.7",
    "65",
    "العربية",
    "100",
    "كاتبة وطبيبة صيدلانية مصرية, مواليد 1982. نُشر لها عدة روايات إلكترونية أبرزها \"ماسة وشيطان\", \"جارية في ثياب ملكية\", \"قيود ناعمة\", \"عانقت الشمس \",",
    " https://drive.google.com/file/d/14_JwnuPOTP7KXY3jVwqo-LUHLezhaZ3I/view?usp=drivesdk ",
    " https://youtu.be/ROZfCvyXFtQ"
)
val novel7 = FieldModel(
    R.drawable.nove4,
    " أن تبقى",
    "    \n" +
            "رأيإنهم لا يسمحون للإنسان بأي شكل بأن يكون نفسه…\n" +
            "يكتب أورهان باموق مُتذكرًا في إحدى المرات أنه وجد صوته السردي المُميز أثناء تأليفه هذه الرواية، والتي ترجمها للعربية: الأستاذ عبد القادر عبد اللي، المُترجم السوري الذي تَرجم له أيضًا أشهر رواياته مثل «اسمي أحمر» و«ثلج» و«مُتحف البراءة»..\",\n.",
    "خولة حمدي",
    "3.6",
    "70",
    "العربية",
    "120",
    "    \"\n" +
            "ولد باموق عام 1952 لعائلة تُركية عَلمانية من الطبقة المتوسطة ميسورة الحال، ويقول إن جده جَنى أموالاً طائلة في حياته، بددها الأبناء والأحفاد في مشاريع تجارية فاشلة وفي قاعات محاكم قضائية بسبب خلافات أُسرية على تقسيم التَرٍكة. واستغل باموق المكتبة التي احتفظ أبوه بها، في تزجية وقته بالقراءة. لكنه لم يكن ينوي أن يصير روائيًا، فقد ظل منذ طفولته إلى سن الثانية والعشرين يحلم بأن يصير مُهندسا معماريًا، وبالفعل درس في الجامعة التقنية بإسطنبول، على أمل أن يصير مثل مُعظم أفراد عائلته. لكنه قرر في السنة الثالثة من دخولها أن يترك كل شيء وراءه، وأن يتخلى عن ذاته التي خلقها من أجل ارضاء الآخرين. وبمجرد أن أعلن لهم أنه كاتب، حبس نفسه في غرفته لكتابة الروايات. ولينشر أول رواية له عام 1983 بعنوان «جودت بيه وأبناؤه» التي فاز عنها بجائزة أورهان كمال للرواي، وهي تحكي قصة عائلة برجوازية تركية تفقد ثروتها \",\n",
    " https://drive.google.com/file/d/14Z7Sf41B0IzM28z7TyDYh-TCXoqWNdoH/view?usp=drivesdk ",
    " https://youtu.be/aU2DY9OQ3oc"
)
val novel8 = FieldModel(
    R.drawable.nov10,
    " هو وهى",
    "\". \n" +
            "تدور أحداث رواية \"هو وهي\" للكاتب مارك ليفي حول ممثلة شهيرة أمريكية قادمة إلى باريس لتستقر في مونتمارتر تدعى (ميا)، و(بول) الكاتب الأمريكي الذي يعيش في ماريه، وعن لقاءهما في باريس، فتقع ميا في حب بول، مع أنها تعهدت لنفسها مسبقاً بأن لا تعيش الحب، لكنها تبدأ في عيشه حرفياً مع الكاتب.\n" +
            "كانت (ميا) في حياتها الواقعية متعبة وبحاجة لأن تستريح، بسبب اكتشافها أن زوجها الممثل النجم وشريكها في بطولة فيلمها الأخير اللذان قدماه معاً، ليس مخلصاً لها، مما يدفع ذلك (ميا) أن تذهب لباريس وتختبأ هناك، فتغير من تسريحة شعرها لتسريحة أخرى، وتتجه للعمل كنادلة في مطعمٍ لصديقة لها\",\n",
    "  مارك ليفي",
    "3.5",
    "75",
    "العربية",
    "100",
    "مارك لوفي هو روائي فرنسي. ولد لوفي في بولون-بيانكور، هوت دو سين. بعمر 18 سنة، التحق بالصليب الأحمر الفرنسي حيث صرف ستة سنوات. بالتوازي، درس الإدارة و الحواسيب في جامعة باريس- دوفين. في عام 1983، أنشئ شركة متخصصة في رسومات الحاسوب في فرنسا و الولايات المتحدة الأمريكية. \",",
    " https://drive.google.com/file/d/14FokFY2bI8oCoiovK9ZI7zkXChwcoUec/view?usp=drivesdk",
    " https://youtu.be/Ew1duaHPVoc"
)
val novel9 = FieldModel(
    R.drawable.nov6,
    " زوربا اليونانى",
    "\" رواية زوربا اليوناني للكاتب نيكوس كازانتزاكيس صدرت عام 1946 . هي رواية تدور أحداثها عن قصة رجل مثقف، اسمه باسيل، غارق في الكتب، يلتقي مصادفة برجل أميّ مدرسته الوحيدة هي الحياة وتجاربه فيها، وسرعان ما تنشأ صداقة بين الرجلين ويتعلم فيها المثقف باسيل الذي ورث مالا من أبيه الكثير من زوربا عن الحياة وعن حبها وفن عيشها. أنتجت هوليوود فيلما شهيرا أيضا مقتسبا من الرواية يحمل نفس العنوان وقام ببطولته الممثل \"أنتوني كوين وحقق الفيلم شهرة كبيرة",
    " نيكوس كازانتزاكيس",
    "3.4",
    "80",
    "العربية",
    "90",
    " (باليونانية: ، كاتب وفيلسوف يوناني، ولد (18 فبراير – 1883) – توفى (26 أكتوبر – 1957)، اشتهر بروايته «زوربا اليوناني» التي تعتبر أعظم ما أبدع، اشتهر عالميا بعد عام 1964 حيث أنتج فيلم «زوربا اليوناني» للمخرج مايكل كاكويانيس والمأخوذ عن روايته.. وتجددت شهرته عام 1988 حيث أنتج فيلم «الإغواء الأخر للمسيح» للمخرج مارتن سكورسيس وهو مأخوذ عن رواية لكازنتزاكيس أيضا \", ",
    " https://drive.google.com/file/d/14-2OKYqNZhjJW_TPl2peCb_v7GGmOjeO/view?usp=drivesdk",
    " https://youtu.be/z7_aifWC05c"
)
val novel10 = FieldModel(
    R.drawable.nov4,
    " فى قلبى انثى عبريه",
    " في قلبي أنثي عبرية[1] رواية للكاتبة التونسية خولة حمدي تحكي فيها الكاتبة كيف تعرفت على بطلة القصة ندى التي كانت تحكي قصتها على إحدى المواقع الالكترونية واستطاعت التواصل معها لمعرفة المزيد من التفاصيل وتعرفت الكاتبة من خلال قصة الحب التي نشأت بين بطلة القصة وأحد أبطال المقاومة في ذلك الحين على مجتمع ما يسمى بيهود العرب والمقاومة في لبنان.[2\", ",
    " خولة حمدي ",
    "3.3",
    "88",
    "العربية",
    "90",
    "\" خولة حمدي كاتبة تونسية، وأستاذة جامعية في تقنية المعلومات بجامعة الملك سعود بالرياض.\n" +
            "روايتها الأولى هي \"في قلبي أنثى عبرية\"، ثم بعد ذلك صدور الرواية الثانية لها سنة 2012 تحمل عنوان في قلبي أنثى عبرية\" وهي مستوحاة من قصة حقيقية ليهودية تونسية (ندى) دخلت الإسلام بعد تأثرها بشخصية طفلة (ريما) مسلمة يتيمة الأبوين صمدت في وجه الحياة بشجاعة، وبشخصية شاب لبناني (أحمد) مقاوم ترك بصمة في حياتها\",\n",
    " https://drive.google.com/file/d/13vla853etVxTOJasK5epQdb_Kpl6Asly/view?usp=drivesdk ",
    " https://youtu.be/mqC64iD074s "
)

///////////////////////////////////////////////Law///////////////////////////////////////////////
val low1 = FieldModel(
    R.drawable.lo4,
    " قواعد القانون الدولى ةالانسانى والتعامل الدولى",
    "\" ينشأ القانون الدولي الإنساني من فراغ بل هو إفراز لمجموعة من القيم والمبادئ الأخلاقية التي تدعو في الإطار العام إلى نبذ الحروب بين الدول والشعوب والرجوع إلى الحل السلمي للمشكلات التي تنشأ بين الدول، وإذا ما وقعت الحرب فإنَّ ثمة اعتبارات ذات طابع إنساني يجب إعمالها. إنَّ المجتمع الدولي المعاصر في ظل ميثاق الأمم المتحدة قد أصبح يقوم على مبدأ أساسي هو تحريم استخدام القوة أو التهديد بها في العلاقات الدولية ولكن الواقع الدولي يكشف عن تزايد المنازعات المسلحة في أرجاء متعددة من العالم وهذا يتطلّب العمل على تطوير  \",",
    " د.كامران الصالحى ",
    "3.1",
    "80",
    "العربية",
    "90",
    "    \" \n" +
            "له مجموعة من المؤلفات أبرزها ❞ قواعد القانون الدولي الانساني والتعامل الدولي ❝ الناشرين : ❞ مؤسسة بحوث والنشر موكريان\",\n",
    " https://drive.google.com/file/d/17i8T5Tij1UV0tgwpqIcgcGY-jDeGlSms/view?usp=drivesdk",
    "https://www.youtube.com/watch?v=hjV9Vsf53Og"
)
val low2 = FieldModel(
    R.drawable.lo5,
    " القانون الحنائى الدولى",
    " حاول فيه مؤلفه الطالب بكلية الحقوق تسليط الضوء على تعريف القانون الجنائي الدولي وبيان مصادره، كما تطرق فيه الى المسؤولية الجنائية الدولية والجرائم الدولية ونظام تسليم المجرمين، بالاضافة الى موضوع القضاء الجنائي الدولي وذلك في خمسة فصول متتابعة، بالاضافة الى مقدمة قال فيها المؤلف الشاب انه على مدى طويل تعاونت مجموعة من فقهاء القانون لوضع تقسيم واضح يبين من خلاله افرع القانون المختلفة، كانت البداية من نصيب الفقهاء التقليديين الذين قسموا القانون الى قسم خاص وآخر عام. اما الفقهاء الحديثون فقد قسموا القانون الى قانون داخلي وآخر دولي، ومن الاخير افرزوا القانون الجنائي الدولي، القانون الذي شطر الفقهاء الى شطرين، شطر يسميه القانون الدولي الجنائي وآخر يسميه القانون الجنائي الدولي  ",
    "  خالد طعمه ",
    "3.0",
    "70",
    "العربية",
    "95",
    "هو صحافي فلسطيني إسرائيلي، ولد في مدينة طولكرم الفلسطينية، وهو محاضر ومخرج أفلام وثائقية، ومراسل لصحيفة «ذا جيروزاليم بوست»، وكاتب في إصدارات معهد غاتستون في نيويورك. يعمل أبو طعمة منتجًا ومستشارًا إعلاميًّا لهيئة الإذاعة الوطنية (NBC news) منذ العام 1989، كما أنتج العديد من الأفلام الوثائقية عن الفلسطينيين لقناة بي بي سي والتلفزيون الأسترالي والسويدي والدنمركي، وتظهر مقالاته في العديد من الصحف حول العالم.\",",
    " https://drive.google.com/file/d/17ivFTTCbyLXAX2UK3tCESf5zk1oLDL2G/view?usp=drivesdk",
    "https://www.youtube.com/watch?v=02aOKDvcIAk "
)
val low3 = FieldModel(
    R.drawable.lo7,
    "  الوجيز فى الاجراءت الجنائية ",
    " حاول فيه مؤلفه الطالب بكلية الحقوق تسليط الضوء على تعريف القانون الجنائي الدولي وبيان مصادره، كما تطرق فيه الى المسؤولية الجنائية الدولية والجرائم الدولية ونظام تسليم المجرمين، بالاضافة الى موضوع القضاء الجنائي الدولي وذلك في خمسة فصول متتابعة، بالاضافة الى مقدمة قال فيها المؤلف الشاب انه على مدى طويل تعاونت مجموعة من فقهاء القانون لوضع تقسيم واضح يبين من خلاله افرع القانون المختلفة، كانت البداية من نصيب الفقهاء التقليديين الذين قسموا القانون الى قسم خاص وآخر عام. اما الفقهاء الحديثون فقد قسموا القانون الى قانون داخلي وآخر دولي، ومن الاخير افرزوا القانون الجنائي الدولي، القانون الذي شطر الفقهاء الى شطرين، شطر يسميه القانون الدولي الجنائي وآخر يسميه القانون الجنائي الدولي  ",
    "احمد مجدى ",
    "2.9",
    "70",
    "العربية",
    "65",
    " احمد مجدىخريج الجامعة الألمانية بالقاهرة، بدأ العمل كمؤلف سينمائي في ٢٠١٤ بفيلمه الاول أوشن ١٤ ثم فيلم مش رايحين في داهية ونص جوازة.",
    "https://drive.google.com/file/d/17mKFa6uV5CLz3znEALjepgM4Pe_NIxBG/view?usp=drivesdk",
    " https://www.youtube.com/watch?v=gv8AuZAe_r4&list=PLw5uvKng8pFUYRW9JmKODtoRuAYqh1WZj"
)
val low4 = FieldModel(
    R.drawable.lo8,
    "  لمدخل الى دراسة الانظمة السعودية ",
    " لقانون أو النظام يقصد به لغوياً مجموع القواعد المنظمة لأمر ما. لذلك يظهر في أصل كلمة قانون معنى الاستقامة والجمع والإلزام، وعليه؛ فيمكن استخدام كلمة قانون في العديد من العلوم النظرية والتطبيقية. فيكون القانون ملزماً علمياً عند استعماله في العلوم التطبيقية، أو اجتماعياً في العلوم\n" +
            "الاجتماعية أو بقوة السلطة في العلوم السياسية والقانونية \n ",
    " أيمن سعيد ",
    "2.5",
    "50",
    "العربية",
    "85",
    "    أيمن سعيد\n" +
            " هو الشيخ أيمن أحمد أحمد سعيد ولد في مدينة بنغازى بليبيا في 6/ 10/ 1964 م السادس من شهر أكتوبر عام أربعة وستين وتسعمائة وألف من الميلادة.\",\n",
    " https://drive.google.com/file/d/17klVdTbvGs6BMxPFCwE-LyxR0QKiIcw-/view?usp=drivesdk",
    " https://www.youtube.com/watch?v=7O2ut9c_76M"
)
val low5 = FieldModel(
    R.drawable.lo2,
    "  خربشات خارجة عن القانون ",
    "\n" +
            "كتاب \"خربشات خارجة عن القانون\" عبارة عن نصوص يغلب عليها الطابع الساخر، الذي يعبر عن الواقع المؤلم، فتضحك والألم يعتصرك من الداخل على الواقع المرير الذي نعيشه.. أكثر من 150 خربشة أو قصاصة صغيرة كتبها \"أدهم شرقاوي\" أو \"قس بن ساعدة\" عن مواضيع منوعة، أغلبها يهمك، وبعضها قد لا يعجبك؛ ولكن معظمها يلامس \",\n",
    " أدهم شرقاوي ",
    "2.8",
    "60",
    "العربية",
    "85",
    "كاتب فلسطيني ولد ونشأ في مدينة صور اللبنانية حاصل على دبلوم تربية رياضية من كلية التربية وإجازة وماجستير في الأدب العربي من الجامعة اللبنانية في بيروت. عمل في صحيفة الوطن القطرية بدأ بالكتابة عبر منصة منتدى الساخر ثم أصدر أول كتاب له عام 2012 بعنوان أحاديث الصباح، ينشر مؤلفاته تحت اسم مستعار «قس بن ساعدة». متزوج وله من الأبناء ولد وثلاثة بنات.\",",
    " https://drive.google.com/file/d/17mpGbiTpDaKnNp5qbQXc0DSRZ8tERqTm/view?usp=drivesdk",
    " https://www.youtube.com/watch?v=oeYVYr3SoRo "
)
val low6 = FieldModel(
    R.drawable.lo1,
    "  رسالة المحاماة ",
    "المحاماة صوت الحق في هذه الأمة، وفي كل أمة .. هي رسالة ينهض بها المحامون فرسان الحق والكلمة ، يخوضون فيها الغمار ويسبحون ضد التيار ! .. يحملون راية العدل في صدق وأمانة وذمة ووقار .. يناصرون الحق ، ويدرأون الظلم .. يناضل المحامي في القيام بأمانته نضالاً قد تتعرض فيه مصالحه وحريته للخطر وربما حياته نفسها \",",
    " محمد رجائي عطية عبده ",
    "2.7",
    "80",
    "العربية",
    "45",
    "محمد رجائي عطية عبده (6 أغسطس 1938 بشبين الكوم في محافظة المنوفية - 26 مارس 2022) محام مصري ترأس منذ 15 مارس 2020 نقابة المحامين المصرية خلفًا لسامح عاشور. وهو نجل المحامي عطية عبده. توفي عقب تواجده في قاعة محكمة إمبابة للدفاع عن 9 محامين آخرين بتهم تعود لعام 2015، ومنعت الجهات الأمنية المصرية إقامة عزائه\".\",",
    " https://drive.google.com/file/d/17v4wFsmD-kPusVVuUQEHQ7HybZ-bm1Aq/view?usp=drivesdk",
    " https://www.youtube.com/watch?v=_9iI3xVWVd0 "
)
val low7 = FieldModel(
    R.drawable.lo10,
    "  شرح قانون العقوبات ",
    "ويدور هذا الكتاب حول جانب مهم وهو كيفية إعداد البحث القانوني، وما هي منهجيته وأدواته. ويضم الكتاب عددا من الموضوعات الهامة؛ حيث يتطرق إلى تعريف البحث العلمي، وأنواعه وخصائصة وكذلك أهميته. كما يتناول أدوات البحث القانوني مثل الملاحظة والاستبانة، وكذلك تحليل القوانين والأحكام القضائية. كما يتطرق الكتاب لأهم مناهج البحث في العلوم القانونية وكذلك عملية توثيق المراجع داخل المتن أو في قائمة المراجع النهائية \",",
    " علي عبد القادر ",
    "2.7",
    "80",
    "العربية",
    "45",
    "ولد عبد السلام في محافظة جهانج التي تقع على مقربة من لاهور بالبنجاب والتي كانت في ذلك الوقت جزءاً من الهند، والده كان رجلاً بسيطاً يعمل كاتباً في مكتب مفتش المدارس إلا أنه كان حريصا كل الحرص على تعليم أبنائه منذ الصغر، فتنقل محمد في مراحل التعليم حتى وصل إلى سن الرابعة عشرة حيث التحق بالجامعة الحكومية في «لاهور»، وظهر نبوغه المبكر في الرياضيات محطماً كل الأرقام القياسية في امتحانات القبول، وحاصدا لجوائز التفوق في جميع مراحل التعليم، تخرج في الجامعة عام 1944، وحصل على درجة الماجستير في الرياضيات من جامعة «لاهور» بالبنجاب بعد سنتين في عام 1946.\",",
    " https://drive.google.com/file/d/17wZZFgODJgEWSoG5-0m5n0Oc9y8gqymh/view?usp=drivesdk",
    " none"
)
val low8 = FieldModel(
    R.drawable.lo9,
    "  احكام الحضانة فى القوانين العربية والاجنبية ",
    "هذا كتاب بذل فيه مؤلفه من الجهد ما لا يبذل مثله إلا الأقلون الذين يمكن إحصاؤهم في هذه الأيام التي انتشر فيها الكسل العقلي، وعم فيها إيشار الراحة والعافية على الجد والمشقة والعناء، والذين يقرؤون هذا الكتاب قراءة المتدبر المتأني سيلاحظون مقدار ذلك الجهد الكبير الذي مكن المؤلف من أن يصبر نفسه الستين الطوال على قراءة طائفة ضخمة من الكتب القانونية والأسانيد من مبادئ وقواعد قضائية \",",
    " احمد امين",
    "2.3",
    "90",
    "العربية",
    "75",
    "احمد امين\n" +
            " سالم الرجوب الذي يكون أكبر شبكت مافيا في دورا والذي كان اكبر تاجر سلاح في عمر ١٤سنة ولد في.,\n",
    " https://drive.google.com/file/d/17SzURYqPYmFKVsaf92VPYfQCyjlKEnNr/view?usp=drivesdk",
    " none"
)
val low9 = FieldModel(
    R.drawable.lo3,
    " القانون التجارى",
    "لقانون التجاري هو فرع من فروع القانون الخاص عرفته مدونة التجارة المغربية في المادة 1 على أنه ينظم القواعد المتعلقة بالأعمال التجارية و النجار \" بمعنى أنه ينظم الأعمال التجارية التي تنشأ سواء التكير فيما بينهم أو بين التجار و زيناتهم ، وبهذا يكون ميثاقه أصبق من القانون المدني الذي يضم القواعد العامة التي تحكم العلاقات بين الأفراد بعض النظر عن طبيعة الأعمال التي يقومون بها \",",
    " احمد امين",
    "2.2",
    "40",
    "العربية",
    "75",
    "احمد امين\n" +
            " سالم الرجوب الذي يكون أكبر شبكت مافيا في دورا والذي كان اكبر تاجر سلاح في عمر ١٤سنة ولد في.,\n",
    " https://drive.google.com/file/d/187yrVELmqZ4UuNr7YIzTZsyS0hrrmCBp/view?usp=drivesdk",
    " none"
)
val low10 = FieldModel(
    R.drawable.lo6,
    " الوسيط فى شرح القانون",
    "موسوعة الوسيط في شرح القانون المدني لعملاق القانون الدكتور عبد الرازق السنهوري ,الموسوعه تعتبر مرجع ثمين للباحثين في المجال القانوني باحتوائها علي شروحات تفضيليه لكافة مواضيع القانون المدني , موسوعه الوسيط في شرح القانون المدني تتألف من عشرة اجزاء مقسمة الي اثني عشرا كتابا وهي مصادر الالتزام واثار الالتزام ونظرية الالتزام بوجة عام والعقود التي ترد علي الملكية والعقود الواردة علي الانتفاع بالشئ والعقود الواردة علي العمل وعقود الغرر واسباب كسب الملكية \",",
    " عبد الرازق السنهوري",
    "2.1",
    "66",
    "العربية",
    "70",
    "عبد الرزاق السنهوري (1895م - 1971م) أحد أعلام الفقه والقانون في الوطن العربي ولد في 11 اغسطس 1895 بالإسكندرية وحصل على الشهادة الثانوية عام 1913 ثم التحق بمدرسة الحقوق بالقاهرة حيث حصل على الليسانس عام 1917م وتأثر بفكر ثورة 1919م وكان وكيلاً للنائب العام عام 1920 ثم سافر فرنسا للحصول على الدكتوراه والعودة سنة 1926م ليعمل مدرساً للقانون المدني بالكلية ثم انتخب عميداً لها عام 1936م..\",",
    " https://drive.google.com/file/d/18B7ZiUyYf64Vpft_wvuGpb-CuaotOQpR/view?usp=drivesdk",
    " https://www.youtube.com/watch?v=1QGmPwT53-o"
)


///////////////////////////////////////////////////////////////////////////////////////////////
val doctrine1 = FieldModel(
    R.drawable.fqh3,
    " احكام العبادات ",
    "هذا كتاب في أحكام العبادات، أعدت لطالبها، ولمن يرغب الازدياد في المعرفة، أعدت بصورة مبسطة من جانب، ومن جانب آخر أتت متناسبة مع ما ينبغي أن يصل إليه الطالب من المعرفة لهذه الأحكام ونحوها. ",
    "عاشور بريك الدمنهوري",
    "4.7",
    "290",
    "العربية",
    "50",
    " ولد في مدينة درنة سنة 1944م، من أسرة متوسطة الحال، كان والده قد مارس حرفة الحلاقة، وكذلك الزراعة وتربية المواشي، وانتقلت مع أسرته الي مدينة طبرق سنة 1951م. وكانت له رغبة ملحة في حفظ وتجويد القران الكريم بعد انتقاله الي مدينة طبرق، وقد يسر له الله ذلك حيث تمكنت من حفظ الاجزاء الثلاثة من القران الكريم في مدرسة طبرق القرانية وعلى يد الفقيه “محمد ادهيميش” والفقيه “عبدالرسول المهدي”، وتعلم أحكام التلاوة والتجويد على يد الفقيه “عبدالرحمن الفاسي” .",
    " https://drive.google.com/file/d/1QdaMSvOty386y-jZ36dj1pgXrzJpXbsn/view?usp=share_link ",
    " none"
)
val doctrine2 = FieldModel(
    R.drawable.fqh4,
    " الأصول من علم الأصول ",
    "الأصول من علم الأصول : رسالة مختصرة في أصول الفقه للشيخ ابن عثيمين - رحمه الله - تميزت بدقة العبارة وتحريرها مع سهولتها ووضوحها، مع كثرة الأمثلة الفقهية. ",
    "العثيمين محمد بن صالح",
    "4.0",
    "190",
    "العربية",
    "500",
    " عالم فقيه ومفسّر، إمام وخطيب وأستاذ جامعي، عضو في هيئة كبار العلماء ومدّرس  للعلوم الشرعية وداعية سعودي من مواليد عنيزة  في منطقة القصيم وقرأ القرآن الكريم على جده من جهة أمه عبد الرحمن بن سليمان الدامغ؛ فحفظه ثم اتجه إلى طلب العلم وتعلم الخط والحساب وبعض فنون الآداب",
    " https://drive.google.com/file/d/1y97c_QjekhGj_OYYM1oH7qKyzwkdduSu/view?usp=share_link ",
    " none"
)

val doctrine3 = FieldModel(
    R.drawable.fqh1,
    " الفقه الاسلامي وادلته  ",
    "في هذا الكتاب التأصيلي الضخم يفتتح الدكتور وهبة الزحيلي الجزء الأول بالحديث عن معنى الفقه وخصائصه ويعطينا لمحة موجزة عن فقهاء المذاهب، ويعرفنا مراتب الفقهاء وكتب الفقه وسبب اختلاف الفقهاء، ثم ينتقل بعد ذلك للحديث عن العبادات في القسم الأول من الكتاب، وهو مكون من عدة فصول، تشمل الطهارة ومعناها وأنواعها وشروطها عند المذاهب الأربعة، وكذلك يشمل النجاسات، والاستنجاء، والوضوء، والغسل، والتيمم. ثم يبدأ القسم الثاني بالحديث عن الصلاة، وكل ما يتعلق بها من تفصيلات وأحكام، ويشمل هذا القسم عدد من الفصول حول شروطها وأركانها وواجباتها ومستحباتها وما يتبعها من أذكار وغير ذلك من الأحكام التفصيلية التي يؤصلها لنا الدكتور وهبة الزحيلي. ",
    "وهبة الزحيلي ",
    "4.5",
    "90",
    "العربية",
    "200",
    " وهبة بن مصطفى الزُحَيْلي الدِمَشقي ، أحد أبرز علماء أهل السنة والجماعة من سوريا في العصر الحديث، عضو المجامع الفقهية بصفة خبير في مكة وجدة والهند وأمريكا والسودان.[1] ورئيس قسم الفقه الإسلامي ومذاهبه بجامعة دمشق، كلية الشريعة. حصل على جائزة أفضل شخصية إسلامية في حفل استقبال السنة الهجرية ",
    " https://drive.google.com/file/d/1QMSAITJBo-HzqrS1hpyB-1pQBzeypd4f/view?usp=share_link ",
    " none"
)


val doctrine4 = FieldModel(
    R.drawable.fqh6,
    " هداية المتعبد السالك ",
    "يوضح الشيخ صالح عبد السميع الأزهرى فى هذا الكتابهداية المتعبد السالك كثيرا من أمور الصلاة والوضوء والطهارة وما يدور فى رحابهم, فقد تناول الكتاب فى فصوله الطهارة وفرائض الوضوء, ونواقض الوضوء, وواجبات الغسل, وبيان ما يحل للجنب, وشرح التيمم وكذلك الحيض والنفاس ومايستوجبان وأيضا قام المؤلف فى كتابه بذكر شروط الصلاة وفرائضها وفضائلها, وقد تناول كل منهم فى فصل على حده. ",
    "الشيخ الأخضري ",
    "4.0",
    "90",
    "العربية",
    "500",
    " كان الشيخ الأخضري -رحمه الله- عالما صالحًا زاهدًا ورعًا ذا قدم راسخ في المعقول والمنقول، رحل في طلب العلم إلى تونس، ثم عاد منها إلى بنطيوس، ثم سافر مرة أخرى إلى قسنطينة بالجزائر فأخذ عن علمائها، ثم رجع إلى بلدته واستقر بها ودرَّس بالزاوية التي أنشأها جده محمد بن عامر وتفرغ لها واشتغل فيها بالإقراء والتدريس وإفادة الطلاب وتخريجهم، وأمَّها طلبة العلم من أماكن مختلفة من الجزائر، وجل تآليفه تلقاها المعلمون بالقبول والمتعلمون بالحفظ والاستفادة ",
    "https://drive.google.com/file/d/1PjTAZIIC8OLtb4bIL8D-L9T1mqdcyEoM/view?usp=share_link ",
    " none"
)


val doctrine5 = FieldModel(
    R.drawable.fqh2,
    " الفقه الإسلامي ومدارسه  ",
    " كانت منظمة اليونسكو العالمية، قبل بضعة عشر عاماً، قد أصدرت كتاباً عن الإسلام من جميع جوانبه، استكتبت فيه بعض الكتاب الأجانب، ومنهم يهود، فأعطى صورة مشوهة قاتمة عن الإسلام أثارت إحتجاجات وإعتراضات من جهات ومراجع إسلامية",
    "مصطفى أحمد الزرقاء",
    "4.4",
    "90",
    "العربية",
    "90",
    "مصطفى أحمد الزرقاء عالم سوري من أبرز علماء الفقه في العصر الحديث، أطل على العالم الإسلامي في وقت كان يئن تحت نير الاستعمار الإنجليزي والفرنسي الذي أدى إلى تراجع البلاد وانهيارها سياسيا واقتصاديا واجتماعيا وفكريا. ",
    " https://drive.google.com/file/d/1BYRPJbRArqxiq2fq97I4w3TjDEZbImCD/view?usp=share_link ",
    " none"
)

val doctrine6 = FieldModel(
    R.drawable.fqh5,
    " الفقه الإسلامي في ثوبه الجديد",
    " مدخل فقهي عام",
    "مصطفى أحمد الزرقاء",
    "4.9",
    "100",
    "العربية",
    "80",
    "مصطفى أحمد الزرقاء عالم سوري من أبرز علماء الفقه في العصر الحديث، أطل على العالم الإسلامي في وقت كان يئن تحت نير الاستعمار الإنجليزي والفرنسي الذي أدى إلى تراجع البلاد وانهيارها سياسيا واقتصاديا واجتماعيا وفكريا. ",
    " https://drive.google.com/file/d/1BYRPJbRArqxiq2fq97I4w3TjDEZbImCD/view?usp=share_link ",
    " none"
)

///////////////////////////Categories////////////////////////////////////////////
val myLiterateFields = arrayListOf(
    Literature1,
    Literature2,
    Literature3,
    Literature4,
    Literature5,
    Literature6,
    Literature7,
    Literature8,
    Literature9,
    Literature10
)
val myFantasyFields = arrayListOf(
    imagination1,
    imagination2,
    imagination3,
    imagination4,
    imagination5,
    imagination6,
    imagination7,
    imagination8,
    imagination9,
    imagination10
)
val myDevelopingFields = arrayListOf(
    self_dev1,
    self_dev2,
    self_dev3,
    self_dev4,
    self_dev5,
    self_dev6,
    self_dev7,
    self_dev8,
    self_dev9,
    self_dev10
)
val myHistoryFields = arrayListOf(h1, h2, h3, h4, h5, h6, h7, h8, h9, h10)
val myNovelFields = arrayListOf(novel1, novel2, novel3, novel4, novel5, novel6, novel7, novel8, novel9, novel10)
val myLawFields = arrayListOf(low1, low2, low3, low4, low5, low6, low7, low8, low9, low10)
val myReligionField = arrayListOf(r1, r2, r3, r4, r5, r6, r7, r8, r9, r10, r11, r12)
val myFearFields = arrayListOf(fear1, fear2, fear3, fear4, fear5, fear6, fear7, fear8, fear9, fear10)
val myPolicyFields = arrayListOf(pol1, pol2, pol3, pol4, pol5, pol6, pol7, pol8, pol9, pol10)
val myPhilosophyFields = arrayListOf(phi1, phi2, phi3, phi4, phi5, phi6, phi7, phi8, phi9, phi10)
val myCrimeFields = arrayListOf(cri1, cri2, cri3, cri4, cri5, cri6, cri7, cri8, cri9, cri10)
val myFqhFields = arrayListOf(doctrine1, doctrine2, doctrine3, doctrine4, doctrine5, doctrine6)

///////////////////////////////////Home//////////////////////////////////
val myForYouBooks = arrayListOf(h1, novel1, low1, r1, cri5, fear1, pol1, phi1, cri1, doctrine1)
val myMostReadingBooks =
    arrayListOf(Literature1, imagination1, self_dev1, h2, novel4, doctrine4, low2, self_dev9, phi9, r6)
val myPopularBooks = arrayListOf(phi1, self_dev7, pol3, doctrine4, fear2, imagination7, Literature8, low10, low2, pol10)
val myBooks =
    arrayListOf(fear6, Literature7, pol8, imagination5, fear5, imagination9, fear7, Literature6, doctrine6, self_dev6)
val myNovels = arrayListOf(doctrine6, novel10, h6, pol4, cri5, h6, fear6, fear8, cri9, h10)

///////////////////////////////Cart///////////////////////////////////////
val myFieldsInCart = arrayListOf<FieldModel>()
